{
    "header": {
        "main": "Головна",
        "music": "Музика",
        "game": "Гра",
        "comics": "Комікс",
        "book": "Книга"
    },

    "about": {
        "hero-h1": "Привіт, я Нікіта",
        "hero-h3": "Ви знаходитесь на сторінці мого проєкт в якому я закриваю всі свої творчі гештальти",
        "hero-paragraph": "Ще з дитинства я постійно намагався пробувати різне, від програмування до написання маленьких розмповідей і музики, проте я майже ніколи не доводив жодного проекту до кінця, тож у мене з'явився деякий гештальт пов'язаний з кожною сферою в якій я щось пробував, тому на час коли я мав би закінчувати школу, тобто літо 2023 року, я вирішив створити по одному готовому проекту з кожної галузі, щоб показати собі, а також і вам, чого я навчився за весь цей час. На цій сторінці ви зможете ознайомитись з усіма проектами, а також завантажити собі їх цифрові версії.",
        "hero-span": "Отже я презентую вам:",
        "hero-span-presentation-1": "1) Музичний альбом (Музика)",
        "hero-span-presentation-2": "2) Візуальну новелу (Програмування)",
        "hero-span-presentation-3": "3) Комікс (Малювання)",
        "hero-span-presentation-4": "4) Книжку (Письменництво)",
        "hero-alt-text": "Це я",
        
        "music-h3": "Музика",
        "music-about": "На сторінці Музика ви зможете прослухати два альбоми:",
        "music-span-1": "Поэт без имени",
        "music-paragraph-1": " - це альбом, над яким я працював у важкий період свого життя. Я відчував сильний упадок сил та падіння мотивації, але бажання довести хоч щось до кінця допомогло мені. Цей альбом був створений на основі реальних подій у моєму житті, які сильно вплинули на моє світосприйняття.",
        "music-span-2": "Помилка вцілілого",
        "music-paragraph-2": "  - це альбом, який я створив, щоб висловити свої думки та емоції, які я відчував протягом року. Це був найважливіший період у моєму житті, і я не знаю, як би я впорався з ним без музики. Цей рік дуже сильно змінив мене. Я став сильнішим, але водночас і більш вразливим. Я навчився цінувати кожен момент життя, і я більше не боюся висловлювати свої думки своєю мовою.",
        "music-paragraph-3": "Я вклав у ці альбоми всю свою душу, і я вважаю, що вони заслуговують на увагу. Я сподіваюся, що ви послухаєте їх і знайдете в них щось для себе.",
        "music-alt-text": "Альбоми",
        
        "learn-more": "Дізнатись більше",
        "download": "Завантажити",

        "game-h3": "Гра (Візуальна новела)",
        "game-about": "На сторінці Гра ви зможете:",
        "game-paragraph-1": "Ознайомитися з візуальною новелою під назвою",
        "game-span": "\"Останній відпочинок\"",
        "game-paragraph-2": ". Ця новела розповість вам про звичайного жителя міста Кіфі на ім'я Олексій. Дізнатися про те, як звичайне життя Олексія руйнується з падінням метеорита на місто. Люди, що вдихають газ від метеорита, перетворюються на гуманоїдів. Приймати рішення, які впливатимуть на те, чи зможе Олексій вижити.",
        "game-alt-text": "Іконка візуальної новели",

        "comics-h3": "Комікс",
        "comics-about": "На сторінці Комікс ви зможете:",
        "comics-paragraph-1": "Ознайомитись та заванажити комікс",
        "comics-span": "\"Літера смерті. Останній вирок\"",
        "comics-paragraph-2": ". Цей комікс розповість вам історію Віктора, який бореться за виживання свого рідного міста. Місто погрязло в корупції, але його жителі все ще хочуть жити та розвиватися. Чи зможе Віктор врятувати своє місто від себе ж самого?",
        "comics-alt-text": "Обкладинка комікса",

        "book-h3": "Книга",
        "book-about": "На сторінці Книга ви зможете:",
        "book-paragraph-1": "Збірник розповідей про світ майбутнього",
        "book-span": "\"Тридцятий рік після падіння метеориту\"",
        "book-paragraph-2": ". Цей збірник містить історії про людей з різних прошарків суспільства, які розповідають про свій досвід життя в постапокаліптичному світі. Історії написані з різних перспектив та в різних стилях, щоб задовольнити смаки кожного читача.",
        "book-alt-text": "Обкладинка книги"
    },

    "music": {
        "music-h1": "Музика",
        "music-paragraph": "Я багато років планував написати свій перший музичний альбом. Для мене музичний альбом – це не просто збірка з 10 +/- треків. Це щось значуще, це якась історія. Саме тому я вирішив написати концептуальний альбом. Перший альбом називається \"Поет без имени\". Він написаний російською мовою і розповідає про деякий етап мого життя, який прикрашений деякими обставинами та образами, але події були реальними. Свій другий альбом я почав писати ще навіть не закінчивши перший. У 2022 році Росія вторглася в Україну. Я зрозумів, що не можу писати пісні російською, тож вирішив зібрати весь свій досвід та всі свої емоції за рік та вкласти їх у альбом, який отримав назву \"Помилка вцілілого\". Весь альбом я робив сам від початку і до кінця. Я написав біти, тексти та зробив зведення треків також самотужки. Сподіваюся, вам сподобається те, що у мене вийшло.",
        "music-span": "Приємного прослуховування!",

        "album-1-h3": "Поэт без имени",
        "album-1-paragraph": "Альбом \"Поэт без имени\" був для мене особливим проектом. Він став результатом важкого періоду в моєму житті, коли я відчував сильний упадок сил та падіння мотивації з натхненням. Тоді я був зовсім іншою людино, я навіть писав його ще російською, тож у якоусь сенсі цей альбом є зліпком мене минулого. Я створював його у той час коли я постійно думав про те, щоб припинити свою музичну кар'єру, але бажання довести хоч щось до кінця допомогло мені. Цей альбом був створений на основі реальних подій у моєму житті, які сильно вплинули на моє світосприйняття. Він вийшов не таким, яким я його спочатку планував, але я все одно пишаюся ним. Я вклав у нього всю свою душу, і я вважаю, що він заслуговує на увагу.",
        "album-1-span": "Тож я сподіваюся, що ви все ж послухаєте його і знайдете в ньому щось для себе.",
        "album-1-alt": "Обкладинка альбома \"Поэт без имени\"",

        "album-2-h3": "Помилка вцілілого",
        "album-2-paragraph": "Альбом \"Помилка вцілілого\" став для мене місцем, де я зміг висловити свої думки та емоції, які я відчував протягом року. Це був найважливіший період у моєму житті, і я не знаю, як би я впорався з ним без музики. Цей рік дуже сильно змінив мене. Я більше не той, хто був раніше. Я став сильнішим, але водночас і більш вразливим. Я навчився цінувати кожен момент життя, і я більше не боюся висловлювати свої думки своєю мовою. Тому я хотів, щоб цей альбом був не просто збіркою пісень, а цілісною історією моєї внутрішньої боротьби. Я хотів, щоб він був нагадуванням про те, що ми всі переживаємо складні часи, і що ми можемо продовжувати творити та жити, навіть коли все здається втраченим.",
        "album-2-span": "Я сподіваюсь, що альбом вам сподобається, тож я бажаю вам приємного прослуховування.",
        "album-2-alt": "Обкладинка альбома \"Помилка вцілілого\""
    },

    "game": {
        "game-h1": "Останній відпочинок",
        "game-paragraph-1": "Зануртеся в постапокаліптичний світ, де люди перетворюються на небезпечних гуманоїдів. У цій візуальній новелі ви граєте за Олексія, рядового військового, який намагається вижити в цьому новому, жорстокому світі. Ви будете стикатися з небезпечними гуманоїдами, а також з іншими людьми, які можуть бути не менш небезпечними. Вам потрібно буде використовувати всі свої навички та вміння, щоб вижити та знайти свій шлях у цьому новому світі. Ось деякі з ключових особливостей візуальної новели:",
        "game-paragraph-2": "- Постапокаліптичний світ, де люди перетворюються на небезпечних гуманоїдів.",
        "game-paragraph-3": "- Непередбачуваний сюжет, який триматиме вас у напрузі до самого кінця.",
        "game-paragraph-4": "Якщо ви любите постапокаліпсис, пригоди та вибір, то вам обов'язково сподобається ця візуальна новела.",
        "game-span": "Сподіваюсь вам сподобається поданий варіант історії, тож приємної гри!",
        "game-pre-btn": "Завантажити гру можна натиснувши на цю кнопку",
        "game-btn": "Завантажити гру"
    },

    "comics": {
        "comics-tab-1": "Про комікс",
        "comics-tab-2": "Читати",

        "comics-h1": "Літера смерті. Останній вирок",
        "comics-paragraph": "Комікс \"Літера смерті. Останній вирок\" розповісь вам історію Віктора, одного з бетатестерів новітнього гаджета Его. Віктор – звичайний чоловік, який мріє про краще майбутнє для свого міста. Але одного дня гаджет дає збій і єдиним питанням, яке лишається у його голові стає: \"Якщо вбити усіх корупціонерів міста, чи стане жити легше, чи доведеться знищити усе місто цілком?\"",

        "comics-left-btn": "<-",
        "comics-right-btn": "->"
    },

    "book": {
        "book-tab-1": "Про книгу",
        "book-tab-2": "Читати",

        "book-h1": "Тридцятий рік після падіння метеорита",
        "book-paragraph": "Збірник розповідей \"Тридцятий рік після падіння метеорита\" розповість вам історії жителів останнього міста на землі, яка змінилась до невпізнання після падіння метеорита. Чи захочеш ти жити у цьому світі вирішувати тобі, але для початку було б добре дізнатись про цей світ більше Збірник розповідей \"Тридцятий рік після падіння метеорита\" розповість вам про життя людей в постапокаліптичному світі, який змінився до невпізнання після падіння великого метеорита. Ви діхнаєтесь історії життя різних людей з різних прошарків суспільства, в яких можна буде побачити зліпок устрою життя нового світу. Чи захотіли б ви жити в цьому світі? Це питання, на яке ви повинні відповісти самі. Але для цього вам доведеться зануритись у цю книжку та дізнатись більше про нього."
    },

    "footer":{
        "footer-text": "Дякую за увагу!"
    }
}