{
    "header": {
        "main": "Головна",
        "music": "Музика",
        "game": "Ігри",
        "comics": "Комікси",
        "book": "Книги"
    },

    "about": {
        "hero-h1": "Привіт, я Нікіта",
        "hero-h3": "Ви знаходитесь на сторінці мого проєкт в якому я закриваю всі свої творчі гештальти",
        "hero-paragraph": "Ще з дитинства я постійно намагався пробувати різне, від програмування до написання маленьких розмповідей і музики, проте я майже ніколи не доводив жодного проекту до кінця, тож у мене з'явився деякий гештальт пов'язаний з кожною сферою в якій я щось пробував, тому на час коли я мав би закінчувати школу, тобто літо 2023 року, я вирішив створити по одному готовому проекту з кожної галузі, щоб показати собі, а також і вам, чого я навчився за весь цей час. На цій сторінці ви зможете ознайомитись з усіма проектами, а також завантажити собі їх цифрові версії.",
        "hero-span": "Отже я презентую вам:",
        "hero-span-presentation-1": "1) Музичні альбоми (Музика)",
        "hero-span-presentation-2": "2) Ігри (Програмування)",
        "hero-span-presentation-3": "3) Комікси (Малювання)",
        "hero-span-presentation-4": "4) Книги (Письменництво)",
        "hero-alt-text": "Це я",
        
        "music-h3": "Музика",
        "music-about": "На сторінці Музика ви зможете прослухати два альбоми:",
        "music-span-1": "\"Поэт без имени\"",
        "music-paragraph-1": " - це альбом, над яким я працював у важкий період свого життя. Я відчував сильний упадок сил та падіння мотивації, але бажання довести хоч щось до кінця допомогло мені. Цей альбом був створений на основі реальних подій у моєму житті, які сильно вплинули на моє світосприйняття.",
        "music-span-2": "\"Помилка вцілілого\"",
        "music-paragraph-2": "  - це альбом, який я створив, щоб висловити свої думки та емоції, які я відчував протягом року. Це був найважливіший період у моєму житті, і я не знаю, як би я впорався з ним без музики. Цей рік дуже сильно змінив мене. Я став сильнішим, але водночас і більш вразливим. Я навчився цінувати кожен момент життя, і я більше не боюся висловлювати свої думки своєю мовою.",
        "music-paragraph-3": "Я вклав у ці альбоми всю свою душу, і я вважаю, що вони заслуговують на увагу. Я сподіваюся, що ви послухаєте їх і знайдете в них щось для себе.",
        "music-alt-text": "Альбоми",
        
        "learn-more": "Дізнатись більше",
        "download": "Завантажити",

        "game-h3": "Ігри",
        "game-about": "На сторінці Ігри ви зможете:",
        "game-paragraph-1": "Ознайомитися з візуальною новелою під назвою",
        "game-span": "\"Останній відпочинок\"",
        "game-paragraph-2": ". Ця новела розповість вам про звичайного жителя міста Кіфі на ім'я Олексій. Дізнатися про те, як звичайне життя Олексія руйнується з падінням метеорита на місто. Люди, що вдихають газ від метеорита, перетворюються на гуманоїдів. Приймати рішення, які впливатимуть на те, чи зможе Олексій вижити.",
        "game-2-paragraph-1": "Ознайомитися з грою у стилі roguelike під назвою",
        "game-2-span": "\"Під домом\"",
        "game-2-paragraph-2": ". Ця гра покаже вам історію боротьби із минулим. Головний герой прокидається у підземеллі, яке дуже сильно нагадує йому його старий дім, де він жив із батьками у дитинстві. Чи зможе він перебороти себе та свої спогади, які він буде знаходити на своєму шляху, щоб повернутись додому.",
        "game-alt-text": "Іконки ігор",

        "comics-h3": "Комікси",
        "comics-about": "На сторінці Комікси ви зможете:",
        "comics-paragraph-1": "Ознайомитись та завантажити комікс",
        "comics-span": "\"Літера смерті. Останній вирок\"",
        "comics-paragraph-2": ". Цей комікс розповість вам історію Віктора, який бореться за виживання свого рідного міста. Місто погрязло в корупції, але його жителі все ще хочуть жити та розвиватися. Чи зможе Віктор врятувати своє місто від себе ж самого?",
        "comics-2-paragraph-1": "Ознайомитись та завантажити комікс",
        "comics-2-span": "\"Дорога додому\"",
        "comics-2-paragraph-2": ". Цей комікс розповість вам історію двох друзів, які були змушені покинути рідне місто коли неподалік від нього, на Кіфі впав метеорит, але за кілька років місто було звільнене і вони вирішили повернутись, так чи вдасться це у них?",
        "comics-alt-text": "Обкладинки коміксів",

        "book-h3": "Книги",
        "book-about": "На сторінці Книги ви зможете:",
        "book-paragraph-1": "Прочитати і завантажити збірник розповідей про світ майбутнього",
        "book-span": "\"Тридцятий рік після падіння метеориту\"",
        "book-paragraph-2": ". Цей збірник містить історії про людей з різних прошарків суспільства, які розповідають про свій досвід життя в постапокаліптичному світі. Історії написані з різних перспектив та в різних стилях, щоб задовольнити смаки кожного читача.",
        "book-2-paragraph-1": "Прочитати і завантажити фантастично-наукову оповідь",
        "book-2-span": "\"Проміжне покоління\"",
        "book-2-paragraph-2": ". Ця оповідь повідає вам про покоління людей, які народились та виросли на космічному кораблі\"Арго\", який був побудований задля міжгалактичної експансії. Коли корабель вже наближається до вильоти з Чумацького шляху у екіпажу корабля постає питання чи дійсно їм варто летіти ще далі від Землі, але в момент голосування їх перериває дещо.",
        "book-alt-text": "Обкладинки книг"
    },

    "music": {
        "music-h1": "Музика",
        "music-paragraph": "Я багато років планував написати свій перший музичний альбом. Для мене музичний альбом – це не просто збірка з 10 +/- треків. Це щось значуще, це якась історія. Саме тому я вирішив написати концептуальний альбом. Перший альбом називається \"Поет без имени\". Він написаний російською мовою і розповідає про деякий етап мого життя, який прикрашений деякими обставинами та образами, але події були реальними. Свій другий альбом я почав писати ще навіть не закінчивши перший. У 2022 році Росія вторглася в Україну. Я зрозумів, що не можу писати пісні російською, тож вирішив зібрати весь свій досвід та всі свої емоції за рік та вкласти їх у альбом, який отримав назву \"Помилка вцілілого\". Весь альбом я робив сам від початку і до кінця. Я написав біти, тексти та зробив зведення треків також самотужки. Сподіваюся, вам сподобається те, що у мене вийшло.",
        "music-span": "Приємного прослуховування!",

        "album-1-h3": "Поэт без имени",
        "album-1-paragraph": "Альбом \"Поэт без имени\" був для мене особливим проектом. Він став результатом важкого періоду в моєму житті, коли я відчував сильний упадок сил та падіння мотивації з натхненням. Тоді я був зовсім іншою людино, я навіть писав його ще російською, тож у якоусь сенсі цей альбом є зліпком мене минулого. Я створював його у той час коли я постійно думав про те, щоб припинити свою музичну кар'єру, але бажання довести хоч щось до кінця допомогло мені. Цей альбом був створений на основі реальних подій у моєму житті, які сильно вплинули на моє світосприйняття. Він вийшов не таким, яким я його спочатку планував, але я все одно пишаюся ним. Я вклав у нього всю свою душу, і я вважаю, що він заслуговує на увагу.",
        "album-1-span": "Тож я сподіваюся, що ви все ж послухаєте його і знайдете в ньому щось для себе.",
        "album-1-alt": "Обкладинка альбома \"Поэт без имени\"",

        "album-2-h3": "Помилка вцілілого",
        "album-2-paragraph": "Альбом \"Помилка вцілілого\" став для мене місцем, де я зміг висловити свої думки та емоції, які я відчував протягом року. Це був найважливіший період у моєму житті, і я не знаю, як би я впорався з ним без музики. Цей рік дуже сильно змінив мене. Я більше не той, хто був раніше. Я став сильнішим, але водночас і більш вразливим. Я навчився цінувати кожен момент життя, і я більше не боюся висловлювати свої думки своєю мовою. Тому я хотів, щоб цей альбом був не просто збіркою пісень, а цілісною історією моєї внутрішньої боротьби. Я хотів, щоб він був нагадуванням про те, що ми всі переживаємо складні часи, і що ми можемо продовжувати творити та жити, навіть коли все здається втраченим.",
        "album-2-span": "Я сподіваюсь, що альбом вам сподобається, тож я бажаю вам приємного прослуховування.",
        "album-2-alt": "Обкладинка альбома \"Помилка вцілілого\""
    },

    "game": {
        "game-h1": "Ігри",
        "game-paragraph": "Я завжди любив відеоігри. Ще з дитинства я проводив години за комп'ютером, занурюючись у захоплюючі віртуальні світи. Коли я підріс, моя любов до ігор нікуди не поділася. Я почав мріяти про створення власних ігор, які зможуть перенести гравців у власні атмосферні світи. Тож в рамках цього проєкту я створив дві абсолютно різні гри. Перша - це візуальна новела у жанрі постапокаліпсису, де вам буде необхідно приймати рішення, які впливатимуть на ваш шлях. А друга - це гра у жанрі roguelike, де вам доведеться боротися із дитячими страхами та спробувати зрозуміти батьків.",
        "game-span": "Я дуже сподіваюсь, що вам сподобається моя робота, тож бажаю вам цікавих пригод.",

        "game-1-about-h3": "Останній відпочинок",
        "game-1-about-alt": "Іконка візуальної новели \"Останній відпочинок\"",
        "game-1-about-paragraph": "Зануртеся в постапокаліптичний світ, де люди перетворюються на небезпечних гуманоїдів. У цій візуальній новелі ви граєте за Олексія, звичайного жителя міста Кіфі, який намагається вижити в цьому новому, жорстокому світі. Ви будете стикатися з небезпечними гуманоїдами, а також з іншими людьми, які можуть бути не менш небезпечними.",

        "game-2-about-h3": "Під домом",
        "game-2-about-alt": "Іконка гри \"Під домом\"",
        "game-2-about-paragraph": "Ви повертається до будинку, де виросли, щоб знайти відповіді на питання про своє минуле. Але підземелля, що ховаються під будинком, виявляються небезпечнішими, ніж ви могли собі уявити. Ви повинні боротися зі своїми дитячими страхами, щоб знайти вихід на гору. Але чим більше ви дізнаєтесь про свою сім'ю, тим більше ви починаєте сумніватися в тому, що хочете справді знайти.",

        "game-1-h1": "Останній відпочинок",
        "game-1-paragraph-1": "Тихе життя пересічного міста Кіфі раптово перевернулося з ніг на голову, коли на нього впав загадковий метеорит. Зелений туман, що вивільнився з метеорита, почав перетворювати жителів на жахливих мутантів та кривавожерливих монстрів. В цьому епіцентрі хаосу опиняється звичайний хлопчина Олексій. Йому доведеться проявити весь свій розум та винахідливість, аби вижити в цьому жахітті та дістатися до урядового рятувального гвинтокрила під назвою “Рятувальний ковчег”. По дорозі Олексію зустрічатимуться як союзники, так і вороги. Доведеться приймати важкі рішення: кому довіряти, а кого оминати. Адже тепер кожна помилка може коштувати життя. Чи зможе звичайний хлопчина вижити в цьому жахітті й добратися до порятунку? Чи залишиться він людиною попри всі жахіття навколо? Від ваших рішень залежатиме його майбутнє.",
        "game-1-paragraph-2": "Жанр: Візуальна новела",
        "game-1-paragraph-3": "Рік випуску: 2024",
        "game-1-paragraph-4": "Автор: Нікіта Бережний",
        "game-1-paragraph-5": "Гру можна завантажити натиснувши на кнопку",

        "game-2-h1": "Під домом",
        "game-2-paragraph-1": "Після трагічної смерті батьків, ви повертаєтесь в будинок свого дитинства, щоб зіткнутися зі спогадами минулого. Це не проста подорож крізь час - адже стіни будинку пам'ятають усе. Блукаючи кімнатами, ви раптом відкриваєте приховану раніше таємничу комору. І робите крок у невідомість - комора веде вас у підземний лабіринт. Тут, в глибині, вас чекають забуті дитячі страхи та тривоги минулого. Щоб знайти вихід, доведеться зіткнутися віч-на-віч з внутрішніми демонами, яких ви колись уникали. Кожна сутичка - це можливість зрозуміти себе та своїх батьків краще. Зрештою, від вас залежатиме - чи зможете змиритися з минулим та піти далі, чи залишитеся в полоні спогадів назавжди.",
        "game-2-paragraph-2": "Жанр: RogueLike",
        "game-2-paragraph-3": "Рік випуску: 2024",
        "game-2-paragraph-4": "Автор: Нікіта Бережний",
        "game-2-paragraph-5": "Гру можна завантажити натиснувши на кнопку"
    },

    "comics": {
        "comics-h1": "Комікси",
        "comics-paragraph": "Скільки себе пам'ятаю я завжди мріяв створювати свої комікси. Вони завжди були для мене чудовим способом поринути у захоплюючі історії та перенестися в інші світи. З дитинства я зачитувався пригодницькими коміксами, мріючи сам стати супергероєм. З часом мій смак трохи змінився, але любов до коміксів залишилася. Тож я продовжував придумувати якісь концепції та сюжети для коміксів, але майже ніколи не доводив їх до кінця, тому створюючи цей проєкт я не міг не приміряти на себе ролі коміксиста та створити дві різні за жанром історії. Перша - це трилер \"Літера смерті. Останній вирок\", де головний герой ненавмисно стає серійним вбивцею. Друга ж - пригодницька історія \"Дорога додому\" про друзів дитинства, які пробираються крізь небезпечні місця. Я дуже сподіваюся, що ці комікси зможуть перенести вас в атмосферні світи, створені моєю уявою.",
        "comics-span": "Бажаю вам цікавого читання та незабутніх пригод!",

        "comics-tab-1": "Про комікс",
        "comics-tab-2": "Читати",

        "comics-1-about-h3": "Літера смерті. Останній вирок",
        "comics-1-about-alt": "Обкладинка коміксу \"Літера смерті. Останній вирок\"",
        "comics-1-about-paragraph": "Уявіть, що ви отримали гаджет, який змінює особистість. Але він пробуджує у вас серійного вбивцю. Саме це сталося з героєм коміксу \"Літера смерті. Останній вирок\". Він став бета-тестером гаджета Его, що змінює характер. Але несподівано у місті почалися жорстокі вбивства. І всі сліди ведуть до головного героя. Хто він насправді? Чи зможе він перебороти свою темну сторону? Пориньте у захоплюючий світ подвійної особистості та неочікуваних поворотів у коміксі \"Літера смерті. Останній вирок\".",

        "comics-2-about-h3": "Дорога додому",
        "comics-2-about-alt": "Обкладинка коміксу \"Дорога додому\"",
        "comics-2-about-paragraph": "Уявіть, що ви мусите тікати з дому через катастрофу. А потім дізнаєтесь, що туди можна повернутися. Саме це трапляється з героями коміксу \"Дорога додому\". Колись друзі Ігор і Данило тікали з рідного селища через наслідки падіння метеорита. А тепер почули, що туди можна повернутися. Незважаючи на небезпеки, хлопці вирушають у рисковану подорож додому. Це стає випробуванням їхньої дружби та відваги. Чи дістануться вони до мети? І що чекатиме їх у зруйнованому селищі? Дізнайтеся у захопливому коміксі \"Дорога додому\"!",

        "comics-1-h1": "Літера смерті. Останній вирок",
        "comics-1-paragraph-1": "Новий гаджет Его обіцяє змінити ваше життя. Проте для Віктора він стає джерелом жаху. Після того, як Віктор вмикає пристрій перед вечіркою, щоб стати впевненішим, він раптом втрачає контроль над власним тілом. Його темна альтернативна особистість починає вчиняти жорстокі вбивства. Чи зможе Віктор перемогти власного демона? Чи тисячі невинних стануть жертвами божевільного експерименту?",
        "comics-1-paragraph-2": "Жанр: Трилер",
        "comics-1-paragraph-3": "Рік випуску: 2024",
        "comics-1-paragraph-4": "Автор: Нікіта Бережний",
        "comics-1-paragraph-5": "Кількість сторінок: 56",
        "comics-1-paragraph-6": "Комікс можна завантажити у форматі .pdf натиснувши на кнопку",
        "comics-1-img-alt": "Обкладинка коміксу \"Літера смерті. Останній вирок\"",

        "comics-2-h1": "Дорога додому",
        "comics-2-paragraph-1": "За кілька років після катастрофи в Кіфі друзі дитинства Ігор та Данило вирушають у небезпечну подорож, аби повернутися додому. Не зважаючи на попередження, вони таємно пробираються крізь зруйновані землі, повні мутантів та небезпек. Адже дім - це не просто будівля чи місце. Це спогади, які неможливо втратити. Чи зможуть Ігор та Данило подолати всі перешкоди і знову відчути себе вдома? Чи варто ризикувати заради минулого, якого вже не повернути? І що насправді означає \"дім\"?",
        "comics-2-paragraph-2": "Жанр: Пригоди",
        "comics-2-paragraph-3": "Рік випуску: 2024",
        "comics-2-paragraph-4": "Автор: Нікіта Бережний",
        "comics-2-paragraph-5": "Кількість сторінок: 20",
        "comics-2-paragraph-6": "Комікс можна завантажити у форматі .pdf натиснувши на кнопку",
        "comics-2-img-alt": "Обкладинка коміксу \"Дорога додому\""
    },

    "book": {
        "book-h1": "Книги",
        "book-paragraph": "Чесно кажучи, читання книг ніколи не було моїм улюбленим заняттям, та й книг за своє життя я прочитав не так то і багато. Проте сама концепція розповіді історії лише за допомогою слів завжди здавалася мені цікавою та кидала певний виклик. І ось тепер я сам спробував свої сили у написанні фантастичних історій, щоб подолати цей виклик. Хоча я й не є заядлим книголюбом, проте сподіваюся, що мої історії зможуть зацікавити читачів. Перша - \"30 рік після нашої ери\" - це пригода вченого в постапокаліптичному світі. Друга - \"Проміжне покоління\" - про складний вибір між традиціями пращурів та власним шляхом.Я дуже сподіваюсь, що ці книги зможуть перенести вас у незвідані світи та змусити задуматись над вічними питаннями людства.",
        "book-span": "Бажаю вам цікавого читання та незабутніх пригод!",

        "book-tab-1": "Про книгу",
        "book-tab-2": "Читати",

        "book-1-about-h3": "Тридцятий рік після нашої ери",
        "book-1-about-alt": "Обкладинка книги \"Тридцятий рік після нашої ери\"",
        "book-1-about-paragraph": "У світі постапокаліпсису вчений прокидається після тривалого сну. Він опиняється в пустелі, де колись було місто. Щоб дізнатися, що трапилось із людством, він вирушає на пошуки останнього поселення під куполом. Чи вдасться йому дістатися цього міста і знайти відповіді на питання про долю людства? Чи є ще надія врятувати світ від загибелі? Читайте захопливу пригодницьку розповідь про світ майбутнього, щоб дізнатися!",

        "book-2-about-h3": "Проміжне покоління",
        "book-2-about-alt": "Обкладинка книги \"Проміжне покоління\"",
        "book-2-about-paragraph": "У не далекому майбутньому група колоністів відправляється в міжгалактичну подорож на космічному кораблі \"Арго\", щоб знайти новий дім на планеті Едем. Але їх чекає довга і небезпечна мандрівка, яка триватиме століття. Кожне нове покоління на борту має вирішувати - чи варто продовжувати рух в невідомість, чи краще повернутися на Землю або колонізувати якусь ближчу планету. На їхніх плечах лежить відповідальність за долю усього людства. Чи дістануться вони до мети? Читайте захопливу пригодницьку історію про відвагу, дружбу та пошуки нового дому серед зірок!",

        "book-1-h1": "Тридцятий рік після нашої ери",
        "book-1-paragraph-1": "У далекому майбутньому науковець прокидається після тривалого сну і бачить постапокаліптичний світ. Єдиний осередок життя - велетенський куполоподібний комплекс. Подорожуючи туди, вчений знаходить щоденник мандрівника з описом нового світу. А під куполом дізнається жахливі речі про минулого правителя. Розуміючи, що врятувати цей світ неможливо, науковець приймає радикальне рішення. Він створює пристрій, щоб передати попередження в минуле і спробувати все змінити.",
        "book-1-paragraph-2": "Жанр: Постапокаліпсис",
        "book-1-paragraph-3": "Рік випуску: 2024",
        "book-1-paragraph-4": "Автор: Нікіта Бережний",
        "book-1-paragraph-5": "Кількість сторінок: 65",
        "book-1-paragraph-6": "Книгу можна завантажити у форматі .pdf натиснувши на кнопку",

        "book-2-h1": "Проміжне покоління",
        "book-2-paragraph-1": "Далеке майбутнє. Людство перебуває на межі загибелі. Спустошливі війни та екологічні катастрофи зруйнували планету. Але група вчених розробляє відчайдушний план порятунку - міжгалактичну подорож до потенційно придатної для життя екзопланети. Їхній зореліт \"Арго\" вирушає у далеку подорож, що триватиме сотні років. На борту - 150 обраних колоністів, яким судилося стати батьками нової цивілізації. Однак дорогою їх чекають неймовірні випробування. Заколоти, катастрофи, втрата орієнтирів. Чи витримає екіпаж цей важкий хресний шлях до нового дому? І що очікує їх в незвіданій галактиці?",
        "book-2-paragraph-2": "Жанр: Наукова-Фантастика",
        "book-2-paragraph-3": "Рік випуску: 2024",
        "book-2-paragraph-4": "Автор: Нікіта Бережний",
        "book-2-paragraph-5": "Кількість сторінок: 34",
        "book-2-paragraph-6": "Книгу можна завантажити у форматі .pdf натиснувши на кнопку"
    },

    "modal": {
        "modal-h1": "Увага!",
        "modal-p-1": "На жаль, цей проект ще не готовий. Я вирішив продовжити його розробку, але без конкретних термінів завершення. Вибачте за незручності.",
        "modal-p-2": "Ви можете повернутися на ",
        "modal-link-1": "головну сторінку ",
        "modal-p-3": "або повернутись до ",
        "modal-link-2": "сторінки Ігри ",
        "modal-p-4": ". Сподіваємося незабаром запропонувати вам готовий та якісний продукт.",
        "modal-p-5": "Хоч я і не доробив до кінця проєкт, але ви все ж можете продовжити завантаження не доробленої версії натиснувши ",
        "modal-choice-1": "продовжити",
        "modal-p-6": ". або відмінити завантаження натиснувши ",
        "modal-choice-2": "скасувати."
    },

    "404": {
        "404-h1": "Схоже щось не так...",
        "404-alt-text": "Лого проєкту",
        "404-link": "Повернутись на головну?",
        "404-p": "На жаль, сторінку за цим посиланням не знайдено. Можливо, вона була видалена, переміщена або ніколи не існувала."
    },

    "footer":{
        "footer-text": "Дякую за увагу!"
    }
}