# Персонажі
# Кольори для персонажів (палітра гри)
#000000 - чорний
#222222 - темно сірий
#666666 - сірий
#999999 - світло сірий
#FFFFFF - білий
#______________________
#003300 - болотний
#006600 - темно зелений
#009900 - зелений
#00CC00 - салатовий
#66FF66 - зелено-білий
# Головні
define olek = Character("Олексій", color="#FFFFFF")
define mil = Character("Міла", color="#FFFFFF", image="mila")
define rom = Character("Роман", color="#FFFFFF")
#Другорядні
define vla = Character("Владімєр", color="#FFFFFF")
define kok = Character("Григорій", color="#FFFFFF")
# Епізодичні
define vas = Character("Васильович", color="#FFFFFF", image="vasyliovych")
define chel = Character("Чоловік на статуї", color="#FFFFFF")
define noname = Character("???", color="#FFFFFF")
define guch = Character("Гучномовець", color="#FFFFFF")
define gumanoid = Character("Гуманоїд", color="#009900")
define maks = Character("Максим", color="#FFFFFF", image="maks")
define diary = Character(None, kind=nvl, what_text_align=0, what_xalign=0.5)
# Змінні
# Чи вбивав сусіда
define is_kill_neighbor = False
# Чи заправився
define is_refuel = False
# Чи пройшов екскурсії
define is_talk = False
define is_eat = False
define is_command = False
# Чи здобута кінцівка
default persistent.end1 = False
default persistent.end2 = False
default persistent.end3 = False
default persistent.end4 = False
default persistent.end5 = False
default persistent.end6 = False
default persistent.end7 = False
default persistent.end8 = False
default persistent.end9 = False
default persistent.end10 = False
default persistent.end11 = False
default persistent.end12 = False
default persistent.end13 = False
default persistent.end14 = False
default persistent.end15 = False
default persistent.end16 = False
default persistent.end17 = False
default persistent.end18 = False
default persistent.end19 = False
default persistent.end20 = False
default persistent.end21 = False
default persistent.end22 = False
default persistent.end23 = False
default persistent.end24 = False
default persistent.end25 = False
default persistent.end26 = False
default persistent.end27 = False
default persistent.end28 = False
default persistent.end29 = False
default persistent.end30 = False
# Перевірка, чи запускати таемну кінцівку
init:
    $ secret_available = False
label check_secret_availability:
    if (persistent.end1 == True and persistent.end2 == True and persistent.end3 == True and persistent.end4 == True and persistent.end5 == True and
    persistent.end6 == True and persistent.end7 == True and persistent.end8 == True and persistent.end9 == True and persistent.end10 == True and
    persistent.end11 == True and persistent.end12 == True and persistent.end13 == True and persistent.end14 == True and persistent.end15 == True and
    persistent.end16 == True and persistent.end17 == True and persistent.end18 == True and persistent.end19 == True and persistent.end20 == True and
    persistent.end21 == True and persistent.end22 == True and persistent.end23 == True and persistent.end24 == True and persistent.end25 == True and
    persistent.end26 == True and persistent.end27 == True and persistent.end28 == True and persistent.end29 == True):
        $ secret_available = True

init python:
    eye_open = ImageDissolve("images/art/awakening/eye.png", 0.5, 100)
    eye_close = ImageDissolve("images/art/awakening/eye.png", 0.5, 100, reverse=True)

# Музика
define audio.idle_music = "audio/Music/Idle.wav"
define audio.danger_music = "audio/Music/Danger.wav"
define audio.mystery_music = "audio/Music/Mystery.wav"
define audio.main_music = "audio/Music/MainMenu.wav"
# Звуки
define audio.alrm_clock = "audio/Sound/AlrmClock.mp3"
define audio.airbornAlarm = "audio/Sound/AirborneAlarm.mp3"
define audio.airbornCrash = "audio/Sound/AirborneCrash.mp3"



# Початок гри
label start:
    stop music fadeout 3
    window hide
    scene day_1 with fade
    pause(1.5)
    window show
    scene dream_1 with eye_open
    "Сьогодні я знову йду на роботу ввечері"
    "В принципі, як і завжди, але зараз вилиці абсолютно пусті"
    "Не сказати, що це якось дуже дивно, але в цей час на вулицях знаходяться як мінімум алкоголіки, чи вічно гучні підлітки"
    "Чесне слово, я відчуваю себе якимось не таким, коли бачу їх, бо я ніколи не був гучним підлітком, і сподіваюсь ніколи не стану алкоголіком"
    "Втім зараз все пливе як в тумані, ніби я таки випив чимало"
    "..."
    "Крізь уже звичну тишу почав пробиватись якийсь голос"
    noname "Олексію..."
    "Поступово голос почав наближатись і ставати гучніше"
    noname "Олексію... {w} Олексію.."
    "Тепер голос звучав так широко і в той же час близько, що мені здалось, що він у моїй голові"
    "Це був жіночий, ніжний, як море у штиль, голос"
    olek "Хто ви, пані? Що вам треба?"
    scene dream_2 with fade
    noname "Скажи, Олексію, ти готовий?"
    menu:
        "До чого?":
            olek "Вибачте, пані, а до чого?"
            noname "Не питай, якщо не хочеш знати.."
        "Хто ви така?":
            olek "Вибачте, пані, але ви не відповіли на моє питання. Хто ви є?"
            noname "Насправді ти не хочеш знати відповідь..."
        "Звісно готовий":
            olek "Так, пані, я абсолютно готовий"
            noname "Ось і чудово.."
            noname "Тоді, прокинся.."
            jump Secret_end
    "Незнайомка зникла лишивши по собі лише кубчастий слід у небі"
    "За секунду почувся гучний вибух"
    scene dream_3 with hpunch
    "Тепер мої очі застелені зеленим димом"
    "Я не розумію, де та чому саме тут"
    "Хоч і здається, що це та сама вулиця, але обриси будівель був зовсім інший, ніби це навіть не те саме місто"
    "Озирнувшись я помітив, що мене оточують якісь гуманоїдні форми життя"
    "Невже вони націлились на мене?"
    "Добре не час думати, я маю вижити"
    "Тому мені треба..."
    scene black with eye_close
    scene room with eye_open
    ""
    scene black with eye_close
    scene room with eye_open
    "..."
    "Це був лише сон..."
    "Знову жахіття..."
    scene black with eye_close
    scene room with eye_open
    "Після того як мені виповнилось 19 жахіття - це єдині сни які мені сняться"
    "Напевно це мало би щось означати, тим паче, що раніше більшість моїх снів збувалися"
    "Хоча, напевно ні"
    "Це ж просто сни, і максим що вони можуть означати - це те що мій мозок все ще працює"
    "Хоча за одноманітністю мого життя з цим можна і посперичатись"
    "Але досить вже цих думок, все ж будильник зпрацював не даремно і мені час іти на роботу"
    scene entrance
    "На ненависний мені завод, який з кожним днем все більше і більше хочеться покинути"
    "Проте після закінчення війни з росією, років п'ять тому, нас взяли до ЄС та НАТО, через що і провели купу реформ, а заодно і вивели наш бізнес на міжнародний рівень, а от освіта чомусь лишалась така сама.."
    "Тому в нашому місті людям без вищої освіти податися особливо нікуди, крім як на завод чи армію"
    "Та й з вищою освітою особливо нікуди не візьмуть"
    "Така вона столиця"
    "Всім подавай молодого спеціаліста з 10 роками досвіду, та де ж їх взяти?"
    "Хіба що на заводі..."
    scene plant_road_1 with fade
    "Знайомі, які вже працювали, казали вступати у виш, але туди куди я хотів, я не пройшов"
    "Тож вирішив перечекати рік, аби спробувати знову"
    "Але сидіти на шиї у батьків весь рік якось не хотілося, тим паче після трьох років життя в гуртожитку"
    "Тож я вирішив, що треба попрацювати, хоч якось"
    "Перші місяці я був налаштований досить оптимістично і намагався знайти роботу за спеціальністю"
    "Потім були спроби у фріланс та купівляю акцій"
    "Але коли всі гроші на цьому прогоріли до мене все ж дійшло усвідомлення, що треба спуститись з небес на землю і підшукати роботу, яка б змогла мене забезпечувати без ризиків"
    "Тож вибір був, хоч і не найприємнішим, проте очевидним - завод"
    scene plant_road_2 with fade
    "За майже рік роботи тут вже якось нехотілося нічого"
    "Ні вступати у виш, ні пробувати щось вчити самому"
    "Хоча раніше, я пробував робити різне. Від написання коду та сценаріїв до занять спортом і малюванням, ніде звісно особливо яскраво я не сяяв, проте спроби були і я міг би напевно похвалитись деяким багажем умінь, але вони були настільки мізерні, що якось навіть і казати про це було соромно"
    "Втім зараз у мене є стабільність"
    "Яка-не-яка робота охоронцем на заводі, зйомна квартира не подалік і купа вільного часу, який я нікуди не використовую"
    "Найстрашніше у цьому всьому, що я один з наймолодших працівників на заводі, але мені більш комфортно спілкуватись з чоловіками років 40-50 ніж з власними однолітками"
    "Та й таке..."
    scene plant with fade
    "Сьогодні мала бути нічна зміна, тож я прийшов на вахту о 21:50 аби замінити свого напарника Васильовича"
    "Його ім'я, мабуть, не знав ніхто, бо всі звертались до нього по батькові"
    "Ми жили в одному домі, я на п'ятому поверсі, а він на другому"
    show vasyliovych smile at center
    vas "Ну що хлопче готовий до труда та оборону?"
    olek "І вам добрий день. Якось не дуже.."
    vas "Неправильна відповідь! Правильна: завжди готовий!"
    olek "Так-так"
    "Інколи від нього смерділо якоюсь радянськістю, але в цілому він був хорошим мужиком"
    vas normal "До речі, ти чув про метеорит, який десь у нас має впасти"
    olek "Що знову?"
    vas "Та нє, цього разу точно, десь з ранку"
    olek "І де ти про це дізнався?"
    vas "Ну так по телевізору.."
    olek "Ти той Загублений світ на 2+2 більше дивись, може там ще про всесвітню змову дізнаєшся"
    vas "От ти смієшся, а воно буде.."
    olek "Так, звісно.."
    vas "В будь-якому разі, якщо що, приходь до мене, як домовлялись"
    olek "Добре, Васильовичу, якщо що прийду"
    vas smile "Ну от і вирішили, тоді не буду затримувати, пішов я"
    olek "Ага, на добраніч"
    vas "Навзаєм"
    hide vasyliovych
    "Васильович з незмінною посмішкою попрямував додому, ну а я попрямував на пост"
    scene workspace
    "Схоже ця робота була для нього стелею сподівань і мрій"
    "Для мене ж це було не так, проте завод ніби харчувався життєвою силою людей, які тільки підходили до нього, тож сил на спроби знайти нову роботу постійно не вистачало"
    "Хоча в принципі робота не складна, грошей на виживання вистачає, про що ще можна мріяти"
    "Тим паче охоронець на заводі який нікому не потрібен, це фактично не робота, за яку ще й платять"
    "Його максимум можуть знести, аби побудувати новий торговельний комплекс, проте від мене в цьому нічого не могло залежати"
    "За такими думками всі зміни й пролітають, і сьогодні схоже все буде так само..."
    scene clock_ten with fade
    pause(1.0)
    scene clock_four with fade
    pause(1.0)
    scene workspace with fade
    "Навколо все було настільки ж тихо, як у череві кита, який, здавалося, поглинув весь завод, а може й місто"
    "Лише вдалині щось брязкало перериваючи панування тиші"
    "Брязкання вдалині ставало дедалі гучнішим та ближчим, а згодом воно переросло у гуркіт, схожий на зграю проїжджачих далекобійників, проте якби це були вони гуркіт закінчився б, але він тільки ставав ближче і ближче"
    "Я вибіг на двір"
    scene plant with fade
    "Включився сигнал повітряної тривоги"
    "У повітрі з'явилось щось на зразок кам'яної брили, яка невпинно рухалась до землі"
    "Вона летіла приблизно у центр міста, проте я не зміг розгледіти куди саме"
    "Раптом гуркіт припинився і брила скрилась за контурами заводу"
    "На секунду здалося, що всього цього не було і мені лише примарилось це через недосип"
    "Але як тільки я подумав це, мене відкинуло вибуховою хвилею"
    "На заводі пролунало повідомлення про евакуацію"
    guch "Оголошується евакуація, це не навчання, через годину всі мають бути біля Київської гімназії номер 27 там всіх будуть чекати військові"
    guch "Повторюю, оголош.."
    "Пролунав звук схожий на замикання"
    "Оголошення припинилось, як і повітряна тривога"
    "Напевно падіння метеорита викликало, якісь електромагнітні перешкоди"
    scene workspace with fade
    "Я швидко зібрався та побіг додому, до Васильовича"
    scene plant with fade
    "Ми домовлялись, що в разі якихось таких обставин він підбере мене на машині, та ми заберемося з міста, але зараз треба було закликати їхати з військовими"
    scene plant_road_gaz_2 with fade
    "Я біг озираючись навкруги"
    "Людей в цей час як зазвичай не було"
    "Дорогами вже стелився якийсь зелений газ"
    "Схоже на те що він розходився від метеорита"
    "Я облив рукав своєї кофти водою, та прикрив ним свої ніс та рот"
    "Я напевно раніше ніколи так швидко не бігав"
    "Збоку почулось якесь стогнання"
    "Я вирішив подивитись що там відбувається"
    "Я зазирнув у провулок"
    # Напад на г.г. у провулку
    scene black with fade
    "У ньому вже було чимало того зеленого газу, а на землі лежав незнайомець" 
    "Він дуже голосно стогнав та звивався наче на сковорідці"
    "Аж раптом він просто впав нерухомо"
    "Я вирішив підійти по ближче аби дослідити тіло..."
    "Зробив крок {w}Два {w}Три"
    "І ось я був вже біля тіла"
    "Аж раптом незнайомець підскочив та з нелюдським криком почав тягтись до мене"
    "Коли він кричав з його рота витікав зелений газ"
    "Його тіло та обличчя було деформоване, кістки наче проросли в інший бік"
    "Я ледве ухилився від його випаду, та вирішив бігти не вступаючи в контакт з гуманоїдами"
    "Так я вирішив називати людей які змінились через вплив газу"
    "Після цього все було наче в тумані"
    scene plant_road_gaz_1 with fade
    "Я біг не озираючись ні на що"
    "І ось нарешті я побачив свій під'їзд"
    scene entrance with fade
    "Я залетів у нього, дуже швидко підіймаючись сходами до квартири Васильовича"
    "Двері були відкриті"
    "Мене це насторожило, проте я був впевнений на всі 100, що з Васильовичем все добре, він же мужик з досвідом"
    scene vasyliovich_room
    "Я прочинив двері, та покликав його"
    olek "Васильовичу! Де ти є?!"
    "У відповідь нічого не прозвучало"
    "В кімнаті все було розкидано"
    "Це було дуже дивно враховуючи те що у Васильовича завжди було все по місцях"
    "Не сказати, що постійно прям прибрано, але все було на своєму місці"
    "Я повторив"
    olek "Висильовичу! Зараз не час жартувати, виходь!"
    "У відповідь знову нічого"
    "Я подумав, що він можливо заснув, а сон у нього був дуже міцний, такий що і вибухом не розбудиш, тож я зайшов до його спальні"
    # Напад Васильовича
    scene black with fade
    "Васильович кинувся на мене видихаючи мені в обличчя зелений дим"
    "Я спробував відштовхнути його ногами"
    "Сили мені вистачило лише на те, щоб дати собі маленьку фору"
    "Якою я скористувався і встав на ноги"
    "Васильович, а точніше те що раніше ним було, також стало на ноги, та приготувалось до другого кидка"
    $ time = 7
    $ timer_range = 7
    $ timer_jump = 'Timer_neighbor'
    show screen countdown
    menu:
        "Спробувати втекти":
            hide screen countdown
            $ is_kill_neighbor = False
            jump Not_kill_neighbor
        "Спробувати вбити Васильовича":
            hide screen countdown
            $ is_kill_neighbor = True
            jump Kill_neighbor
    return
# Занадто довго приймалось рішення, що робити - Кінцівка 1
label Timer_neighbor:
    # Васильович вдихає газ в г.г.
    scene black with fade
    "Я навіть не встиг вирішити, що робити, як Васильович вже кинувся на мене вдруге"
    "Цього разу мені невдалося навіть зреагувати, як його зуби опинились на моїй шиї"
    "Борися, борися"
    "Повторював я собі в думках, але Васильович був набагато сильнішим, важчим і більшим"
    "Він не давав мені зробити жодного руху поки роздирав мою шию вдихаючи туди зелений газ"
    "Невже все закінчиться саме так?"
    "Невже все що я пройшов до цього буде марним"
    "Я не хочу так помирати.. {w} Я не хочу.."
    "..."
    "Все затихло"
    "Розум почав мутніти"
    "..."
    "І тепер я чую. Чую бажання що кричить мій голос з середини мене, пробиваючись через тріщання моїх же кісток"
    "Він кричить: вбий усіх і перетвори їх на подібних собі."
    "Вбий усіх і перетвори їх на подібних собі.."
    "Вбий усіх.."
    scene end1
    pause
    if persistent.end1 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end1 = True
    return



# Рішення не вбивати зараженого сусіда, але викрадення ключів від його машини
label Not_kill_neighbor:
    $ vas = Character("Васильович", color="#009900")
    "Я вирішив спробувати втекти, але просто так не вийде"
    "Мені потрібно вичекати слушний момент та вибігти з квартири забарикадувавши її при цьому"
    "Але мені також потрібно взяти ключі від машини Васильовича"
    "Якщо вже його не врятувати, то треба хоча б собі допомогти"
    "Де ж вони? Де?"
    "..."
    "Ось! На шафці біля дверей!"
    "Так, тепер всю увагу на Васильовича, аби знайти цю мить для втечі"
    "Він стояв нерухомо, хоча з одного лише погляду на нього відчувалось, що він готується кинутись на мене"
    "Коли ж..."
    "Васильович закричав"
    vas "Гхрраааа!!!"
    "Схоже ось вона, та сама мить"
    "Я сіпнувся праворуч"
    "Васильович кинувся у той самий бік з дуже великою швидкістю"
    "Я якимось чудом встиг ухилитись та побіг зі спальні"
    scene vasyliovich_room with fade
    "Васильович також довго не чекав і кинувся мені у слід"
    "Я ледве встиг захопити ключі, та швидко змінив напрям до дверей"
    "Васильович зробив так само"
    "Він скорочував дистанцію дуже швидко"
    "Проте я встиг вибігти з його квартири, та прикрити двері"
    scene entrance with fade
    "Я став до них спиною, аби притримувати, поки не придумаю чим би їх замурувати"
    "Нічого підходящого поблизу не було"
    "Тож треба швидше думати, бо мутований Васильович вже намагається  пробити двері з того боку"
    "Ну ж бо.. Що я можу зробити?"
    "Що..?"
    "І тут мені впав в очі пакет зі сміттям"
    "Сусідка знизу завжди залишала його біля дверей, аби не забути викинути, проте вона завжди про нього забувала"
    "Ніколи не думав що буду радий побачити цей смердючий пакет"
    "Я пнув його ногою у напрямку виходу, а сам побіг нагору"
    "За якусь мить двері було вибито і гуманоїд довго не думаючи побіг на звук чогось падаючого"
    "Я був врятований"
    "Але це лише перша сутичка, якщо зараз все місто в цій нечисті, то мені треба буде з'ясувати, як я можу їх перемогти"
    "А найголовніше, мені треба з'ясувати як я можу більш безпечно покинути місто"
    "..."
    "Ну, їхати на евакуацію з військовими - це точно не варіант"
    "Адже, за умови, що люди перетворюються на гуманоїдів, йти до озброєних, добре натренованих людей – це самовіддача. Тому потрібен інший план"
    "..."
    "Найкращим варіантом, напевно, буде виїжджати самому, максимум вдвох, щоб було легше контролювати свій стан і, у разі чого, швидко втекти"
    "Добре, машина в мене вже є, отже залишилися лише провізія та точний план виїзду"
    "Тому мені все ж потрібно скласти план та зібрати провізії"
    "План можна скласти трохи пініше, а от без провізії я довго не протягну в будь якому випадку, тож треба буде знову виходити в місто"
    "Але зпершу треба зайти додому та взяти рюкзак аби було куди складати провізію"
    scene room with fade
    "Я піднявся до своєї квартири"
    "Вона виглядала так само, як і коли я йшов"
    "Це мене обрадувало"
    "Хоч щось в цьому світі не міняються"
    "Доречі про незмінне, потрібно набрати батькам"
    "Взявши телефон до рук я виявив, що зв'язку не має"
    "Трясця"
    "Сподіваюсь з ними все добре"
    "..."
    "Я підійшов до ліжка біля якого лежав рюкзак, та сів аби дістати з нього все що там було"
    "У цей момент я відчув надлюдську втому"
    "Такої я не відчував ніколи, навіть коли цілими днями займався спортом"
    olek "Так.." 
    olek "Блокнот.."
    olek "Пенал..."
    "Схоже я не користувався ним з тих пір як закінчив коледж..."
    olek "Далі..."
    olek "Зо-ши-ти..."
    "Я дуже втомився і повіки застелили очі, так я схоже не зможу встати зараз..."
    "Напевно краще напевно сходити за провізією ввечері..."
    "..."
    # Чорний екран
    window hide
    scene clock_four with fade
    pause(1.0)
    scene clock_six with fade
    pause(1.0)
    window show
    scene room with fade
    "Схоже я проспав весь день"
    "Отже час вже висуватись на розвідку та збір провізії"
    "Добре. Я готовий"
    scene entrance with fade
    "Почав я свою розвідку з того, що перевірив будинок на наявність інших людей чи гуманоїдів"
    "Нікого не виявлено"
    "З одного боку це чудово так навіть безпечніше"
    "А з іншого боку я залишився сам на сам з цим містом повним гуманоїдів та інших небезпек"
    "Ну нічого..."
    "Наступним кроком плану мав би бути вихід у магазин, але зараз мені в голову прийшла така думка, що непогано було б перенести пожежну драбину собі під вікно"
    "Так я і зробив"
    "Впринципі переніс драбини собі під вікно був не такою важкою процедурою, бо вона знаходилась під вікном у мого сусіда"
    "Можливо простіше було б переміститись у його квартиру, але якось своє, воно і рідніше, і якось більш захищено відчувається"
    "Тож з драбиною було покінчено, можна і в магазин сходити"
    scene park with fade
    "Зайти у великий магазин було б добре з боку різноманіття та якості провізії, але з боку безпеки це було б максимально безглуздо"
    "Тому мені треба знайти якийсь кіоск, максимально віддалений від можливих скупчень людей"
    "В принципі найближчим таким кіоском був той що знаходився біля парку"
    "Надиво на вулицях досить тихо"
    scene shop with fade
    "По дорозі до кіоску я незустрів нікого, ні гуманоїдів, ні людей"
    "Проте пересуватись я вирішив маленькими перебіжками, аби і самому не потрапитись нікому на очі"
    "Дійшов я до кіоска досить спокійно"
    "На моє здивування він був майже не зачеплений людьми і продуктів в ньому було повно, наскільки це було можливо для звичайного кіоска"
    "За декілька хвилин я вже заповнив рюкзак різними видами харчів. Від різноманітних консерв до локшини швидкого приготування і різного виду енергетичних батончиків"
    "Отже тепер, коли з провізією завершено, потрібно зайнятись розвідкою. Тому додому я піду так само маленькими перебіжками, але іншим маршрутом"
    "Через прилеглі до парку території, фактично я просто обійду район з іншого боку"
    scene scene_not_ready with fade
    "Я біг та ховався за будь який виступ, за яким я би міг заховатись"
    "Всю дорогу мене не полишало відчуття тривоги, та якогось не розуміння, бо ні людей, ні гуманоїдів я так і не зустрів"
    "Це видавалось мені диввним, бо скоріш за все люди ставали гуманоїдами через той зелений газ, що розходився від метеорита"
    "Газ вже заполонив, не певен що все місто, але весь район точно"
    "Він стоїть наче туман, отже люди які живуть на верхніх поверхах, якщо вони звісно не вжили якихось заходів, що є мало ймовірним через те що приліт відбувся о четвертій і ніхто цього впринципі не чекав, також стали гуманоїдами"
    "Виходячи з цього назріває логічне питання: де всі?"
    "Не те щоб я дуже хотів знову зустрітись із гуманоїдом, але якось насторожувало успідомлення що вони десь є, а я їх не бачу"
    "Аж раптом із-за кута дому за який я сховався вийшов гуманоїд"
    "Тьфу блін... Накркав!"
    "Він був більший за тих двох яких я зустрічав до цього"
    "Йшов він дуже повільно, так ніби знав що він тут головний"
    "Я швидко відбіг за найближче укриття, яке було позаду сподіваючись, що цей амбал мене не помітив"
    "А він схоже і не помітив, наче був сконцентрований на чомусь іншому"
    "Він просто йшов вперед, до центру парка"
    "Всупереч здоровому глузду я вирішив, що маю прослідкувати за ним та спробувати зрозуміти"
    "Такими ж маленькими перебіжками як і раніше я почав слідувати за ним"
    "Це переслідування завело мене у центр парку"
    "Навколо найвищої, центральної статуї зюрмилась велечезна куча гуманоїдів" 
    "Всі вони були не схожі один на одного, але вони всі переслідували одну ціль - забратись на центральну статую"
    "Вона була найвща у парку, тож не дивно що чоловік намагався залізти саме на неї"
    "Він намагався дертися все вище та вище, але постійно зісковзував"
    "Я заховався за найдальшою статуєю та почав спостерігати"
    "Чоловік був не надто молодий, проте й не старий, як би сказав якийсь старомодний персонаж фільму: \"У самому розквіті сил\""
    "Врешті решт він таки заліз на найвищий виступ статуї та гордо закричав"
    chel "Ага, з'їли?! Я тепер на вершині і ви сюди не залізете"
    chel"Мені лише треба протриматись тут тиждень та військові з \"Рятувального ковчега\" врятують мене!"
    "Гуманоїди наче нічого непочувши продовжували юрмитись навколо статуї"
    "Деякі з них намагались залізти на неї, але схоже інтелект у гуманоїдів був доволі слабкий, і вони падали вже на другому виступі"
    "Проспостерігавши за цим я дійшов до висновку, що чоловік на статуї тиждень там точно не протримається і я вирішив, що маю спробувати йому допомогти"
    "Я відбіг на декілька метрів у сторону виходу з парку та крикнув"
    olek "Агов! Сюди недолюди!"
    "Але схоже це не сильно допомогло чоловікові, бо саме в це момент ззаду його хапнув за ногу гуманоїд та потягнув його вниз"
    "Більшість гуманоїдів накинулись на легку здобич у виді впавшого чоловіка, але деякі таки зреагували на мене"
    "Я намагався бігти настільки ж швидко, як і від Васильовича, але з, 15 кілограмами на спині, принаймні так здавалось, робити це було дуже тяжко"
    "Я щей вирішив моневрувати аби заплутати гуманоїдів, але нічого не допомагало"
    "Я праворуч, вони за мною"
    "Я ліворуч, вони за мною"
    "Врешті реш я побачив свій дім"
    "Збиратись по драбині погане рішення, просто бігти в підїзд теж не найкраще, вони ж просто виб'ють двері і все, тож що робити..?"
    "Думай... Думай..."
    "Ідея!"
    "Я швидко дременув у вузенький провулок праворуч"
    "Великій кількості гуманоїдів яквно не вистачить місця у ньому, тож це їх трохи зповільнить"
    "Тепер треба зробити гак навколо дому, аби сплутати сліди, поки вони будуть проходити той провулок"
    "Все... врятований..."
    "Провізія зібрана, лишився лише план"
    scene room with fade
    "Я піднявся у свою квартиру, забарекадував двері та кинув рюкзак на ліжко після чого сів за робочий стіл"
    "Мені треба розробити план дій та виїзду з міста, проте для початку треба з'ясувати щось про \"Рятувальний ковчег\""
    "Я щось про нього чув раніше, але ніколи особливо не вдався в подробиці, тож саме час дізнатись більше"
    "..."
    olek "Ага, ось же!"
    olek "\“Рятувальний ковчег\” — це державна ініціатива, на випадок якоїсь катастрофи, в результаті якого треба буде евакуювати велику кількість людей. Вона складається з 5 — 15 надвмістких гвинтокрилів, в залежності від 	величини міста, на які будуть поміщені всі цивільні громадяни, та гості міста"
    "Отже мені теба саме туди, але де він має бути? Чоловік на статуї казав що він прилетить за тиждень, але куди..?"
    olek "Ось воно, зрозумів!"
    "\"Рятувальний ковчег\" має прибути у населений пункт на заході країни, схоже цей газ поширився не лише у нас, а щей далеко на схід, можливо його рознесли заражені, а може й вітер"
    "В будь-якому випадку мені треба буде їхати..."
    "Але як?"
    "Я розрукував карту на папері та почав креслити оптимальний шлях виїзду з міста..."
    window hide
    scene day_2 with fade
    pause(1.5)
    scene room with fade
    window show
    "За роздумами пройшла ціла ніч і вирішив, що мій маршрут має бути таким: попеше запрвка, подруге зброярня, та виїзд з міста після перегрупування"
    "Так напевно це найоптимальніший план"
    "Як тільки я встиг подумати це у мої двері почали ломитись гуманоїди"
    "Я швидко схопив рюкзак, заховав катру з маршрутом та відкрив вікно"
    "Мене вже чекала заздалегіть підготовленна пожежна драбина"
    "Я почав спускатись по ній, ключі від машини брязкали у кишені, а двері ... під натиском зграї гуманоїдів"
    "Не сказати, що я чекав, що доведеться покидати рідну квартиру так рано, але я був майже на сто відсотків впевнений у тому, що в будь якому випадку доведеться це зробити"
    "Я, можна сказати, злетів по тій драбині і побіг в сторону імпровізованої парковки у дворі"
    scene garage with fade
    "Машина Васильовича була досить стара, але він за нею добре доглядав, тож автомобіль був у досить хорошому стані"
    "Я відкрив машину та зі швидкістю блискавки вмостився на водійське місце"
    "Машина завелась просто миттєво, а я не зміг так же миттєво почати їхати"
    "Все ж відсутність практики протягом двох років давала про себе знати, але я мав почати їхати, якщо хотів жити"
    "Стартувати вдалося лише з пробуксовкою, проте все ж вдалось"
    "Я покинув свій двір у напрямку околиць"
    scene city_road_0 with fade
    "Першим місцем за планом була заправка, тож туди я й прямував"
    "Їхав я ненадто впевнено, в знаки давались роки без практики, проте навіть так я помітив, як змінилося місто буквально за день після падіння метеориту"
    "Воно було фактично мертве, ніби задихнулось тим зеленим газом"
    "Людей на вулицях ніби ніколи й не було"
    "Всі машини покинуті, а вікна будинків розбиті"
    "Колись тут вирувало життя, а зараз лише спогади окрашують ці бетонні коробки та дороги між ними"
    "Можливо, якби я їхав довше вглядаючись у ці спустошені вулички я би міг збожеволіти, але на щастя я вже підїзжав до заправки"
    "На моє здивування тут нікого не має"
    "Хоча бензину схоже теж не багато"
    "Так-сяк я набрав майже повний бак та рушив до другої точки в плані - зброярні"
    "По дорозі я бачив пару маленьких груп гуманоїдів, проте я думаю вони мене не помітили"
    "Я підїхав до зброярні"
    scene city_road_1 with fade
    "Її вікна були розбиті, а зброя що залишилась булу розкудана ніби до мене тут вже хтось був, але ось хто це був - не ясно"
    "Чи то люди, чи то гуманоїди, втім зараз їх тут немає, то й добре"
    "Чесно кажучи у зброї я не розбираюсь, тому не знаю що й вибрати, хоча досвід в 1000 наіграних годин у різноманітні шутери мені мали б, напевно, допомогти, проте вони мене тільки заплутували"
    "Все ж таки я знайшов якийсь пістолет, який більш-менш викликав довіру, та патрони, які були так-сяк схожі на ті що були в його магазині"
    "Тепер вже час виходити, їхати не перегруповку в новий сховок та на виїзд з міста"
    "Тільки я почав відходити від прилавка, як із-за кута будинку вийшла маленька зграя гуманоїдів"
    "Я одразу ж сховався за вітрину в надії, що вони не зайдуть сюди"
    "..."
    "Почувся звук розбившогося скла"
    "Невже вони все ж йдуть сюди?!"
    "Я зняв пістолет з запобіжника та приготувався стріляти"
    "Кроки чомусь стали більш тихими"
    "Вони знають, що я тут і вирішили підкрадатись?!"
    "Я вирішив, що просто чекати на свою смерть я не збираюсь, тож висунувся трохи із-за вітрини та побачив, як гуманоїди заходять в магазин навпроти"
    "Тож я полегшено зітхнувши почав підкрадатись до свого автомобіля так, щоб мене не помітили"
    "Аж раптом з магазину навпроти прозвучав гучний крик"
    $ mil = Character("???", color="#FFFFFF")
    mil "Забирайтесь від мене бісові діти!!!"
    # Міла в магазині навпроти
    scene black with fade
    "Я озернувся та побачив у тому магазині дівчину, яка вперлась в прилавок спиною, а зпереду до неї вже йшло троє гуманоїдів"
    "Що ж робити..."
    $ time = 7
    $ timer_range = 7
    $ timer_jump = 'Not_help_girl'
    show screen countdown
    menu:
        "Врятувати дівчину":
            hide screen countdown
            jump Help_girl
        "Не рятувати дівчину":
            hide screen countdown
            jump Not_help_girl
    return
# Рішення врятувати дівчну
label Help_girl:
    "Я маю врятувати її..."
    "Але це не розумно, я не вмію користуватись зброєю"
    "Цим я просто наражаю себе на небезпеку"
    "Я їй вже ніяк не допоможу"
    "..."
    "Та! До біса!"
    "Моє тіло саме кинулось на порятунок дівчині"
    "Я навіть не знаю, як я можу її врятувати, але відступати вже було пізно"
    "Я забіг в магазин та став перед нею"
    "Гумнаоїди вже збирались кинутись на мене, тож у мене не було часу прицілитись"
    "Тож не чекаючи того щоб вони кинулись я почав стріляти"
    "..."
    "Я вистріляв майже весь магазин, але задів лише одного гуманоїда, і то в ногу"
    "Вони вже були на достатній відстані аби накинутись на нас"
    "Я закрив очі та стрільнув"
    "Остання куля розірвала пакет борошна після чого вона підлетіла у повітря"
    "Помітивши це дівчина схопила мене за руку та витягла з того магазину"
    "Гуманоїди втратили нас з поля зору протираючи очі від борошна, а ми заховались за рогом"
    "Я намагався перезарядити пістолет, але через те що руки трусились я ніяк не міг попасти обоймою в магазин"
    mil "Та дай сюди!"
    "Дівчина, яку я врятував вихватила пістолет у мене з рук та зарядила його"
    mil "Не вмієш стріляти - не берись!"
    olek "Якби я не взявся ти би вже була їх вечерею! І взагалі, якщо ти такий експерт у зброї, чого не взяла собі якусь через дорогу"
    mil "..."
    olek "Ага, мовчиш? Не додумалась?!"
    "Вона трохи покрасніла"
    mil "Я прорахувалась та думала, шо я ще встигну"
    olek "Ото ж бо і воно..."
    "В цей момент із-за кута гуманоїди вийшли з магазину, схоже вони вже відновились від борошнової завіси"
    mil "Ти ж сюди на машині приїхав?"
    olek "Ну так..."
    mil "Тоді давай так: я постріляю їм по ногам, а ти швиденько заведеш машину та ми вшиемось звідси"
    olek "Добре..."
    "Я був не надто впевнений у її плані, проте іншого не було, та й вона якось сама вижила цілий день у цьому мертвому місті"
    mil "На рухунок три..."
    mil "Раз..."
    mil "Три!"
    olek "Шо?!"
    "Вона вилетіла з-за укриття та почача стріляти, ну а мені тільки і залишилось, що бігти до автомобіля"
    "Стрялала вона, схоже, дійсно добре та, незважаючи на її тендітний вигляд, вона була дуже сильна фізично, мені б не завадив хтось такий для виживання"
    "Проте от спостерігаючи за нею, було відчуття, що вона не зповна розуму"
    "Я швидко заскочив за кермо та намагався провернути ключ тремтячими руками"
    "На той момент гуманоїди вже були на підлозі та повзли у нашому напрямку"
    "Машина гучно ревіла, проте не заводилась"
    "Дівчина застрибнула на сусіднє місце"
    mil "Та давай уже!"
    "Зі злості я дуже сильно навалився на ключ і машина нарешті завелась"
    "Ми рушили"
    "Я зітхнув з полегшенням, загроза, схоже, вже була позаду"
    "..."
    "Але не тут то було, один з гуманоїдів стрибнув на кришу автомобіля, лише на одних руках він підтягувався до лобового скла"
    mil "Прибери його!"
    olek "Та намагаюсь я.."
    "Я крутнув кермо спочатку вліво, щоб задати сили, а потім праворуч гуманоїд все ніяк не хотів злітати з автомобіля"
    "Схоже він намагався пробити кришу своїми кістяними наростами на животі"
    "Я різко натиснув на гальма та гуманоїд нарешті злетів з машини"
    "Тепер треба дати газу в підлогу і..."
    "Під машиною почувся хруст"
    "Поглянувши у дзеркало заднього виду я побачив, що гуманоїд лежав знерухомлений, його грудна кліти на була роздушена, а над ним з'явилась хмара зеленого газу"
    "..."
    "Ми їхали в суцільній тиші декілька хвилин та перевіривши, що погоні немає я зупинився"
    mil "Дякую, далі я сама"
    olek "Ага, звісно. Ти думаєш я ризикував своїм життям аби врятувати тебе, щоб тебе потім просто з'їли"
    mil "Це не твоя справа.."
    olek "А от я так не думаю"
    olek "Ти ж на \"Рятувальний ковчег\" їдеш?"
    mil "Куди?"
    olek "Ну ковчег на якому збирають людей при якійсь катастрофі, як ця.."
    mil "Ніколи про таке не чула"
    olek "Так я тобі кажу, він має прибути у населений пункт на заході. Я якраз завтра збираюсь їхати туди"
    mil "А мені то що з того?"
    olek "Ну може поїдемо разом?"
    mil "З якого б це дива я мала б їхати кудись з тобою"
    mil "Я тебе взагалі вперше бачу, може ти якийсь шахрай, або навіть ґвалтівник..."
    "Та ти сама кого завгодно зґвалтуєш..."
    olek "Я розумію, що ми зустрілись нещодавно і ти не маєш довіряти мені, але для виживання нам треба об'єднатись у групу"
    mil "З чого б це?"
    olek "Ну мені потрібенхтось хтось сильний, а тобі я так зрозумів, що потрібен хтось розумний"
    mil "Чого?"
    olek "Простіше кажучи, якщо ми обєднаємось у групу у нас буде більше шансів вижити"
    mil "Ну якщо ставити питання так, я навіть не знаю.."
    olek "Ти можеш не вірити мені і я це розумію, до того ж просто словами я нічого не докажу чи не так?"
    mil "Абсолютно вірно, не докажеш..."
    olek "Тому я спробую довести тобі діями"
    mil "Як саме?"
    olek "Я вивезу тебе з цього міста"
    mil "Хоч одна дівчина повелась на це?"
    "Сказала вона з стервозною насмішкою"
    olek "..."
    mil "Добре, я згодна. Але пам'ятай, якщо ти зробиш хоч щось підозріле я вб'ю тебе твоїм же пістолетом"
    olek "Так, так..."
    olek "От і добре, а раз ми вже команда, тебе як звати?"
    mil "Міла. А тебе?"
    $ mil = Character("Міла", color="#FFFFFF")
    olek "Олексій"
    olek "От і познайомились"
    mil "..."
    olek "Ти ж в тому магазині їжу брала?"
    mil "Так, але вона там і залишилась коли ми тікали"
    olek "Ясно, тоді ми можемо подивитись чи вистачить моєї на нас обох"
    "Я відкрив свій рюкзак та показав все що вчора зібрав під час вилазки"
    mil "Ну впринципі... Можливо навіть вистачить, а скільки нам їхати?"
    olek "Їхати, за моїми підрахунками, 2 дня без урахуванням якихось форс-мажорів"
    mil "Ну на три дні на двох має вистачити"
    olek "Добре, тоді за провізією ідти не треба, отже за планом нам залишився прихисток на ніч"
    mil "А чому нам не виїхати зараз?"
    olek "Ну причин взагалі багато, але з основних: краща видимість, теоретично, меньша кількість гуманоїдів та збереження ресурсів таких як бензин, бо не треба витрачати їх на ліхтарі"
    mil "Зрозуміло, тоді, генію, де ти планував зупинитись на ніч"
    olek "Власне у домі за тобою"
    mil "У цьому роздовбаному сараї?"
    olek "Ну.. так"
    olek "Просто людей тут майже ніколи не було навіть до цього, тож і гуманоїдів не мало бути"
    olek "До того ж через те що, як ти висловилась, сарай роздовбаний, у нас буде більше оглядового простору, тож гуманоїди не зможуть проникнути сюди не поміченими"
    mil "Ну добре, тоді як будемо спати, почерзі?"
    olek "Так будемо тримати вахту почерзі"
    mil "Ну і хто ж буде першим?"
    olek "Ну давай кинемо монетку, чи що?"
    mil "Давай так..."
    "Я дістав монету з кишені"
    olek "Орел чи решка?"
    mil "Решка"
    olek "Добре, тоді..."
    "Я вже почав підкидати монетку, аж раптом..."
    mil "Стій! А покажи, що монетка має різні сторони"
    olek "Що?"
    mil "Показуй-показуй. Я вас знаю, зараз кине а на монетці два орла"
    "З повним не розумінням на обличчі я покрутив монетку перед Мілою"
    olek "Ось, бачиш? Звичайна монетка"
    mil "Ну добре... на цей раз я тобі повірю..."
    "Я підкинув монетку, вона зробила декілька обертів у повітрі та впала до моїх рук"
    "..."
    "Орел"
    "А отже я буду на вахті другим"
    mil "От чорт! Ти ж шахраював, чи не так?"
    olek "Ні, звідки такі висновки?"
    mil "Ну, може й не шахраював. Просто так здалось"
    olek "Ото вже..."
    "Після цього ми зайшли у дім, який мав стати нам схованкою на ніч"
    "Я розвів вогонь та дістав консерви"
    "Ми приступили до їжі"
    "Обидвоє ми були дуже голодні, тож особливо не спілкувались за вечерею"
    "Після їжі Міла дістала у себе з рюкзака якусь чи то скатертину чи то покривало та почала лягати"
    olek "Шановна! Ти програла взагалі то, зараз твоя черга нести вахту!"
    mil "Та ну тебе, я думала вийде все скинути на тебе"
    olek "Іди чергуй... Тим паче пістолет зараз у тебе"
    mil "Добре-добре..."
    "Місце яке готувала для сну Міла згодилось і мені"
    "Я заснув майже миттєво після того як ліг на бік під ту, імпровізовану, ковдру"
    window hide
    scene day_3 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#eef7ee")
    pause(1.5)
    scene bg bg with fade
    window show
    mil "Прокидйся, твоя черга"
    olek "Угу"
    mil "Давай-давай"
    "Я встав та прийняв вахту"
    mil "Ніч пройшла спокійно"
    olek "..."
    mil "Ну добре, тоді я спати, а ти не прозявай нікого"
    olek "Так... Звісно"
    olek "Надобраніч"
    mil "Надобраніч"
    "Міла заснула майже одразу після того як я лягла"
    "Я ж взагалі не виспавшись приступив до вахти"
    "Мені потрібно зайняти позицію для ідеального огляду території"
    "Дивлячись на будівлю я вирішив, що ідеальним місце буде горище, оскільки криша вся була в дірках, я міг побачити майже всі підходи до будівлі не сходячи з місця, а ті що я не міг побачити стоючи на місці я міг побачити через діру у дальній стіні, тож якщо щось буде наближатись до дому я це неодмінно помічю"
    "З місцем розібрався, отже час проаналізувати все що сталось за останні кілька днів..."
    "Коли на місто впав метеорит з нього почав витікат зелений газ, який, схоже перетворює людей на гуманоїдів"
    "Але не ясно я та Міла не стали такими через щось на кшталт імунітету, чи через те що ми використовували імпровізовані фільтри"
    "Далі, судячи з того що я побачив в пару гуманоїди мають деякий централізований розум, по іншому я не можу пояснити, як вони не передаючи жодних голосних сигналів могли зібратись в одному місці разом"
    "Проте якщо також взяти до уваги те що поки я їхав по місту на мене не кидались велитенські зграї цей розум може бути чимось типу телепатичного зв'язку з обмеженим полем дії"
    "Продовжимо безглузді теорії, так як людей перетворює у гуманоїдів саме газ, можливо їх вразливим місцем є легені?"
    "Це може підтверджувати те що після того як сьогодні ми переїхали одного з них на машині, цим самим роздавивши його грудну клітину, а отже і легені, він більше не рухався, а на його місці лишився лише зелений газ"
    "Хоча може це лише збіг"
    "..."
    "За роздумами як зазвичай пройшло чимало часу"
    "Міла вже встигла прокинутись"
    mil "Доброго ранку"
    olek "Доброго"
    mil "То що вирушаємо?"
    olek "Так, зараз будемо їхати"
    "Вчора повечеряли ми досить добре, тож їсти ще не хотілось"
    "Зібравши речі ми сіли в автівку та рушили у напрямку запланованого виїздаз міста"
    "Мене знову вітало мертве місто"
    "Воно ніби всім своїм видом наказувало забиратись"
    "Вулички які колись були мені рідними зараз були вкриті зеленим туманом крізь який, інколи, блимали очі мутувавших людей"
    "Ми їхали досить швидко враховуючи мої дуже скудні навички водіння"
    "Місце виїзду було дость не далеко тож ми доїхали туди буквально за десять хвилин"
    "Прибувши на місце було виявлено, що міст зруйновано"
    "Як і мої плани"
    "Так нам не дістатись до ковчега за два дні"
    "Ми просто не встигнемо дістатись до нього вчасно"
    "Тож треба повернутись, перегрупуватись та визначитись, як виживати у місті повному гуманоїдів"
    olek "Схоже нам треба поверта..."
    mil "Що це?"
    "Міла вказала на якийсь шмат паперу на стіні біля виїзду"
    mil "Схоже на карту, дивись!"
    "Я підійшов ближче, аби роздивитись"
    olek "Точно, карта"
    olek "Карта міста, якщо точніше"
    "На карті були перечеркнуті всі виїзди з міста окрім одного"
    "Він знаходився на іншому кінці міста"
    "Щоб дістатись до нього було необхідно перетинати найбільш заселені, колись, райони"
    "Я дістав свою карту та звірив це місце"
    "Схоже, якщо їхати через той виїзд нам знадобиться їхати три дні, тож якщо ми встигнемо, то вже в самий останній момент перед евакуацією"
    "В будь якому випадку спробувати треба"
    "Але якщо ми будемо їхати через другий виїзд, що буде довше ніж я розраховував, бензину може не вистачити"
    "В той же час заїзд на заправку також забере багато часу"
    "Тому треба швидше вирішувати що зараз важливіше час, чи бензин"
    "..."
    menu:
        "Дозаправитись":
            $ is_refuel = True
            jump To_refuel
        "Не дозаправитись":
            $ is_refuel = False
            jump Not_refuel
    return
# Рішення дозаправлятись
label To_refuel:
    "Все ж якщо ми не дозаправимось, навіть із запасом часу нам може не стати бензину щоб доїхати до ковчега, тому краще все ж дозаправитись"
    "Найближча заправка має бути за декілька кілометрів звідси тож туди нам і треба їхати"
    olek "Отже нам треба ще дозаправитись"
    mil "Добре, тоді можна буде ще з заправки забрати трохи їжі"
    olek "Точно, хороша ідея"
    "Тож ми знову сіли до авто"
    "До заправки ми доїхали через двори"
    "В одному з будинків я помітив маленьку зграйку гуманоїдів"
    "Один з них надто підозріло дивився у наш бік, але жодної активності він не видавав, тож я вирішив, що вони нас все ж не помітили"
    "На заправці було вдосталь бензину, тож я залишився заправитись та набрати трохи у каністру, а Міла пішла у середину, аби набрати там їжі"
    "Шланг, схоже, був пошкоджений, оскільки бензин подавав він повільно, та щей деяка частина капала на землю, незрозуміло звідки"
    "Міла закричала"
    mil "Ого! Ти дивись, тут нічого не чіпали, їжі нам ще й на третього вистачить"
    olek "Не набирай зайвого! Ми ж не будемо це викидати перед входом на ковчег"
    mil "Та добре-добре"
    olek "Ото вже.."
    "Пробурмотав я собі під ніс"
    "Бензин крапав дуже повільно, проте я вже встиг набрати повний бак та десь на одну четверту каністри"
    "Десь за будинком почувся якийсь гуркіт"
    "..."
    "Згарайка гуманоїдів вийшла з двору, яким ми їхали сюди"
    "Схоже їх увагу привернули наші крики"
    "Я швидко сховався за колонку"
    "Скоріш за все гуманоїди мене не помітили"
    "Тепер мені залишається лише сподіватись, що так буде і на далі"
    "Вони зайняли всю вулицю та йшли роздивляючись навколо"
    "Напевно вони таки шукають нас"
    "Як тільки Міла набере їжі нам треба буде швидко вшиватися звідси"
    "Але для цього нам потрібно буде трохи час, тож треба дати їм пройти трохи далі"
    mil "Ось і все... їжі набрала, можна їхати"
    "Дідько!"
    "Група з трьох гуманоїдів, яка вже встигла трохи пройти вперед миттєво озирнулись та кинулись на нас, отже саме час перевірити ранкову теорію"
    olek "Цілься їм в легені!"
    "Прокричав я, після чого швидко відламав шматок поржавілого заліза від заборчику біля заправки"
    "Цей шматок заліза став для мене чимось на зразок меча, хоча він і був тупим"
    "Двоє гуманоїдів кинулись на Мілу, а останній на мене"
    "Я не встиг навіть подумати, як гуманоїд вже був за крок від мене"
    "Трясця!"
    "І що ж мені робити?"
    "Гуманоїд швидким ривком звалив мене на землю"
    "Він кричав мені в обличчя та видихав у нього зелений газ"
    "Я не можу померти тут!"
    "Думай-думай..."
    "Точно! Я підставлю той шмат заліза йому до грудей, а те що він намагається з'їсти мене, зіграє мені на руку та він сам пробє свої легені"
    "Тільки треба знайти слушний момент, аби він хоч трохи припіднявся"
    gumanoid "Гарррр!"
    "Ось і він"
    "Я підставив імпровізваний меч до його грудей"
    "Шмат заліза був занадто тупим аби пробити шкіру гуманоїда, але може мені все ж повезе?"
    "..."
    "Міла наступила на нього зверху і залізо все ж ковзнуло між ребер ворога"
    "Нарешті!"
    "Зелений газ з пробитих легеней нападників почав розходитись по периметру"
    "Схоже Міла добре та швидко впоралась із задачає"
    "Вже за звичкою ми сіли в машину та рушили"
    olek "Дякую за допомогу"
    mil "Та будь ласка"
    mil "..."
    mil "До речі, чому ти сказав стріляти їм у легені? Як ти знав, що саме це їх уб'є?"
    olek "Ну... я просто перевіряв теорію, яка у мене виникла під час ранкової вахти"
    mil "І в чому ж теорія?"
    olek "Коротко кажучи, гуманоїди - це люди які мутували через вплив газу, так?"
    mil "Наче так.."
    olek "Отже, якщо вони стають такими черз газ, який потрапляє в легені, вони напевно мають померти, якщо, так би мовити, спустити газ із їх легеней"
    mil "Он воно як.."
    olek "Ці здогадки народились через епізод коли ми тікали від гуманоїдів вчора, ми ж роздавили одного з них на машині, його грудна клітина була роздушена, а він був мертвий, тож якось так.."
    mil "Ясно.. Я б до цього не додумалась, молодець"
    olek "Дякую"
    "Стоп, це вона що вперше мене похвалила?"
    "Втім не важливо..."
    "До виїзду з міста ще приблизно година, от би там все було тихо, бо ще одна сутичка за день буде вже перебором для мене"
    window hide
    scene bg clock_11 with fade
    pause(1.0)
    scene bg clock_12 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Більша частина міста вже позаду, нам лишився останній рубіж"
    "Найважчий рубіж"
    "Потрібно проїхати колись найбільш заселений район міста"
    "Він точно заповнений гуманоїдами, як в будівлях так і на вулицях"
    "Тож їхати треба обережно, не привертаючи зайвої уваги"
    "Не видаючи жодних звуків"
    "Щоб зменшити шуми від машини я заглушив двигун, перед цим набравши швидкість якої б мало вистачити, щоб виїхати з цього району за інерцією"
    "Колеса ледве крутяться та машина все ж рухалась до виїзду"
    "Ось уже і видно табличку з перекресленою назвою міста"
    "Залишилось ще трохи і ми з Мілою будемо у відносній безпеці"
    "Давай..."
    "Ще трохи..."
    "..."
    "По машині щось вдарило ззаду"
    "У дзеркалі заднього виду не було нічого"
    olek "Це напевно якась гілка"
    "Пошепки сказав я, не так для Міли, як для того щоб заспокоїти себе"
    mil "Угу"
    "..."
    # Гучний звук
    "Ззаду машини стояв гуманоїд, який нахабно тримав задні двері у руках"
    gumanoid "Гарррр!"
    "Гуманоїд прокричав так ніби кличе інших долучитись до розбору нашого авто"
    "І схоже його родичі не були проти"
    "З усіх будівель р'ясним дощем почали випадати гуманоїди"
    "Всі вони явно націлились на нас і вже мчали навипередки, аби поласувати нами"
    olek "Що за чортівня?!"
    "Треба швидко заводитись!"
    "Ключ знову, як на зло заклинило"
    "Нужбо... Нужбо..."
    "Двигун нарешті заревів"
    mil "Що? Що ж робити?"
    "Тепер думай, що далі"
    "Думай..."
    "Точно!"
    olek "Стріляй в каністру!"
    mil "Що?"
    olek "Стріляй в каністру, кажу!"
    "Вона стояла як раз навпроти дверей які вирвав гуманоїд"
    "Я швидко перерізав мотузку, якою перемотував бензобак, аби його не трясло по дорозі"
    "Каністра стрімко вилетіла з машини та впала перед натовпом монстрів, розплескавши деяку частину бензину по землі"
    olek "Зараз!"
    "Міла випустила кілька куль у каністру і бензин в середині неї миттєво спалахнув, утворивши деякий бар'єр з вогню"
    "Деякі гуманоїди намагались пройти через вогонь, проте підпаливши свої кінцівки вони зупинились"
    "Схоже вони зрозуміли, що вже не зможуть нас наздогнати, тож кинули нам в слід лише крик"
    "Крик, який звучав навіть не позвірячому, скоріше за все так звучали ті монстри під ліжком з дитинства, а їх силуєти підсилені вогнем лише підкріпляло це відчуття"
    "..."
    olek "Фухх..."
    olek "Вийшло..."
    mil "..."
    olek "Вітаю, ми за містом"
    window hide
    scene day_4 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#d2ead1")
    pause(1.5)
    scene bg bg with fade
    window show
    "Для мене ніч була довга, я весь час мав бути сконцентрований на дорозі і на педалях"
    "Оскільки я давно не седів за кермом, а тим паче ніколи довго не їздив, це було для мене дуже тяжко"
    "А от Міла заснула майже одразу після того як зайшло сонце, тож їхав я в суцільній тищі, лише десь вдалені було чутно цвіркунів, які ще не зрозуміли, що настала осінь"
    "Так же швидко, як і заснула, Міла прокинулась з першими промінцями сонця і почала вимагати їжу"
    mil "Ну зупинись, давай поїмо"
    "Повторювала вона, лише змінюючи інтонацію"
    olek "Та, почекай! Я то в принципі і не проти поснідати, але як бачиш тут нема де з'їхати, ми не можемо зупинитись посеред дороги, це ж трасса"
    mil "Яка кому різниця? Ти часом не забув, що у нас тут майже зомбіапокаліпсис, забий на ті правила і давай зупиняйся"
    olek "Ні! Ми маємо дотримуватись правил, бо якщо не будемо робити цього, що нас буде відрізняти від гуманоїдів?"
    mil "Ой, бач, який правильний.."
    "Сказавши це вона надула щоки та втупилась у вікно"
    "..."
    mil "Пригальмуй"
    olek "Я ж вже казав, що ми не будемо тут зупинятись"
    mil "Та я не через їжу, дивись"
    "Вона показувала пальцем у вікно"
    "Придивившись я помітив, як за парканом, що розмежовував дорогу, гуманоїди зібрались в коло та спостерігали за тим як один з них крутився і кричав"
    "Деякі з них виглядали, як сім'ї, вони тримались як омога ближче один до одного, але якщо до них намагався підійти хтось зайвий, вони швидко з'їдали його"
    "Уся ця сцена нагадувала, якесь первинне суспільство"
    "Воно мене заворижило своєю незвичністю, і в той же час лякало подібністю на людей"
    "Захопившись спостереженням я пригальмував і колодки видали пронизливий скрип"
    "В мить гуманоїди розвернулись на нас, декілька секунд уважно роздивлялись, а потім повернулись назад і продовжили це дійство"
    "Щоб не давати їм зайвих приводів на атаку, я притис педаль і ми рушили швидше"
    mil "І що це тільки що було?"
    olek "Схоже це їх спосіб співіснування, таке собі суспільство мутантів"
    mil "Це ж фактично зомбі, хіба вони не мають бути тупими?"
    olek "А хто тобі сказав, що зомбі обов'язково тупі?"
    olek "Тим паче, що ці істоти явно розумніші ніж зомбі з фільмів"
    olek "Можливо вони не такі розумні, як люди, проте все ж не тупіші за мавп"
    mil "А мені вони більше на алкоголіків схожі"
    olek "Ну може і так.." 
    "Після цього обговорення ми їхали в тиші"
    "Заїхавши на пагорб ми побачили місто з якого тікали"
    "Там був з'їзд з дороги, тож ми зупинились, аби нарешті поснідати"
    "Діставши з рякзака якісь булочки я підняв очі на каєвид Києва, який відкривався з цього пагорба"
    "Київ був, як на долоні"
    "Колись найприємніше для мене місто було завішане зеленим туманом, який робив із, і так не завжди приємних людей гуманоїдів, котрі намагаються мене з'їсти"
    "Але все ж який Київ гарний, звідси його видно майже повністю, від районів у яких протікала моя спокійна юність до Майдану та ..."
    olek "Сподіваюсь, що колись зможу повернутись до тебе"
    "Прошепотів я"
    mil "Ти щось сказав?"
    olek "Та ні не звертай уваги, просто цей вид навіює спогади"
    mil "А ти виріс у Києві?"
    olek "Ну так, а ти хіба ні?"
    mil "Та ні, я приїхала з Донечини на навчання, а потім якось тут і залишилась"
    olek "Он воно як.."
    olek "То ти виходить панаєхало?"
    "З усмішкою сказав я"
    mil "Ага, щось типу того.."
    "Холодно відповіла Міла"
    "Ми вже поїли, тож аби не витрачати час знову сіли в машину та рушили"
    olek "Слухай, а твої родичі там зараз?"
    mil "Напевно, я чесно кажучи давно з ними не бачилась, тільки по телефону і говоримо, а зараз, як знаєш зв'язку нема"
    olek "..."
    olek "А коли ситуація з цим усім стане легше, плануєш повертатись?"
    mil "Куди?"
    olek "Ну додому, на Донеччину"
    mil "Не знаю, та й чи є у цьому сенс?"
    mil "Все ж, якщо евакуація оголошена саме на захід, то на сході напевно теж все не та райдужно"
    olek "Про що ти?"
    mil "Ну там же теж напевно гуманоїди є.."
    olek "І що?"
    mil "А те що я не хочу бачити, що мої найдорожчі люди стали такими, тому я напевно туди вже ніколи не поїду, поки точно не буду знати, що вони не мутанти"
    olek "Ясно.."
    mil "А твої родичі, де вони?"
    olek "Чесно кажучи не знаю, вони наче мали їхати на відпочинок зараз, але.."
    olek "..."
    olek "В будь якому випадку я планую знайти їх, коли ситуація з цим тумано хоч трохи стане легше"
    mil "Удачі.."
    olek "..."
    olek "Доречі, ти ж сказала, що приїхала на навчання і потім залишилась, а ким ти була до цього всього?"
    mil "Та так, фітнес інструкторм"
    olek "А на нього ще й вчать?"
    mil "Ні, я поступала на лікаря, як і казали батьки, але на другому курсі зрозуміла, що це не моє. Зрештою я влаштувалась у кав'ярню офіціанткою, а на останні гроші я записалась у фітнес центр де мене помітили та запропонували бути інструктором"
    mil "Останні пів року я, можна сказати, працювала на двох роботах"
    olek "Ого, я б так не зміг"
    mil "А ти десь працював?"
    olek "Ну якщо це можна назвати роботою.."
    olek "Я був охоронцем на заводі"
    olek "В принципі нічого там ніколи не відбувалось, тож я постійно просто дивився у вікно"
    mil "Ясно"
    "Після цієї маленької ромови в машині знову запанувала тиша"
    if is_kill_neighbor == True:
        olek "Кхе-кхе"
        mil "З тобою все нормально?"
        olek "Так-так, просто кашель"
        mil "Щось не схоже.."
        mil "Ще й зелений димок при відкашлюванні, ти часом не заражений?"
        olek "Та звісно ні, я весь час був у імпровізованому протигазі, або в масці"
        olek "..."
        olek "Хіба що при моїй першій сутичці міг надихатись"
        olek "Хоча, я думаю все нормально, то я вже себе накручую, не переймайся"
        mil "Ну дивись, якщо що знай, що тебе жаліти я не буду"
        olek "А то ти мене і так жалієш"
        "Пробурмотів я собі під ніс"
    # Годинник міняє час з 12 на 20:30
    window hide
    scene bg clock_12 with fade
    pause(1.0)
    scene bg clock_20_30 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Все ж таки, їхати двоє суток поспіль дуже вимотуюче заняття, напевно треба зробити маленький відпочинок"
    # Очі закриваються поступово за декілька кадрів
    "Але де?.."
    # Темний екран
    "..."
    # Гучний звук сповішення
    "Що це..?"
    "Озираючись навкруги я помітив маленький дрон у небі"
    define guch = Character("Гучномовець", color="#FFFFFF")
    guch "Увага! Увага!"
    guch "Координати \"Рятувального ковчега\" були змінені та пересунені на схід. Тепер ковчег буде чекати на всіх у місті Плоскирів"
    guch "Повторюю, координати \"Рятувального ковчега\" були змінені та пересунені на схід. Тепер ковчег буде чекати на всіх у місті Плоскирів"
    "Схоже Міла прокинулась"
    mil "Вибач, про що там було? Я не дуже розібрала за сном"
    olek "Сказали, що переносять місце знаходження ковчега"
    mil "І куди?"
    olek "У Плоскирів"
    mil "Оце добре! Наскільки я пам'ятаю тут близько"
    mil "Отже будемо на місці уже завтра вдень"
    olek "Ну так то воно так, але тобі не здається це дивним?"
    mil "Ні, а що саме?"
    olek "Те що вони переносять зазначене раніше місце збору на ковчег"
    olek "Це ж тобі не просто пересунути, якийсь ларьок на кілька метрів, це переніс велечезного гвинтокрила, який служить для евакуації людей, та повідомити про це лише через дрон з гучномовцем"
    olek "Якось не викликає довіри.."
    mil "Та ну тебе, вони, напевно, змістили його, аби людям було легше дістатись до місця евакуації, до того ж зв'язку нема, як і радіо, тож де ти збирався почути про це?"
    olek "Може ти і права, але ж.."
    mil "Я відчуваю, що все буде добре, тож довірся мені, як я довірилась тобі"
    olek "..."
    olek "Добре..."
    window hide
    scene day_5 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#bedcbe")
    pause(1.5)
    scene ark_road with fade
    window show
    "Ніч пройшла спокійно"
    "Через те що я вже відключався за кермом я зрозумів, що мені точно потрібно відпочити, і як тільки випала така можливість я спрямував машину на лісову доріжку, аби нас було важче помітити"
    "Ми з Мілою домовились переночувати там змінюючись на вахті"
    "Я проспав приблизно 4 години, проте цього мені цілком вистачило, аби відновитись та бути бадьорим увесь день"
    "На данний момент ми їхали вже декілька годин і ось-ось мали вже прибути до нового місця \"ковчега\""
    "Його вже навіть видно на горизонті"
    "Хоча дивно якось, за чутками там мав бути просто неймовірно великий гелікоптер, який зміг би за один раз евакуювати, може не область, проте район, точно"
    "А цей якийссь малий..."
    "Якось це все підозріло..."
    "Хоча можливо він маленький тільки тому, що ми ще до нього не доїхали?"
    window hide
    scene bg clock_10 with fade
    pause(1.0)
    scene bg clock_12 with fade
    pause(1.0)
    window show
    scene ark_road with fade
    "Час пролетів досить швидко і ми майже підїхали до Плоскиріва"
    scene ark_outside with fade
    "На моє здивування там вже стояло чимало машин схоже багато людей таки змогли вижити у тому жахітті"
    "Гвинтокрил, який стояв на в'їзді в місто, був, хоч і не таким великим як про нього розповідали у мережі, проте достатнь виликим, аби врятувати всіх хто вже прибув туди"
    "Коли ми підїхали до місця де вже стояли інші автівки до нас вийшов чоловік років п'ятидесяти"
    show vladimir normal at center
    "Він був досить високий, у формі схожій на щось між воєнною та діловою, на ньому були окуляри та кашкет, а під носом у нього виднілися розкішні вуса, одним словом він був статний"
    $ vla = Character("???", color="#FFFFFF")
    vla "Драстє, вітаю вас на ковчєгє"
    vla "Я капітан цього судна Владімєр Соколов, а ким ви будете, новопрєбившиє?"
    $ vla = Character("Владімєр", color="#FFFFFF")
    olek "Я Олексій"
    mil "А я Міла"
    vla "О, ви у нас тут пєрва парочка, добре хоч буде кому страну розбудовувать, коли все закончиться"
    show vladimir smile at center
    vla "Хахаха!"
    mil "Ми взагалі то не парочка.."
    "Пробурмотіла під ніс Міла"
    vla "Пардоньтє, просто ви єдині кто тут вдвох приїхали, так всі по одинці, багато хто не вижив, самі понімаєте"
    vla "..."
    olek "А де ті що приїхали?"
    vla "А я вам как раз зараз все і покажу"
    vla "Пойдьомтє-пойдьомтє"
    "Ми з Мілою вийшли з машини та попрямували за капітаном ковчега"
    scene ark_corridor with fade
    "Не зважаючи на його дивний говір, він здавався досить позитивним та надійний, принаймні мені хотілося у це вірити"
    "Владімєр відвів нас в середину ковчега, там вже було чимало людей і нарешті побачивши їх мої сумніви, що до цього місця, як рукою зняло"
    vla "Ось тут у нас главний відсік, в ньом знаходяться усі кто прибув на ковчег та їх каюти"
    vla "Якщо пройти дальше, в глиб судна, можна буде побачити їдальню та командний пункт в якому какраз живе ваш покорий слуга"
    vla "Якщо вам буде щось інтєрєсно мої хлопці проведуть вам екскурсію"
    jump Menu_excursion
# Вибір екскурсій
label Menu_excursion:
    menu:
        "Залишитись у головному відсіку та поговорити з прибулими":
            olek "Я би хотів поговрити з тими хто прибув до нас"
            if is_talk == False:
                vla "Хорошо, ето вам сюди"
                vla "Тут знаходиться каюти прибувших, можеш там побазікати з кимось, може щось цікаве розкажуть"
                olek "Добре, так і зробимо"
                olek "Ти ж зі мною?"
                mil "Звісно"
                "Ми з Мілою рушили у напрямку кают"
                scene ark_corridor_peoples with fade
                "На сходах сиділо троє чоловіків, вони були дуже вимотані, їх очі були пустими, ніби вони дивляться крізь об'єкти прямо у вічність"
                olek "Вітаю, панове, я новенький тут, і хотів би дізнатись, як тут обстановка на кочезі, може ви мені розкажете?"
                noname "Ну, як тут обстановка, звичайна для таких місць, всі на нервах, всі пережили якесь жахіття, яке хочеться поскоріше забути"
                noname "..."
                noname "Єдине, що тут добре, так це те що добре годують, особливо м'ясо, воно тут особливо смачне.."
                olek "Вибачте, можливо це не тактовне запитання, але ви сказали, що всі тут пережили якесь жахіття, чи могли б ви поділитись, тим що сталося з вами?"
                "Очі повні пустоти піднялись на мене"
                noname "Я можу розповісти свою історію, але чи ти справді хочеш це слухати?"
                olek "Звісно, я хочу зіставити повну катрину, того що сталось"
                # Про  копіювання гуманоїдом
                noname "Тоді, добре"
                noname "Я почну з того, що початок цього апокаліпсису я зустрів не вдома, я був у сауні з друзями"
                noname "Ми сиділи, щось парились, реготали як зазвичай, і тут як бахне щось"
                noname "Ми вибігли на вулицю, аби подивитись що це було, але нічого не побачили, тож вирішили, що це, напевно, фура десь не подалік проїхала"
                noname "Тож ми знову зайшли в лазню, і сиділи там нічого не підозрюючи"
                noname "Коли ми вже збирались їхати по домівках, я помітив, що Вадим кудись подівся"
                noname "Я власне пішов його шукати, бо малолі що могло статися з людиною після лазні, це ж все серйозно"
                noname "Ходив я ходив, але все не міг знайти, аж раптом омітив якийсь дивний силуєт в лісі"
                noname "Я подумав, що це Вадим та вирішив підійти ближче"
                noname "З лісу тоді саме стелився якийсь зелений газ, але я не сильно звернув на це увагу"
                noname "Я гукнув його, але у відповідь нуль реакція"
                noname "Я підійшов ближче та гукнув його ще раз"
                noname "Тепер він нарешті обернувся, але виглядав він якось дивно"
                noname "Він стояв навпроти мене у порваних лахах та просто дивився на мене"
                noname "Коли я помітив, що його очі вже були з чорним белком, я подумав, що щось не так, але все ж не кидати ж друга ось так у лісі, ще й з якоюсь болячкою"
                noname "Я покликав його ще раз, і він почав кривлятись, імітуючи мої рухи ротом"
                noname "Це було дуже дивно, але я все ж не залишав надії, що йому просто стало погано"
                noname "Я гукнув його знову, на що він відповів агресивним стрибком у мій бік"
                noname "Він опинився на світу і тільки тоді я помітив, що це вже був точно не Вадим"
                noname "Тож я вирішив, що якщо не робитиму жодних різких рухів, можливо я зможу здобути собі фору"
                noname "Я намагався робити максимально повільні кроки назад"
                noname "І вгадай, що почав робити це падлюка.."
                noname "Він почав робити кроки назад намагаючись наслідувати мене"
                noname "Це мене дуже лякало, і я крикнув йому, щось тупу: \"А ну, закінчуй це, Вадиме!\""
                noname "На що він у відповідь почав ворушити губами, дуже дивно кривляючись, ніби він намагався наслідувати кожен мій рух"
                noname "Тоді, я зрозумів, що він намагається вчитись бути мною і я втік"
                noname "Він намагався мене наздогнати, проте хлопці які вже з півгодини чекали на наше повернення були готові стартувати, але ніхто не думав, що доведеться стартувати від Вадима"
                olek "Ясно, може й ви розкажете свою історію?"
                # Про пограбування
                noname "Та мені то особливо нема що й розказувати, єдиний висновок, який можна зробити з моєї історії, що люди залишаються людьми в будь яких умовах"
                olek "А може більш докладно поділетесь?"
                noname "Та було б чим.. Тут як у тому анекдоті, немає речей, нема й історії"
                olek "Всенсі?"
                noname "Та господи, що ти хочеш почути?"
                noname "Жив був я, коли все це сталось я з сім'єю намагався виїхати з міста, на північ звідси, а на виїзді нас зупинили грабіжники, забрали все, гроші, машину та й все цінне, що було з собою, блааго одяг лишили"
                noname "Довелося пішки йти сюди, добре що хоч ковчег перенесли поближче, і не довелось іти через пів країни"
                olek "..."
                olek "А ви пане, можете поділитись своєю історією?"
                # Про останнього вижившого
                noname "Ти точно хочеш послухати, тобі не вистачає свого болю?"
                "Я з впевненістю кивнив"
                noname "Тоді, слухай.."
                noname "Навіть не знаю з чого почати, напевно ж з початку.."
                noname "Я жив в Дніпровському районі, був звичайним роботягою, що пів життя працював на будівництві"
                noname "Як і всі знайомі я також дивились телевізор, та бачив новину про наближення метеориту"
                noname "Як і багато хто я не вірив у можливість падіння метеориту, та що він міг принести щось що переверне світ"
                noname "Ніби жартома ми з кологами всеж домовились, що якщо що збираємось усі разом та їдемо з міста калонною"
                noname "Коли це сталось ми всі зібрались та готувались виїзжати, лише один з нас запізнювався"
                noname "Ми вже збирались їхати йому на допомогу, але він всеж приїхав і якось дивно кашляв"
                noname "Він сказав, що мутант напав на нього, але він зміг його вбити"
                noname "Згодом, десь на другий день шляху, ми почули з дрона інформацію про перенесення ковчега та почали їхати сюди"
                noname "Так як їхати сюди було явно ближче, ми вирішили зупинитись на ночівлю"
                noname "Якби ж не це..."
                noname "..."
                "Чоловік явно знітився"
                olek "Що, що було далі?"
                noname "А далі я побачив, як ця мразота, натовпом накинулась на наш табір поки я ходив по хмиз для багаття"
                noname "Вони не залишили живими нікого"
                noname "Я вже був готовий померти разом із своєю сімєю, але тіло.."
                noname "Тіло мене не слухалось і я просто заціпенів від страху"
                noname "Розумієш.. Я просто стояв та дивився, як моїх найближчих лидей роздерають на шмаття..."
                olek "..."
                "..."
                vla "Олексію, йди но сюди!"
                olek "Дякую, що поділились, я це дуже ціню"
                olek "Бувайте"
                noname "Бувай, хлопче, бережи тебе господь"
                "..."
                scene ark_corridor with fade
                show vladimir normal at center
                vla "Ну, як поговорив?"
                olek "Та, як бачите... Вони пройшли через таке жахіття, я навіть боюся уявити як це можливо пережити"
                vla "Отож бо і воно."
                olek "..."
                $ is_talk = True
                jump Menu_excursion
            else: 
                vla "Тобі хіба не вистачило тих історі? Іди краще глянь щось інше..."
                jump Menu_excursion
        "Піти у їдальню":
            olek "Я хочу оглянути їдальню"
            if is_eat == False:
                vla "Хорошо, тогда знайомтесь це наш кок Григорій Смаколюбов, він проведе вам ексурсію до їдальні та покаже вам свою кухню"
                show kok normal at center
                olek "Приємно познайомитись"
                kok "Мені так само, солоденькі"
                kok "Тож, ходімо за мною, я вам все покажу"
                "Ми з коком рушили у напрямку носа ковчега, схоже їдальня була прямо по середині судна"
                scene ark_dining_room with fade
                show kok normal at center
                kok "Отже, ось і їдальня, місце де всі ситі і добрі"
                kok "Тут у нас все дуже простенько, проте мінімалізм нинче в моді, тож так напевно і краще"
                "Їдальня і дійсно була досить простою, в чомусь навіть схожа на шкільну"
                "Столики спаяні разом із лавочками, розставлені дуже близько один до одного, напевно між ними може пройти лише одна людина"
                kok "У нас, доречі, скоро обід, тож ви скоро і самі спробуєте все що тут побачите"
                mil "Це добре, а о котрій тут зазвичай обід?"
                kok "Взагалі то, в 14:00, якщо нічого не станеться"
                kok "Але то таке"
                kok "В їдальні особливо нема на що дивитись, тож запрошую до кухні, от там вже все найцікавіше"
                "Ми зайшли до невеликої кімнатки з боку від їдальні"
                scene ark_kitchen with fade
                show kok normal at center
                "Вона була дійсно облаштована досить добре, на противагу їдальні з около-радянською мебеллю, тут все знаряддя, пічки та таке інше було сучаним"
                kok "Саме тут і твориться магія!"
                "Розсміявся він"
                kok "Ось тут у нас щось на зразок складу" 
                "Він вказав на чималий холодильник, що знаходився у іншому краю кімнати"
                kok "Тут зберігаються всі продукти , їх має вистачити на 2-3 тижні, заежно від кількості прибулих на ковчег"
                kok "А ось тут зберігаються вся наша утварь та ножі"
                kok "Також зі мною ще працюють двоє помічників, але зараз вони пішли на вилазку разом з віськовими"
                olek "А нащо потрібні вилазки, якщо всі продукти вже і так на борту?"
                kok "Ну як, \"для чого?\", для того щоб добрати деякі ресурси, я ж казав, що харчів вистачить на 2-3 тижні, а якщо щось піде не так, на що люди будуть жити? Не жерти ж їм один одного..."
                olek "Он воно як.. А я думав, що вас вже всім забезпечили перед вильотом"
                kok "Ну ми теж так думали, але ж ти знаєш в якій країні ми живемо..."
                olek "..."
                kok "Ну добре, не будемо про погане, в принципі я тобі вже все показав, якщо є ще якісь питання то задавай"
                if is_talk == True:
                    olek "Ну не сказав би що це прямо питання, але я чув що у вас дуже смачне м'ясо"
                    kok "Та ні, моє м'ясо не смаче, смачно я його лише готую"
                    "Розсміявся кок"
                    olek "Хе-хе"
                    "Ніяково посміявся я"
                    kok "Доречі, якщо ти вже спитав про м'ясо, може ви хочете бути першими хто спробє сьогоднішній обід?"
                    mil "Звісно, а що у нас на обід?"
                    olek "А тобі аби поїсти"
                    "Тихо сказав я"
                    kok "Власне, це локшина з м'ясом"
                    "Кок поставив дві маленькі піалочки супу, він виглядав не надто апетитно, але аби не засмучувати кухаря, я всеж вирішив спробувати"
                    kok "Ну як?"
                    olek "Хоч на вигляд він здався мені занадто жирним, але на смак дуже смачно"
                    kok "Отож бо і воно, головне ж не те що ззовні, головне те що в середині, ти так не вважаєш?"
                    olek "Так, ви повністю праві"
                    kok "Можливо у тебе зараз з'явислись якісь питання?"
                    olek "Та ні, питань більше нема"
                    kok "Ну от і добре, тоді можемо повертатись, тільки про обід нікому ні слова, хочу щоб це був сюрприз"
                    olek "Добре, я збережу це в таємниці"
                    mil "А от я не можу такого обіцяти без добавки"
                    "З усмішкою сказала Міла"
                    kok "Ну якщо так, то ось тобі ще трохи"
                    mil "Дякую!"
                    "За кілька миттєвостей Міла доїла і добавку"
                    mil "Це було неймовірно смачно! З нетерпінням буду чекати на обід"
                    "Кок розсміявся"
                    kok "Тоді, до обіду!"
                    scene ark_dining_room with fade 
                    show kok normal at center
                    "Сказавши це кок відвів нас назад до головного відсіку"
                    scene ark_corridor with fade
                    show vladimir normal at center
                else:
                    olek "Так то, питань у мене немає"
                    kok "Ну от і добре, тоді можемо повертатись"
                    scene ark_dining_room with fade 
                    "Ми з коком  попрямували у зворотньому напрямку і вже за декілька секунд опинились у головному відсіку"
                    scene ark_corridor with fade
                    show vladimir normal at center
                $ is_eat = True
                jump Menu_excursion
            else: 
                vla "Так ти ж вже був в їдальні, не відволікай вже кока, іди, он, краще ще щось подивись..."
                jump Menu_excursion
        "Піти в командний центр":
            if is_command == False:
                vla "Вот, ми і дістались самого цікавого, мого робочєго мєста"
                vla "Пойдьомтє, зараз ви побачите св'ятиню всєх кто потрапляє на це судно"
                "Ми попрямували в глиб ковчега"
                "Командний пункт був в носі ковчега, тож нам потрібно було пройти каюти прибувших, їдальню, і аж тоді дістатись до командного пункту"
                "Хода капітана була дуже шидка, а кроки широкими, я ледве встигав за ним, але через цей високий темп ми дійшли до командного пункта досить швидко"
                vla "Такс, уважаємиє, ви готові побачити найголовніше, що є на цьому судні?"
                olek "Т-так звісно"
                vla "Тогда, пусті нас товаріщ!"
                "Охоронець швидко відійшов відкривши прохід"
                vla "Смотрітє, ось він, пункт на якому і проходить керування цим мєстом"
                scene ark_team_center with fade
                show vladimir normal at center
                "Навкруги було чимало апаратури, все мерехтіло та переливалось"
                vla "Ось кнопка, яка вмикає гучномовець, хочете штото сказати?"
                mil "Ні, дякую"
                vla "А ти, шкєт?"
                menu:
                    "Звісно хочу":
                        olek "Так звісно хочу"
                        vla "Оце настрой, я понімаю. {w} Давай, на щьот три.."
                        vla "Раз. {w}Два. {w}Три"
                        $ user_massage = renpy.input("Що ви хочете сказати прибувшим на ковчег?")
                        guch "[user_massage]"
                        show vladimir smile at center
                        mil "І щоб це мало значити?"
                        olek "Та так.. не звертайте уваги"
                    "Щось я не певен":
                        olek "Щось я не певен, що мені є що сказати.."
                        vla "Та нє дрєйфь"
                        vla "В будь якому разі, коли тобі ще така можливість випадьот?"
                        olek "Ну я навіть не знаю"
                        olek "..."
                        olek "Хоча, знаєте, я дещо придумав, давайте я спробую"
                        vla "Тоді я тисну ти кажеш.. на рахунок три"
                        vla "Раз... {w}Три!"
                        "Капітан явно намагався застати мене в зненацька, і у нього це вийшло, але із деякою затримкою я все ж сказав, що придумав"
                        init python:
                            import os
                            user_name = os.environ.get("USERNAME")
                        guch "Нехай живе [user_name]!"
                        show vladimir smile at center
                        vla "Ахахахаха! Ото ти даєш, шкєт, я то думал ти зараз щось серйозне ляпнеш, а ти, ахаха!"
                        vla "До речі, а хто це твій [user_name]?"
                        olek "Та так, один знайомий любитель почитати всяке, не звертайте уваги"
                    "Не хочу":
                        olek "НІ, дякую, я щось не хочу"
                        vla "Ну, как занєш, мойо дело предложить, как говорітся"
                show vladimir normal at center
                vla "Добре, тоді продовжимо"
                vla "На всякий случай у нас тут є аварійний вихід, в принципі вони розкидані по всьому кочєгу, але зараз вони забарикадовані, шоб гуманоїди не могли через них залізти"
                vla "Також у нас тут є багато разнообразних систем контроля, як і на всіх інших апаратах такого плану"
                vla "В принципі показувати тут ще багато, але без знань в області літаків та гвинтокрилів всі пояснення будуть майже пустим звуком, так шо пропоную завершувати нашу екскурсію"
                vla "Чи є у тебе якісь питання по тому що я тобі показав?"
                olek "Та ні"
                mil "Нема"
                vla "Тоді вертаймось до головного відсіку"
                scene ark_corridor with fade
                show vladimir normal at center
                "Ми з капітаном так само швидко напрвився до головного відсіку"
                $ is_command = True
                jump Menu_excursion
            else: 
                vla "Ти ж вже бачив наш командний центр, я думаю на сьогодні тобі хватіт тайн, іди краще ще щось подивись"
                jump Menu_excursion
        "Піти відпочити" if is_talk == True and is_eat == True and is_command == True:
            olek "Дякую за все, проте тепер я б краще відпочив"
            olek "Можете показати де це можна зробити?"
            vla "Да, звісно"
            vla "Із свободних єсть каюта на другому поверсі, я провєду"
            olek "Міла, ти з нами?"
            mil "Так, звісно"
            show vladimir smile at center
            vla "Тогда знайду вам каюти поблизу, єслі ти розумієш про що я.."
            "З єхидно посмішкою сказав Владімєр"
            olek "..."
            vla "Соромишся? Ну, ладно діло таке, панімаю"
            "Знову розсміявся капітан ковчега"
            "Він провів нас на другий поверх, там дійсно залишилось не так багато кают"
            vla "Ну значіца, можете розміститись у цих двох каютах і відпочівати"
            olek "Добре, дякую, до побачення"
            vla "Пака, хлопче"
            "..."
            scene ark_room with fade
            "Зайшовши в каюту я побачив дуже маленьку кімнатку, хоча воно й не дивно, все ж треба вмістити побільше людей"
            "Кімнатка була дійсно маленька, проте обладнана вона була добре, навіть краще ніж у тому гуртожитку у якому приойшли мої студентські роки"
            "В принципі тут було все чого мені не вистачало там: приємне ліжко, туалет не на поверсі та відсутність тарганів"
            "Проте знаючи, що мені довелось пережити для того щоб опинитись тут, я б волів залишитись у тому старому гуртожитку, аби тільки усього цього не було"
            "Втім це все вже сталось, я тут, тож все що мені залишається - це просто чекати завтрашньої евакуації"
            "Як тільки я приліг на ліжко м'яке, приємно пахнуче, я згадав той час, коли ми щороку їхали на море з батьками"
            "Ця кімнатка дійсно була чимось схожа на купе укрзалізниці, хоча і трохи більша"
            "Засинаючи я відчув теж саме хвилювання, як і тоді..."
            "В дитинстві..."
            jump To_rest
    return
# Нічого не робити
label To_rest:
    window hide
    scene day_6 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#b5deb5")
    pause(1.5)
    scene ark_room with eye_open
    window show    
    ""
    scene black with eye_close
    scene ark_room with eye_open
    "..."
    scene black with eye_close
    scene ark_room with eye_open
    "Я вдома?"
    "Невже це був сон?"
    "..."
    "Ні, це точно не моя кімната, а те що сталось явно не сон"
    scene ark_corridor with fade
    guch "Добрий ранок, гості ковчега, запрошуємо вас на сніданок, тільки поспішіть, бо він триватиме всього півгодини, замість звичайної години"
    guch "Повторюю, сніданок триватиме всього півгодини, завість звичайної години"
    "І до чого б це?"
    "Чесно кажучи з моменту, як ми потрапили на ковчег мене не полишає відчуття, що, ніби всі забули, що відбувається назовні"
    "Цей капітан із своїми екскурсіями, це повідмлення про тривалість сніданку навіюють лише відчуття якогось дитячого табору, а не рятувальної міссії"
    "Чесно кажучи мене це трохи бентежить, але краще вже так, ніж щоб всі сиділи в просякнутих валер'янкою каютах та чекали на те що їх врятують"
    "В будь якому випадку, треба поспішити на сніданок, бо хто зна коли нас ще погодують після евакуації"
    show mila normal at center
    "Вийшовши з каюти я помітив Мілу, яка продиралась крізь натовп"
    olek "Доброго ранку"
    "Зрозумівши, що продертись крізь цей натовп у неї не вийде Міла відійшла вбік"
    mil "І тобі"
    mil "..."
    mil "Вони всі схоже думають, що їм часу не вистачить поїсти, тому всі стадом пхнуться у ту їдальню"
    olek "А ти ніби тільки що не намагалась так само запхнутись до їдальні"
    mil "Зовсім ні, у мене просто режим, я маю поснідати не пізніше 8:30, зрозумів?"
    "Гордовито сказала вона"
    olek "Так-так, зрозумів.."
    "Ми вдвох зайли до їдальні та сіли за столики"
    scene ark_dining_room with fade
    show mila normal at center
    "На вчорашній вечері мене не було, тож це перший раз, як я пробую тут нормально поїсти"
    "Що цікаво, моє вчорашнє порівняння про шкільну їдальню підтверджується сьогодні тим що вся їжа вже розставлена на місця, чекаючи щоб її хтось з'їв, та й раціон сильно не відрізнявся"
    "Сьогодні на сніданок подавали гречку та м'сний стейк"
    "Чесно кажучи я не дуже полюбляю нажертись прямо з ранку, я скоріше залив би гречку молоком додавши туди цукор, а стейк я би взагалі залишив на обід, але повертаючись до того що після сніданку, ми можливо не скоро поїмо, це не поганий варіант набратись енергії на довго"
    "..."
    "За сніданком ми з Мілою особливо не спілкувались, але вона зікінчивши трохи раніше за мен вона все ж зачекала мене"
    "І коли я доїв ми разом пішли у сторону виходу біля якого стояв капітан, ніби контролюючи щоб всі все доїли"
    olek "Дякую, що зачекала"
    mil "Ага"
    "Капітан підійшов до мене"
    show mila normal at right
    show vladimir normal at center
    vla "Можно тебе на секундочку"
    olek "А що таке?"
    vla "Та нічого такого, просто треба твоя допомога"
    olek "Ну, добре"
    olek "Тоді, побачимось пізніше.."
    mil "Ага, удачі"
    scene ark_corridor with fade
    show vladimir normal at center
    "Ми з капітанов мідійшли на кілька метрів в бік"
    olek "Так що ви там хотіли?"
    vla "Та, я ось хотів щоб ти допоміг принести декілька бутлів води"
    vla "Наші хлопці просто ходили на вилазку в місто та набрали трохи, а віднести нема кому"
    olek "Але чому саме я?"
    vla "Ну от подобаєшся ти мені, ти якийсь надійний, чи що.."
    vla "То як допоможеш?"
    olek "Добре...Звідки хоч ті бутлі брати, і куди нести?"
    vla "Та он там, біля входу, а нести власне сюди, в їдальню"
    vla "Ти парубок міцний, за пару ходок все і донесеш"
    olek "..."
    vla "Дякую тобі, виручив..."
    vla "Ну добре, я пішов"
    olek "Куди? А бутлі?"
    show vladimir smile at center
    vla "Які бутлі? Ти бачив хоч раз, щоб капітан бутлі таскав.."
    hide vladimir smile at center
    "Розсміявшись він миттєво зник у командному центрі"
    "Ось так завжди, Льоха працюй, а ми, капітани, таким не займаємось"
    "..."
    "З іншого боку я і хотів чимось допомогти, не сидіти ж мені весь час до евакуації без діла"
    "Я дійшов до входу, там стояло чотири бутлів по дев'ятнадцять літрів"
    "Я такі ще ніколи не носив, навіть не знаю, як до них підступитися"
    "Напевно краще все ж не ризикувати спиною та носити по одному"
    # Сцена де Олексій носить воду
    scene black with fade
    "Я підняв перший"
    "Ну, рушили..."
    "..."
    "Таскав я бутлі досить довго, проте вже переніс майже всі, лишився лише один"
    "Схоже, моя скудна фізична підготовка дає про себе знати"
    "Восьмий бутль дається вже дуже тяжко, напевно треба буде робити декілька зупинок"
    "..."
    "Ну добре, останній ривок і я закінчу з цим дорученням"
    "Погнали..."
    "Я закинув бутль собі на плече, але ноги підкосились та я почав падати назад"
    olek "Ай-ай-ай.."
    "Я таки вдарився головою а бутль випав з рук"
    "Бутль.. Бутль.."
    "Доречі де він, щось я не бачу.."
    "Я почав крутитись довкола, і озернувшись побачив, що на місці де раніше була суцільна стіна, зараз була чимала дірка"
    # Олексій стоїть перед стіною в якій дірка
    scene black with fade
    "Бутль лежав по ту сторону стіни"
    "Із-за стіни віяло холодом, а  в середині було дуже темно"
    "Коли нам проводили екскурсію ковчегом про це місце нічого не казали"
    "Чи варто мені його перевірити?"
    "..."
    "Вирішувати треба швидко, поки ніхто ще не помітив"
    $ time = 7
    $ timer_range = 7
    $ timer_jump = 'Timer_cell'
    show screen countdown
    menu:
        "Перевірити підозрілий відсік":
            hide screen countdown
            if is_refuel == True:
                jump Check_cell
            else:
                jump Check_cell_no_refuel
        "Проігнорувати відсік і просто забрати бутль":
            hide screen countdown
            if is_kill_neighbor == False:
                jump Not_check_cell
            else:
                jump Not_check_cell_kill_neighbor
    return
# Занадто довго приймалось рішення що робити з відсіком - Кінцівка 2
label Timer_cell:
    "Зі спини до мене підійшов хлопець у формі, він напевно помітив, що я вронив бутль та пробив дірку у стіні"
    noname "Ти що тут робиш, падло?"
    olek "Я? Та так, бутлі несу"
    noname "Он воно як.."
    noname "Знаеш, давай залишимо той бутль, пішли пройдемося"
    olek "Нащо? Мені капітан казав щоб я відніс ці бутлі, я не можу їх тут не залишу"
    noname "Я скзав ми ідемо пройтись"
    scene ark_corridor with fade
    "Він жорстко заламав мою руку та повів до командного пункту"
    "Схоже цей відсік був дуже важливий і мені доведеться вимолювати прощення у самого капітана, але ж він досить позитивний, напевно все обійдеться звичайним \"Пробачте, був не обережний\" і все, правда ж?"
    "Хлопець у формі довів мене до командного центру не послабляючи хватки ні на секунду"
    scene ark_team_center with fade
    noname "Чого це ти тягнеш того бідолагу так, а Ваня?"
    noname "Та цей недоумок зламав стіну в Холодильник.."
    noname "Зрозумів, тоді я викличу капітана"
    noname "Будь ласкавий"
    "Хлопець, що стояв на сторожі відійшов з посту і попрямував в сторону головного відсіку"
    noname "До речі, заведи цього в середину, аби ніхто не бачив"
    "Хлопець у формі все ще тримав мене не послабляючи захват ні на мить"
    "Невже холодильник - це такий важливий відсік? Я звісно розумію, що температура там повинна триматись, і для цього потрібна герметичність, але не настільки ж.."
    "Тим паче кок показував нам той холодильним, там взагалі не відсік.."
    "..."
    "З рештою капітан таки прийшов"
    show vladimir normal at center
    vla "О, Льоха, це ти?"
    olek "Вибачте, я не спіціально вронив той бутль, я не хотів робити дірку в стіні, вибачте будь ласка"
    vla "Тихше-тихше, не мельтеши так.."
    vla "Я вже чув, що сталося.."
    olek "Якщо буде потрібно, я відпрацюю, вибачте"
    vla "Звісно відпрацюєш, але не живим.."
    olek "Що?"
    vla "Власне, ти пробив дірку у вдісіку холодильника, проте це не той холодильник з якого дістаються інгрідієнти для всіх, це наш особивстий холодильник"
    vla "Холодильник команди, там ми не проводимо екскурсії, але скоро ти опинешся там.."
    olek "І що це має означати?"
    vla "Ну, якщо ти досі не допетрав, то давай я тобі популярно поясню.. Єдиною умовою буде, не перебивати"
    vla "Ти мене почув?"
    olek "..."
    show vladimir smile at center
    vla "От і славно.. Тож почнімо.."
    vla "На жаль для вас, ми обдурили всєх присутніх і заманілі вас всіх на це судно не для порятунку, а для пополненія нашого запасу м'яса"
    show vladimir angry at center
    olek "Що ти сказав?"
    "Владімєр дав мені ляпаса"
    vla "Я ж сказав не перебивати.. У тебе ще буде шанс на слово.."
    vla "Фактично це даже не судно, а лише часний дом, який ми стилізували під \"Рятувальний ковчег\" аби заманіть вас сюда"
    vla "Ужасно, чи не так? Но самий жах ви дізнаєтесь зараз"
    vla "Мости, які раніше з'єднували ваші поселення, були підірвані нами. Ми залишили вам лише один маршрут, что би кожен дрон, що пролітає, міг повідомляти про переміщення \"Рятувального ковчега\", який насправді нікуди не переміщувався, справжній ковчег так само ждьот людей у Рівному"
    vla "Як ти думаєш, чому всі тут ставились до вас так добре? Звісно ж тому що відкормлені свині найсмачніші"
    vla "Ти, напевно, думаєш нащо я тобі це розповів? Все просто, кожна людина має право знати правду хоча би перед смертю"
    vla "Чесно кажучи ми планували почекати ще кілька днів, щоб приводити план в дію тоді коли ковчег має злітати, але через тебе нам доведеться зробити це раніше"
    vla "Цікаво що на це сказала би Міла, чи не так? Втім це уже не важливо.. Тепер ти знаєш все.."
    vla "Твої останні слова?"
    olek "Я ніколи тобі не пробачу, курво, ти відповіси за це!!"
    vla "Чесно кажучи, такий собі вибір дещо клішований, втім, це не мені вирішувати..."
    scene end2
    pause
    if persistent.end2 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end2 = True
    return



# Рішення перевірити підозрілий відсік
label Check_cell:
    "В принципі немає нічого дивного в тому, що нам щось не показали, все ж ми не команда ковчега"
    "Проте саме це місце викликає у мене багато сумнівів"
    "Можливо я таки не помилявся, коли сумнівався у правдивості переносу"
    "Все ж мені треба перевірити цей відсік, щоб я був повністю спокійний та міг довіритись команді ковчега"
    "Тож, включивши ліхтарик на телефоні, я заходжу"
    "..."
    "Світла ліхтарик давав дуже мало"
    "В кімнаті смерділо протсо нестрепно"
    "Температура тут досить низька, можливо це якийсь відсік для зберігання їжі"
    "Це ж звичайна практика тримати їжу у холодильнику, я сотні разів бачив такі на ринках, тож чому б такого холодильника не могло бути тут"
    "У спробах заспокоїтись думав я, але щось таки не давало мені спокою"
    "Я вирішив, що пройдусь до іншого кінця кімнати, аби все ж бути впевненим"
    "Ліхарик світить дуже слабко, напевно щоб побачити хоч щось мені треба буде впертись у це носом"
    "Не встиг я це подумати, як на світло все ж потрапив, якийсь об'єкт"
    "Підійшовши ближче у незрозумілому силуєті мені вдалось розгледіти..." 
    "Людську руку?.."
    "Ні, це точно не могла бути вона, це напевно світло, якось неправильно падало"
    "Це ж не може бути рука, правда?.."
    "У цей момент увімкнулось світло"
    "Я швидко сховався за одним із стендів"
    "Озираючись я намагався знайти тіні, або відображення у плитці, аби зрозуміти хто це йде, проте поки я шукав хоч якісь зачіпки на те хто це може бути я встиг роздивитись усе що було у тій кімнаті"
    "Навколо висіли пошматовані тіла людей, вони були у такому ж стані, як худоба у м'ясних відділах ринків"
    "Я намагався себе переконати, що мені все це мариться, але кожен раз коли я підіймав погляд, людські частини тіл вривались мені в очі"
    "Невже, це місце не є місцем порятунку?"
    "Мої думки перервав грубий голос, що лунав зі сторони дверей"
    kok "Шо цей довбень так довго носить ті бутлі"
    noname "Та, яка різниця, забий на нього"
    "Голоси невпинно наближались"
    kok "Ну так то воно так, але з чого мені робити юшку"
    "У кількох метрах від мене почувся брязкіт ланцюгів"
    noname "Та нічого, встигниш ще, вони все одно звідси не планують валити, ми ж типу рятуємо їх"
    kok "..."
    kok "Як ти думаєш, з чого краще робити бульйон, з ноги чи все ж з руку?"
    noname "Навіть незнаю..."
    noname "Ну дивлячись на цього товстуна, думаю краще все ж з ноги, ще й м'ясо в суп буде"
    kok "Напевно ти правий..."
    "В кімнаті пролунав хрускіт кісток"
    kok "Дідько, міцна кістка"
    "Звук повторився"
    kok "О, от так би одразу.."
    kok "Ну добре, хапай це та тягни на кухню"
    noname "Слухаюсь, пане"
    "Тіні почали прямувати до виходу"
    "Світло знову вимкнулось"
    "Тепер я вже ні в чому не сумнівався..."
    "Ніякого переносу ковчега не було, нас всіх просто заманили в пастку, ніхто навіть не думав нас рятувати, все це створено лише для того аби з'їсти нас"
    "Тож єдиний висновок, який у мене є це те що команда цього псевдоковчега - канібали, а ми тут для поповнення їх запасів"
    "Я недозволю цього!"
    "Ми боролись за виживання з гуманоїдами, що перевершують людину в усіх показниках, отже зможемо поборотись і з людьми"
    "Я маю попередити всіх та вшиватись звідси"
    "Для цього мені треба відіграти дурника, який ні про що не здогадується, аби проникнути у командний пункт і звільнити всіх"
    "..."
    scene ark_corridor with fade
    "Я швидко виліз з таємничого відсіку захопивши з собою бутль"
    "Після того, що я побачив, я навіть не помітив, який важкий бутль та даніс його досить швидко"
    scene ark_dining_room with fade
    show kok normal at center
    kok "О, дякую, друже"
    kok "Не сильно ухекався?"
    "З усмішкою сказав кок"
    olek "Чесно кажучи так, але я вже встиг відпочити"
    kok "Ясно, ну от і добре, тоді чекатиму всіх на обід"
    "Як двозначно звучить ця фраза від канібала..."
    olek "Так, я теж буду з нетерпінням чекати, до побачення"
    kok "Бувай"
    scene ark_corridor with fade
    "Тепер треба знати Мілу, та забиратись звідси.."
    "Вона скоріш за все сидить у своїй каюті"
    "Отже заберу її та ми разом поїдемо звідси"
    "..."
    "Вона все ж таки була у себе в каюті"
    scene ark_mila_room with fade
    show mila normal at center
    olek "Міла, мені поьрібна твоя допомога"
    show mila surprised at center
    mil "Що вже сталось?"
    "Я зайшов до її каюти та закрив двері"
    olek "Отже, розклад такий, після сніданку капітан запряг мене носити бутлі, пам'ятаєш?"
    mil "Ну так.. і що..."
    olek "Так ось, коли я ніс останній бутль я випадково впустив його та зробив дірку в стіні"
    mil "Тільки не проси мене допомагати латати її"
    olek "Та ні, я не за це.."
    olek "Простір за стіною здався мені підозрілим, тож я вирішив перевірити його..."
    mil "Ну не тягни, розповідай уже.."
    olek "В цілому, я довідався, що це місце ніякий не ковчег, а так звана команда насправді канібали"
    mil "Що? Як це може бути правдою?"
    olek "Не знаю, але я власними очима бачив той відсік де вони зберігають людські тіла"
    olek "Тож у нас є не багато часу, поки вони не помітили дірку в стіні, аби врятувати людей, та врятуватись самим"
    mil "І який план?"
    olek "Нам треба пробратись у командний пункт та запустити оголошення про істиний сенс цього місця після чого ми будемо тікати через чорних хід в командному пункті"
    show mila normal at center
    mil "Добре, тоді пішли..."
    scene ark_corridor with fade
    "Ми вийшли з каюти забравши тільки те що можна убло просто нести, щоб не здаватись підозрілими"
    "Шлях до командного центру досить короткий, проте зараз він тягнеться цілу вічність"
    "Я відчуваю кожен крок, кожну секунду, кожен удар серця"
    "В цей момент в голові лишилась лише одна думка: \"Хоч би я не помилився...\""
    "Проте це не має мене відволікати від цілі"
    "Ось уже і видно командний центр, а отже у мене лишилась одна мить аби зібратись"
    # Сцена затримання
    scene black with fade
    noname "Стійте, а ви куди?"
    olek "До капітана, він просив зайти"
    noname "Дивно, він же пішов тільки що.."
    olek "Напевно забув..."
    olek "Може ми його всередині почекаємо?"
    noname "Ні, чекайте тут"
    olek "Ну, добре, почекаємо"
    "Ми з Мілою стали біля охоронця в очікуванні капітана"
    "Звісно ж капітан нам тут не потрібен, він буде лише заважати, до того ж довго чекати ми не можемо"
    "І що ж робити?.."
    "..."
    "Раптом охоронець почав падати"
    olek "Це що, божа допомога?"
    mil "Ну, якщо ти вважаєш мене богинею, то так.."
    "Міла стояла з іншого боку охоронця тримаючи пістолет в руках, напевно вона оглушила його ударом в голову"
    mil "Ну, чого стоїш? Пішли всередину"
    "Міла прочинила двері, а я затягнув туди тіло охоронця"
    scene ark_team_center with fade
    show mila normal at center
    mil "Отже, як будемо пускати сповіщення?"
    olek "Через гучномовець"
    olek "Тільки ще б зрозуміти, яка кнопка відповідає за нього"
    mil "А хіба не ця?"
    "Міла вказала на маленьку червону кнопку по середині пульта керування"
    mil "Здається нам про неї розповідали підчас екскурсії"
    "Звичайно, як зазвичай кругла червона кнопка вирішує все.. ну і добре"
    olek "Так, здається вона"
    "Я натиснув на кнопку та почув гучний сигнал сповіщення"
    guch "Шановні пасажири ковчега, до вас звертається новий капітан судна, Олексій"
    guch "Двадцять хвилин тому мною було викрити єдиний відсік, який не демострували жодному з нас"
    guch "У тому відсіку зберігались людські частини тіла, які на цьому судні використовуються, як їжа"
    guch "Звідси слідує висновок, що команда ковчега - канібали, нас сюди заманили, аби поповнити їх запаси їжі"
    guch "І останнє, це місце не є \"Рятувальним ковчегом\", нас ніхто не врятує, а отже ми самі маємо рятуватись"
    guch "Біжіть звідси, та бережіть себе"
    "Промова вийшла трохи слабкувата, проте я сподіваюсь вона все ж буде мати свій ефект"
    olek "Добре, тут ми закінчили, тож тікаймо"
    mil "Так"
    "Ми розвернулись та збирались прямувати до чорного виходу"
    show mila normal at right
    show vladimir angry at center
    vla "Не так швидко, хлопче!"
    vla "Ти мені відповіси за це!"
    mil "Я так не думаю"
    # Сцена з вистрілом у капітана
    scene black with fade
    "Міла дістала пістолет та стрільнула капітанові у плече"
    vla "Курва!"
    mil "Тепер ви наш заручник, і на майбутнє, не гарно кидатись такими словами в тендітну дівчинку"
    "Міла підійшла до псевдо-капітана та вдарила йому руків'ям від пістолета по макітрі, після чого взяла його під руки та понечсла прикриваючись ним, як щитом"
    mil "Схоже до твоєї машини ми не дістанемось, давай заберемо їхню"
    olek "Хороша ідея"
    "Я забрав зі столу ключницю, до неї було доєднано чимало ключів, хоч один та й мав згоитись десь"
    scene ark_cages with fade
    "Навколо було досить темно, але на виході все ж було світло"
    "Світло, що символізувало свободу та виживання"
    "Біля виходу стояли клітки в яких лежали кістки, в цьому місті такому не дивуєшся, але все ж трохи лячно"
    "В одній із кліток почувся шурхіт"
    "За мить в тій клітці з'явилися дві білі цітки"
    "З клітки прозвучав насилу вичавлений звук"
    $ rom = Character("???", color="#FFFFFF")
    rom "Врятуйте..."
    "Я підсвітив ліхтариком клітку"
    scene prisoner_cage  with fade
    "В ній стояв, чоловік дуже слабкий, змучений і без однієї руки"
    rom "Врятуйте, молю вас..."
    "Судячи з його стану він не зможе протриматись у тій клітці довго, проте також він маловірогідно зможе вижити у світі повному гуманоїдів"
    "Якщо я його врятую, совість не дозволить залишити його тут, але здоровий глузд підказує, що він буде лише плутатись під ногами і є великий шанс загинути через це"
    "Вирішувати треба швидко, доки за нами не з'явилась погоня"
    "Тож, що ти вирішиш Олексію?.."
    "..."
    menu:
        "Врятувати полоненого":
            if is_kill_neighbor == False:
                jump Help_captive
            else:
                jump Help_captive_kill_neighbor
        "Не рятувати полоненого":
            if is_kill_neighbor == False:
                jump Not_help_captive
            else:
                jump Not_help_captive_kill_neighbor
    return
# Рішення врятувати полоненого - Кінцівка 3
label Help_captive:
    "І все ж я не можу просто залишити його тут"
    "Я маю його врятувати"
    "Можливо на ключниці є ключі від цієї клітки?"
    "Я підсвітив ключницю ліхтариком та почав порпатись у ній"
    "Ні це за великий..."
    "Цей замалий.."
    "Цей плаский"
    mil "Ти ще довго там?"
    "Вона стояла вже біля виходу"
    olek "Так, зачекай секунду.."
    "Нарешті, це точно має бути він"
    "Ключ увійшов у замок та відчинив його"
    scene ark_cages with fade
    show roman normal at center
    rom "Дякую, вам пане, я вік не забуду вашої доброти"
    olek "Та ну тебе, на моєму місці кожен вчинив би так само"
    rom "Ну не скажіть.."
    olek "В будь якому випадку, якщо я тебе врятував, то тут вже не залишу, поїхали з нами?"
    rom "А можна?"
    olek "Звісно, чого ж ні"
    rom "Дякую вам, пане"
    olek "Тебе до речі як звати?"
    rom "Роман, а вас?"
    $ rom = Character("Роман", color="#FFFFFF")
    olek "Олексій, приємно познайомитись"
    rom "Навзаєм, пане"
    mil "Агов, ви ще довго?"
    olek "Та йдемо, непереймайся"
    mil "Ото вже..."
    "Ми вийшли на двір"
    scene ark_outside with fade
    show mila normal at right
    show roman normal at left
    "В ключниці було одназу кілька ключів схожих на ключі від машин, але лише на одному був дармовис з кнопками відкрити, тож вібір був очевидний, яка машина відкриється по натисканню на цю кнопку, така і буде нашою"
    "Звук лунав від шикарного джипа"
    olek "Схоже доля нарешті вирішила вирішила нас винагородити"
    mil "Схоже на те"
    "Ми залишили псевдо-капітана біля його псевдо-ковчега та сіли у машину та відїхали на кілька-сот метрів від псевдо-ковчега, аби не попастись у руки розлюченого екіпажа"
    scene ark_road with fade
    show mila normal at right
    show roman normal at left
    olek "Отже, поки ми ще не відїхали, давайте вирішимо куди нам далі їхати?"
    olek "Більшість людей вже не вірять у існування \"Рятувального ковчега\", тож просто розїхались у різних напрямках, а ті що все ж вірять у ковчег вже напевно досить далеко"
    olek "Як ви вважаєтє, чи є сенс спробувати доїхати до попереднього місця ковчега, чи все ж це буде марна витрата бензину і нам краще спробувати придумати інший план?"
    rom "Я за те щоб їхати до минулого місця ковчега, бо є високі шанси на те що це справжній ковчег, а якщо ні, то там явно мають бути такі ж обдурені люди, як і ми, тож ми зможемо обєднатись з ними в групу"
    rom "Хоча це лише думка стариганя, який вже прожив достатнь, аби цим пишатись"
    rom "В будь якому разі вирішувати вам, молодь"
    mil "Мені здається, що в цьому є сенс, чому б не спробувати?"
    mil "Чи так, чи так, все одно хоча б спробувати і провалитись буде на багато краще ніж не спробувати і бачити, як \"Рятувальний ковчег\" летить над нашими головами"
    olek "Тоді, рушили..."
    window hide
    scene day_7 with fade
    pause(1.5)
    scene final_road_0 with fade
    window show
    "Ніч пройшла досить спокійно, проте все відчувалось як в тумані" 
    "Через декілька днів я напевно вже і не згадаю жодної фрази, яку я почув в ночі"
    "Зараз на годиннику десята п'ятдесят, до відбуття ковчега лишилось трохи більше двох годин, а ми досі не доїхали туди"
    "Мені здалося дивним, що за весь час, з моменту, як ми виїхали з псевдо-ковчега, ми не бачили жодного гуманоїда, проте так навіть краще"
    "..."
    scene final_road_1 with fade
    "В подорожі прийшла ще година"
    "На горизонті нарешті з'явився велечезний гвинтокрил, це означало, що наш шлях майже закінчений"
    "Але також в двуїста метрах від нас майоріла велечезна зграя гуманоїдів, що прямували в сторону ковчега"
    "Їх було так багато, що дивлячись на них мені ввижався велечезний живий організм, що плететься своїми волохатими лапками пожираючи дорогу перед собою"
    "Схоже нам доведеться якимось чином продертися через цей натовп, тож я піддав газу"
    olek "Тримайтесь, зараз буде трохи жорсткувато!"
    "Мої компаньйони втислись у крісла"
    # Пробивання крізь натовп гуманоїдів
    scene black with fade
    "Машина продералась крізь весь той натовп гуманоїдів"
    "Вони намагались залізти на машину, та збивали один одного"
    "Деякі з них падали під колеса, чим сповільнювали нас, проте машина все ж була досить потужна і у нас таки вийшло продертись через жах, але тепер гуманоїди прямували не на ковчег, а саме за нами"
    "Я намагався їхати максимально швидко, як тільки вмів"
    "За рахунок цього ми досить швидко прибули до ковчега"
    scene final_road_2 with fade
    "Коли ми прибули до місця де вже стояло багато машин по гучномовцю до нас звернувся військовий"
    guch "Зупиніться!"
    "З неохотою я зупинився"
    olek "Але ж погоня.."
    "Тільки я подумав про це, як я почув дуже багато пострілів"
    "З верху ковчега по гуманоїдам був відкритий вогонь"
    "Через декілька секунд від їх величезної зграї не залишилось нікого живого"
    guch "Отже, панове, вітаю з прибуттям на ковчег, хотів би сказати я, але вам ще треба пройти мінне поле, останнім часом навали гуманоїдів стали більші, тож нам довелося розмістити перед ковчегом мінне поле"
    guch "Просимо вибачення, але вам доведеться пройти це.."
    rom "Я так бачу, що міни розкидані на доволі великій відстані, тож у нас не має бути проблем з тим щоб його пройти"
    mil "Зробімо це"
    # Пробивання крізь міни
    scene final_mines with fade
    "Ми почали проходити через мінне поле, міни були розкидані досить далеко одна від одної, тож напевно це не мало б викликати у нас проблем"
    "Так сюди.."
    "Тепер сюди.."
    "..."
    "Схоже я вже майже закінчив"
    "Тож мені сю.."
    mil "Фух, я все!"
    "Я відволікся на Мілу та не помітив куди я наступаю.."
    olek "Дідько, це що міна?"
    mil "Олексію!"
    guch "Без паніки, громадяни, тільки не відступайте, ця міна створена для того, аби ранити супротивника у спину, тож єдине, що ви маєте зробити, це не робити нічого"
    guch "Тільки не рухайтесь, ми зараз придумаємо що робити.."
    olek "Легко сказати.."
    rom "Я можу допомогти"
    olek "Що?"
    rom "Я можу допомогти, я сапер у минулому"
    olek "Ти певен? Краще іди до ковчега"
    rom "Ні пане, я певен, ви врятували мене, тож, щоб не бути винним, я маю врятувати вас"
    show roman normal at center
    "Він підскочив до мене та почав щось робити підмоєю ногою"
    "Він підкопався під міну і почав щось розручувати нігтем на мізинці правої руки"
    "Десь з хвилину він щось там крутив та надавлював, постійно негадуюючи тримати ногу у тому ж положені"
    rom "От дідько, нехоче і все, а якщо так..?"
    "..."
    scene black with eye_close
    "Я закрив очі в очікуванні кінця, але він чомусь не наставав"
    rom "Пане, все нормально?"
    scene final_mines with eye_open
    olek "Що?"
    rom "Я все зробив, ми можемо рухатись далі"
    olek "Дякую, Романе!"
    "Я зробив останній крок і мінне поле було нарешті пройдене"
    noname "Отже, панове, тепер я вітаю вас на борту \"Рятувального ковчега\", тут ви будете у безпеці, до відправки лишилось кілька хвилин, тож прошу вас займати вільні місця для евакуації"
    "Ми піднялись на борт"
    scene final_ark with fade
    show mila normal at left
    show roman normal at right
    "Найближчими місцями були місця біля входу, туди ми і сіли"
    olek "Ну ось і все, нарешті ми у безпеці"
    "Прошепотів я собі"
    olek "Дякую вам обом, що були зі мною на цьому шляху"
    mil "Ну якби не ти цей шлях би для мене і не почався!"
    rom "Як і для мене"
    "Нашу розмову перебив запуск двигунів"
    "Гвинтокрил почав злітати"
    "Тепер точно не може бути жодних підступів"
    "Ми в безпеці..."
    "Як тільки я це подумав, я відчув, щось зачепилось мені за ногу"
    "Це напевно чийсь рюкзак впав"
    "Але схоже ні, бо тягнув мене він дуже сильно"
    "Засумнівавшись я поглянув вниз і побачив верхню частину тіла гуманоїда, який намагався тягти мене вниз"
    olek "Якого біса?"
    "Гуманоїд, явно не збирався летіти з нами довго, тож докладав максимальних зусиль, аби зтягти мене якомога швидше"
    "У нього схоже вийшло"
    "Він витяг мене з крісла і я почав з'їзжати з палуби в слід за гуманоїдом"
    # Сцена де гуманоїд стягує г.г. з корабля
    scene black with fade
    "Я намагався вхопитись хоч за щось і випадково зачепив Мілу"
    mil "Що за чортівня?"
    "Міла повернулась у мій бік і побачила як гуманоїд намагається стягти мене вниз"
    "Швидким кидком вона схопила мене за руку"
    mil "Швидше допоможіть мені, він падає"
    "Через шум двигунів її було майже нечути, тож зреагував лише Роман, який сидів біля неї"
    "Він швидко встав та схопив нас обох за руки намагаючись привернути увагу військових"
    rom "Швидше сюди!"
    "Військові помітили, що ми якось дивно себе поводимо побігли до нас аби заспокоювати"
    "Але вони побачили, що гуманоїд тягне мене донизу з ковчега, і військові стрільнули у гуманоїді, що дало моїм компаньйонам трохи часу підтягти мене"
    "Врешті решт гуманоїд впав, а я залишився на борту"
    scene end3 with fade
    olek "Дякую вам.."
    mil "Будь хто зробив би так само"
    "З посмішкою сказала Міла"
    rom "Сподіваюсь далі нам вже не доведеться нікого рятувати"
    olek "Це точно!"
    "Тепер гвинтокрил летів, розсікаючи хмари на своєму шляху"
    "Під нами простяглися наші міста, заповнені зеленим туманом"
    "Вони кищали гуманоїдами, але навіть у цю осінню пору сонце стояло в зеніті і світило яскраво"
    "Промені просвічувалися через той туман, наче прориваючись через грозові хмари"
    "Ці промені дарували надію на те, що в подальшому всі зможуть повернутись до своїх домівок"
    pause
    if persistent.end3 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end3 = True
    return





# Рішення врятувати полоненого (Заражений) - Кінцівка 3
label Help_captive_kill_neighbor:
    "І все ж я так не можу"
    "Я маю його врятувати"
    "Можливо на ключниці є ключі від цієї клітки?"
    "Я підсвітив ключницю ліхтариком та почав порпатись у ній"
    "Ні це за великий..."
    "Цей замалий.."
    "Цей плаский"
    mil "Ти ще довго там?"
    "Вона стояла вже біля виходу"
    olek "Так, зачекай секунду.."
    "Нарешті, це точно має бути він"
    "Ключ увійшов у замок та відчинив його"
    rom "Дякую, вам пане, я вік не забуду вашої доброти"
    olek "Та ну тебе, на моєму місці кожен вчинив би так само"
    rom "Ну не скажіть.."
    olek "В будь якому випадку, якщо я тебе врятував, то тут вже не залишу, поїхали з нами?"
    rom "А можна?"
    olek "Звісно, чого ж ні"
    rom "Дякую вам, пане"
    olek "Тебе до речі як звати?"
    rom "Роман, а вас?"
    $ rom = Character("Роман", color="#FFFFFF")
    olek "Олексій, приємно познайомитись"
    rom "Навзаємо, пане"
    mil "Агов, ви ще довго?"
    olek "Та йдемо, непереймайся"
    mil "Ото вже..."
    "Ми вийшли на двір"
    "В ключниці було одназу кілька ключів схожих на ключі від машин, але лише на одному був дармовис з кнопками відкрити, тож вібір був очевидний, яка машина відкриється по натисканню на цю кнопку, така і буде нашою"
    # Звук відкривання машини (типу пік-пік)
    "Звук лунав від шикарного джипа"
    olek "Схоже доля нарешті вирішила вирішила нас винагородити"
    mil "Схоже на те"
    "Ми залишили псевдо-капітана біля його псевдо-ковчега та сіли у машину та відїхали на кілька-сот метрів від псевдо-ковчега, аби не попастись у руки розлюченого екіпажа"
    olek "Отже, поки ми ще не відїхали, давайте вирішимо куди нам далі їхати?"
    olek "Більшість людей вже не вірять у існування \"Рятувального ковчега\", тож просто розїхались у різних напрямках, а ті що все ж вірять у ковчег вже напевно досить далеко"
    olek "Як ви вважаєтє, чи є сенс спробувати доїхати до попереднього місця ковчега, чи все ж це буде марна витрата бензину і нам краще спробувати придумати інший план?"
    rom "Я за те щоб їхати до минулого місця ковчега, бо є високі шанси на те що це справжній ковчег, а якщо ні, то там явно мають бути такі ж обдурені люди, як і ми, тож ми зможемо обєднатись з ними в групу"
    rom "Хоча це лише думка стариганя, який вже прожив достатнь, аби цим пишатись"
    rom "В будь якому разі вирішувати вам, молодь"
    mil "Мені здається, що в цьому є сенс, чому б не спробувати?"
    mil "Чи так, чи так, все одно хоча б спробувати і провалитись буде на багато краще ніж не спробувати і бачити, як \"Рятувальний ковчег\" летить над нашими головами"
    olek "Тоді, рушили..."
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла досить спокійно, проте все відчувалось як в тумані" 
    "Через декілька днів я напевно вже і не згадаю жодної фрази, яку я почув в ночі"
    "Зараз на годиннику десята п'ятдесят, до відбуття ковчега лишилось трохи більше двох годин, а ми досі не доїхали туди"
    "Мені здалося дивним, що за весь час, з моменту, як ми виїхали з псевдо-ковчега, ми не бачили жодного гуманоїда, проте так навіть краще"
    "..."
    "В подорожі прийшла ще година"
    "На горизонті нарешті з'явився велечезний гвинтокрил, це означало, що наш шлях майже закінчений"
    "Але також в двуїста метрах від нас майоріла велечезна зграя гуманоїдів, що прямували в сторону ковчега"
    "Їх було так багато, що дивлячись на них мені ввижався велечезний живий організм, що плететься своїми волохатими лапками пожираючи дорогу перед собою"
    "Схоже нам доведеться якимось чином продертися через цей натовп, тож я піддав газу"
    olek "Тримайтесь, зараз буде трохи жорсткувато!"
    "Мої компаньйони втислись у крісла"
    "Машина продералась крізь весь той натовп гуманоїдів"
    "Вони намагались залізти на машину, та збивали один одного"
    "Деякі з них падали під колеса, чим сповільнювали нас, проте машина все ж була досить потужна і у нас таки вийшло продертись через жах, але тепер гуманоїди прямували не на ковчег, а саме за нами"
    "Я намагався їхати максимально швидко, як тільки вмів"
    "За рахунок цього ми досить швидко прибули до ковчега"
    "Коли ми прибули до місця де вже стояло багато машин по гучно мовцю до нас звернувся військовий"
    guch "Зупиніться!"
    "З неохотою я зупинився"
    olek "Але ж погоня.."
    "Тільки я подумав про це, як я почув дуже багато пострілів"
    "З верху ковчега по гуманоїдам був відкритий вогонь"
    "Через декілька секунд від їх величезної зграї не залишилось нікого живого"
    guch "Отже, панове, вітаю з прибуттям на ковчег, хотів би сказати я, але вам ще треба пройти мінне поле, останнім часом навали гуманоїдів стали більші, тож нам довелося розмістити перед ковчегом мінне поле"
    guch "Просимо вибачення, але вам доведеться пройти це.."
    rom "Я так бачу, що міни розкидані на доволі великій відстані, тож у нас не має бути проблем з тим щоб його пройти"
    mil "Зробімо це"
    "Ми почали проходити через мінне поле, міни були розкидані досить далеко одна від одної, тож напевно це не мало б викликати у нас проблем"
    "Так сюди.."
    "Тепер сюди.."
    "..."
    "Схоже я вже майже закінчив"
    "Тож мені сю.."
    mil "Фух, я все!"
    "Я відволікся на Мілу та не помітив куди я наступаю.."
    olek "Дідько, це що міна?"
    mil "Олексію!"
    guch "Без паніки, громадяни, тільки не відступайте, ця міна створена для того, аби ранити супротивника у спину, тож єдине, що ви маєте зробити, це не робити нічого"
    guch "Тільки не рухайтесь, ми зараз придумаємо що робити.."
    olek "Легко сказати.."
    rom "Я можу допомогти"
    olek "Що?"
    rom "Я можу допомогти, я сапер у минулому"
    olek "Ти певен? Краще іди до ковчега"
    rom "Ні пане, я певен, ви врятували мене, тож, щоб не бути винним, я маю врятувати вас"
    "Він підскочив до мене та почав щось робити підмоєю ногою"
    "Він підкопався під міну і почав щось розручувати нігтем на мізинці правої руки"
    "Десь з хвилину він щось там крутив та надавлював, постійно негадуюючи тримати ногу у тому ж положені"
    rom "От дідько, нехоче і все, а якщо так..?"
    "..."
    # Звку типу Клац
    "Я закрив очі в очікуванні кінця, але він чомусь не наставав"
    rom "Пане, все нормально?"
    olek "Що?"
    rom "Я все зробив, ми можемо рухатись далі"
    olek "Дякую, Романе!"
    "Я зробив останній крок і мінне поле було нарешті пройдене"
    noname "Отже, панове, тепер я вітаю вас на борту \"Рятувального ковчега\", тут ви будете у безпеці, до відправки лишилось кілька хвилин, тож прошу вас займати вільні місця для евакуації"
    "Ми піднялись на борт"
    olek "Кхе-кхе"
    "Я знову викашляв трихи зеленого газу"
    noname "А ну стояти!"
    "Військовий дістав рацію"
    noname "Всі, швидко сюди, у нас мутант на борту!"
    mil "Який ще мутант, ви про що взагалі?"
    noname "Він відхаркує зелений газ, отже він уже в легенях і ваш компаньйон скоро може перетворитись на повноцінного мутант"
    rom "Вибачте, панове, а що ви будете з ним робити?"
    noname "Власне, нам не потрібен ризик.. {w} Нам доведься його прибрати"
    mil "В сенсі прибрати? Ви що з глузду з'їхали, він же їхав сюди протягом тижня, і нічого не сталось, напевно у нього маленька доза того газу і.."
    noname "Те що він їхав сюди тиждень і нічого не сталось не доводить, що нічого не станиться й на далі"
    rom "Пане, але ж ви не можете вбити невинну людину"
    noname "Людину ні, але мутанта, можемо"
    rom "Але ж він іще не мутанат.."
    noname "Але може стати ним будь якої хвилини"
    "В цей момент за спиною військового з'явилась підмога, яку він викликав по рації, та всі вони наставили на мене свої автомати"
    noname "Тримай руки так щоб я їх бачив!"
    "Безвихідь кипіла у моєму мозку"
    "У мене було відчуття, що весь цей шлях був пройдений марно"
    "І схоже, що надії на порятунок вже немає"
    "Тож я змирився із таким кінцем"
    "..."
    "Стоп, це ж військові"
    "В цей момент крізь суцільну темряву безвиході промайнув промінець надії"
    olek "Панове"
    "Я підняв одну руку, аби привернути увагу"
    noname "Обидві руки так щоб я бачив"
    olek "Добре, вибачте"
    "Я підняв обидві руки на один рівень"
    olek "У мене є пропозиція, від якої вигоду отримаєти і ви і я"
    noname "І що ж мутант хоче нам запропонувати?"
    olek "Власне, себе"
    olek "Наскільки я знаю, аби отримати антидот потрібно спочатку розібратись з чим маєш справу"
    olek "Отже, пропозиція так: я залишаюсь живим, а ви і ваші вчені можете проводити надімною досліди, аби створити вакцину від вплипу газу, ну а в разі якщо я таки стану мутантом, як ви кажете, можете мене вбити"
    olek "Чи підходить вам таке?"
    noname "Взагалі ідея наче не погана, але ми не можемо приймати такі рішення самі, нам треба порадитись з начальством"
    olek "Так, звісно, я розумію"
    "Військові відійшли в сторону на кілька хвилин залишивши мене під наглядом одного з них"
    "Ці декілька хвилин тривали для мене як ціла вічність, оскільки, якщо вони не погодяться на такі умови, це фактично буде смертельний вирок"
    mil "Ти впевнений?"
    olek "Не дуже, але іншого вибору у мене немає"
    "..."
    "Нарешті військові повернулись"
    noname "Командування погоджується на твої умови, але летіти з простими людьми ти не будеш"
    "Кілька міцних парубків підійшли до мене та взяли під руки"
    noname "Ти полетиш у відсіку для в'язнів"
    olek "Добре"
    olek "А що буде з моїми компаньйонами?"
    noname "Нічого не буде, у них поки не виявлено жодних ознак мутації, тож вони полетять з усіма"
    olek "От і добре"
    olek "До зустрічі, Романе, Міла"
    rom "Чекатиму на вас пане"
    mil "Не здохни там, Олексо"
    "Мене відвели у відсік для в'язнів"
    "Там всі камери були одиночними та були розміщені на великій дистанції, напевно для того щоб через грати ніхто не бився"
    "Мене завели у камеру, яка стояла найдалі від усіх"
    "Навпроти мене було вікно"
    noname "Умови звісно не люкс, але й ти не зовсім людина"
    olek "Та людина я"
    "Пробурмотів я собі під ніс"
    "Військовий цього не почув і просто вийшов з цього відсіку"
    "За кілька миттєвостей заревіли мотори і гвинотокрил почав злітати розсікаючи хмари на своєму шляху"
    "Під нами вже виднілись наші міста, заповнені зеленим туманом"
    "Вони кищали гуманоїдами, але навіть у цю осінню пору сонце стояло в зеніті і світило яскраво"
    "Промені просвічувалися через той туман, наче прориваючись через грозові хмари"
    "Ці промені дарували надію на те, що в подальшому всі зможуть повернутись до своїх домівок"
    scene end2
    pause
    if persistent.end2 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end2 = True
    pause
    return





# Рішення не рятувати плоненого - Кінцівка 4
label Not_help_captive:
    "І все ж ми не можемо його врятувати"
    "Він буде лише заважати, та й нам не вистачить провізії на трьох"
    "Опустивши голову, я попрямував до виходу"
    olek "Пробач"
    "Шепотів я"
    olek "Пробач, але нам тоді не вижити"
    "Короткий коридор, що вів до виходу здавався безкінечним"
    "Кожен крок відчувався, як крок від людяності, але це було раціональне рішення, рішення яке вело до виживання"
    "Нарешті ми з Мілою вийшли на двір"
    "В ключниці було одназу кілька ключів схожих на ключі від машин, але лише на одному був дармовис з кнопками відкрити, тож вібір був очевидний, яка машина відкриється по натисканню на цю кнопку, така і буде нашою"
    # Звук відкривання машини (типу пік-пік)
    "Звук лунав від шикарного джипа"
    olek "Схоже доля нарешті вирішила вирішила нас винагородити"
    mil "Схоже на те"
    "Ми залишили псевдо-капітана біля його псевдо-ковчега та сіли у машину та відїхали на кілька-сот метрів від псевдо-ковчега, аби не попастись у руки розлюченого екіпажа"
    olek "Отже, поки ми ще не відїхали, давай вирішимо куди нам далі їхати?"
    olek "Більшість людей вже не вірять у існування \"Рятувального ковчега\", тож просто розїхались у різних напрямках, а ті що все ж вірять у ковчег вже напевно досить далеко"
    olek "Як ти вважаєш, чи є сенс спробувати доїхати до попереднього місця ковчега, чи все ж це буде марна витрата бензину і нам краще спробувати придумати інший план?"
    mil "Мені здається, що в тому щоб спробувати дістатись попередніх координат ковчега є сенс, чому б не спробувати?"
    mil "В будь якому випадку, краще хоча б спробувати і провалитись ніж не спробувати і бачити, як \"Рятувальний ковчег\" летить над нашими головами"
    olek "Тоді, рушили..."
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла досить спокійно, проте все відчувалось як в тумані" 
    "Через декілька днів я напевно вже і не згадаю жодної фрази, яку я почув в ночі"
    "Зараз на годиннику десята п'ятдесят, до відбуття ковчега лишилось трохи більше двох годин, а ми досі не доїхали туди"
    "Мені здалося дивним, що за весь час, з моменту, як ми виїхали з псевдо-ковчега, ми не бачили жодного гуманоїда, проте так навіть краще"
    "..."
    "В подорожі прийшла ще година"
    "На горизонті нарешті з'явився велечезний гвинтокрил, це означало, що наш шлях майже закінчений"
    "Але також в двуїста метрах від нас майоріла велечезна зграя гуманоїдів, що прямували в сторону ковчега"
    "Їх було так багато, що дивлячись на них мені ввижався велечезний живий організм, що плететься своїми волохатими лапками пожираючи дорогу перед собою"
    "Схоже нам доведеться якимось чином продертися через цей натовп, тож я піддав газу"
    olek "Тримайся, зараз буде трохи жорсткувато!"
    "Міла втислась у крісло"
    "Машина продералась крізь весь той натовп гуманоїдів"
    "Вони намагались залізти на машину, та збивали один одного"
    "Деякі з них падали під колеса, чим сповільнювали нас, проте машина все ж була досить потужна і у нас таки вийшло продертись через жах, але тепер гуманоїди прямували не на ковчег, а саме за нами"
    "Я намагався їхати максимально швидко, як тільки вмів"
    "За рахунок цього ми досить швидко прибули до ковчега"
    "Коли ми прибули до місця де вже стояло багато машин по гучномовцю до нас звернувся військовий"
    guch "Зупиніться!"
    "З неохотою я зупинився"
    olek "Але ж погоня.."
    "Тільки я подумав про це, як я почув дуже багато пострілів"
    "З верху ковчега по гуманоїдам був відкритий вогонь"
    "Через декілька секунд від їх величезної зграї не залишилось нікого живого"
    guch "Отже, панове, вітаю з прибуттям на ковчег, хотів би сказати я, але вам ще треба пройти мінне поле, останнім часом навали гуманоїдів стали більші, тож нам довелося розмістити перед ковчегом мінне поле"
    guch "Просимо вибачення, але вам доведеться пройти це.."
    olek "Я так бачу, що міни розкидано на досить великій відстані одна від одної, тож напевно проблем з проходженням не буде"
    mil "Зробімо це"
    "Ми почали проходити через мінне поле, міни були розкидані досить далеко одна від одної, тож напевно це не мало б викликати у нас проблем"
    "Так сюди.."
    "Тепер сюди.."
    "..."
    "Схоже я вже майже закінчив"
    "Тож мені сю.."
    mil "Фух, я все!"
    "Я відволікся на Мілу та не помітив куди я наступаю.."
    olek "Дідько, це що міна?"
    mil "Олексію!"
    guch "Без паніки, громадяни, тільки не відступайте, ця міна створена для того, аби ранити супротивника у спину, тож єдине, що ви маєте зробити, це не робити нічого"
    guch "Тільки не рухайтесь, ми зараз придумаємо що робити.."
    olek "Легко сказати.."
    mil "Я можу допомогти?"
    olek "Напевно ні, краще підіймайся на ковчег"
    mil "Але як я можу покинути тебе тут, ми ж пройшли весь цей шлях разом.."
    olek "Все нормально, іди.."
    mil "Добре, тільки пообіцяй мені, що все буде добре і ти підіймешся на ковчег"
    olek "Обіцяю, іди вже.."
    "..."
    guch "Пане, у нас борту не залишилось саперів, тож ми не зможемо знешкодити міну"
    guch "Зі сходу на нас рухається чимала зграя мутантів, а патрони закінчуються, нам не вистачить їх аби відбитись, тож нам необхідно терміново злітати"
    olek "..."
    guch "Ми пропонуємо вам такі рішення: перше - це примотати міну до ноги, але це не є гарантією безпеки, тож будь який непарвильни рух може призвести до детанації, і друге - лишитись на місці аби підірвати згарю мутантів"
    olek "..."
    guch "Я розумію, що це дуже важке рішення, але ви маєте прийняти його якомога швидше"
    olek "Я не стану наражати людей, що прибули на ковчег з величезними складнощами, на небезпеку підчас польоту, тож я обираю друге"
    guch "Тоді це рішення прийнято. Ми розрахуємо на вашу відвагу та будемо пам'ятати вас.."
    "Військовий віддав честь та пішов"
    olek "Дякую"
    "Прошепотів я"
    "За хвилину гвинтокрил запустив двигуни та почав здійматись у повітря"
    "Я помітив, як Міла підбігла до вікна та намагалась щось кричати, двигуни, ясна річ, що перебивали її, але я наче зрозумів, що воно кричала, що я брехун"
    "Гуманоїди наближаютья до мене не скидаючи швидкості"
    "Ось ось і вони будуть вже на місці"
    "Схоже це таки кінець.."
    "Все ж правду казали, люди приходять у цей світ самі та йдуть з нього самі"
    "В будь якому випадку, я хоча б виявився корисним суспільстку, отже не даремно жив"
    "Я радий"
    scene end4
    pause
    if persistent.end4 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end4 = True
    return





# Рішення не рятувати плоненого (Заражений) - Кінцівка 5
label Not_help_captive_kill_neighbor:
    "І все ж ми не можемо його врятувати"
    "Він буде лише заважати, та й нам не вистачить провізії на трьох"
    "Опустивши голову, я попрямував до виходу"
    olek "Пробач"
    "Шепотів я"
    olek "Пробач, але нам тоді не вижити"
    "Короткий коридор, що вів до виходу здавався безкінечним"
    "Кожен крок відчувався, як крок від людяності, але це було раціональне рішення, рішення яке вело до виживання"
    "Нарешті ми з Мілою вийшли на двір"
    "В ключниці було одназу кілька ключів схожих на ключі від машин, але лише на одному був дармовис з кнопками відкрити, тож вібір був очевидний, яка машина відкриється по натисканню на цю кнопку, така і буде нашою"
    # Звук відкривання машини (типу пік-пік)
    "Звук лунав від шикарного джипа"
    olek "Схоже доля нарешті вирішила вирішила нас винагородити"
    mil "Схоже на те"
    "Ми залишили псевдо-капітана біля його псевдо-ковчега та сіли у машину та відїхали на кілька-сот метрів від псевдо-ковчега, аби не попастись у руки розлюченого екіпажа"
    olek "Отже, поки ми ще не відїхали, давай вирішимо куди нам далі їхати?"
    olek "Більшість людей вже не вірять у існування \"Рятувального ковчега\", тож просто розїхались у різних напрямках, а ті що все ж вірять у ковчег вже напевно досить далеко"
    olek "Як ти вважаєш, чи є сенс спробувати доїхати до попереднього місця ковчега, чи все ж це буде марна витрата бензину і нам краще спробувати придумати інший план?"
    mil "Мені здається, що в тому щоб спробувати дістатись попередніх координат ковчега є сенс, чому б не спробувати?"
    mil "В будь якому випадку, краще хоча б спробувати і провалитись ніж не спробувати і бачити, як \"Рятувальний ковчег\" летить над нашими головами"
    olek "Тоді, рушили..."
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла досить спокійно, проте все відчувалось як в тумані" 
    "Через декілька днів я напевно вже і не згадаю жодної фрази, яку я почув в ночі"
    "Зараз на годиннику десята п'ятдесят, до відбуття ковчега лишилось трохи більше двох годин, а ми досі не доїхали туди"
    "Мені здалося дивним, що за весь час, з моменту, як ми виїхали з псевдо-ковчега, ми не бачили жодного гуманоїда, проте так навіть краще"
    "..."
    "В подорожі прийшла ще година"
    "На горизонті нарешті з'явився велечезний гвинтокрил, це означало, що наш шлях майже закінчений"
    "Але також в двуїста метрах від нас майоріла велечезна зграя гуманоїдів, що прямували в сторону ковчега"
    "Їх було так багато, що дивлячись на них мені ввижався велечезний живий організм, що плететься своїми волохатими лапками пожираючи дорогу перед собою"
    "Схоже нам доведеться якимось чином продертися через цей натовп, тож я піддав газу"
    olek "Тримайся, зараз буде трохи жорсткувато!"
    "Міла втислась у крісло"
    "Машина продералась крізь весь той натовп гуманоїдів"
    "Вони намагались залізти на машину, та збивали один одного"
    "Деякі з них падали під колеса, чим сповільнювали нас, проте машина все ж була досить потужна і у нас таки вийшло продертись через жах, але тепер гуманоїди прямували не на ковчег, а саме за нами"
    "Я намагався їхати максимально швидко, як тільки вмів"
    "За рахунок цього ми досить швидко прибули до ковчега"
    "Коли ми прибули до місця де вже стояло багато машин по гучномовцю до нас звернувся військовий"
    guch "Зупиніться!"
    "З неохотою я зупинився"
    olek "Але ж погоня.."
    "Тільки я подумав про це, як я почув дуже багато пострілів"
    "З верху ковчега по гуманоїдам був відкритий вогонь"
    "Через декілька секунд від їх величезної зграї не залишилось нікого живого"
    guch "Отже, панове, вітаю з прибуттям на ковчег, хотів би сказати я, але вам ще треба пройти мінне поле, останнім часом навали гуманоїдів стали більші, тож нам довелося розмістити перед ковчегом мінне поле"
    guch "Просимо вибачення, але вам доведеться пройти це.."
    olek "Я так бачу, що міни розкидано на досить великій відстані одна від одної, тож напевно проблем з проходженням не буде"
    mil "Зробімо це"
    "Ми почали проходити через мінне поле, міни були розкидані досить далеко одна від одної, тож напевно це не мало б викликати у нас проблем"
    "Так сюди.."
    "Тепер сюди.."
    "..."
    "Схоже я вже майже закінчив"
    "Тож мені сю.."
    mil "Фух, я все!"
    "Я відволікся на Мілу та не помітив куди я наступаю.."
    olek "Дідько, це що міна?"
    mil "Олексію!"
    guch "Без паніки, громадяни, тільки не відступайте, ця міна створена для того, аби ранити супротивника у спину, тож єдине, що ви маєте зробити, це не робити нічого"
    guch "Тільки не рухайтесь, ми зараз придумаємо що робити.."
    olek "Легко сказати.."
    mil "Я можу допомогти?"
    olek "Напевно ні, краще підіймайся на ковчег"
    mil "Але як я можу покинути тебе тут, ми ж пройшли весь цей шлях разом.."
    olek "Все нормально, іди.."
    mil "Добре, тільки пообіцяй мені, що все буде добре і ти підіймешся на ковчег"
    olek "Обіцяю, іди вже.."
    "..."
    guch "Пане, у нас борту не залишилось саперів, але я можу дещо спробувати"
    olek "Було б добре"
    "Військовий підійшов до мене та спробував, щось зробити"
    "Я відчув, як кашель вже підступає до горла, але я намагався стримуватись"
    "Я стримав кашель в середині, проте трохи хитнувся"
    noname "Воу-воу, хлопче, не рухайся.."
    olek "Так, вибачте"
    "Військовий ще кілька секунд щось там робив і з рештою він таки відійшов протираючи чоло"
    noname "Ось і все, можемо йти"
    olek "Дякую, ви мій герой"
    noname "Ну, така робота"
    "З посішкою сказав він"
    "Ми спокійно піднялись на борт ковчега"
    "Побачивши Мілу я рушив до неї, але раніше проковтнутий кашель все ж вирвався на зовні"
    olek "Кхе-кхе"
    "Зелений газ знову вирвався з легеней"
    noname "А ні руш"
    "Військовий дістав рацію"
    noname "Всі, швидко сюди, у нас мутант на борту!"
    mil "Який ще мутант, ви про що взагалі?"
    noname "Він відхаркує зелений газ, отже він уже в легенях і ваш компаньйон скоро може перетворитись на повноцінного мутанта"
    olek "Вибачте, а що ви плануєте зі мною робити?"
    noname "Власне, нам не потрібен ризик.. {w} Нам доведься вас прибрати"
    mil "В сенсі прибрати? Ви що з глузду з'їхали, він же їхав сюди протягом тижня, і нічого не сталось, напевно у нього маленька доза того газу і.."
    noname "Те що він їхав сюди тиждень і нічого не сталось не доводить, що нічого не станиться й на далі"
    olek "Хіба ви можете вбити невинну людину?"
    noname "Людину ні, але ви не людина"
    olek "..."
    "В цей момент за спиною військового з'явилась підмога, яку він викликав по рації, та всі вони наставили на мене свої автомати"
    noname "Тримай руки так щоб я їх бачив!"
    "Безвихідь кипіла у моєму мозку"
    "У мене було відчуття, що весь цей шлях був пройдений марно"
    "І схоже, що надії на порятунок вже немає"
    "Тож я змирився із таким кінцем"
    "..."
    "Стоп, це ж військові"
    "В цей момент крізь суцільну темряву безвиході промайнув промінець надії"
    olek "Панове"
    "Я підняв одну руку, аби привернути увагу"
    noname "Обидві руки так щоб я бачив"
    olek "Добре, вибачте"
    "Я підняв обидві руки на один рівень"
    olek "У мене є пропозиція"
    noname "І що ж мутант хоче нам запропонувати?"
    olek "Власне, себе"
    olek "Наскільки я знаю, аби отримати антидот потрібно спочатку розібратись з чим маєш справу"
    olek "Отже, пропозиція так: я залишаюсь живим, а ви і ваші вчені можете проводити надімною досліди, аби створити вакцину від вплипу газу, ну а в разі якщо я таки стану мутантом, як ви кажете, можете мене вбити"
    olek "Чи підходить вам таке?"
    noname "Ми не можемо довіряти аргументам зараженої персони.."
    mil "Я можу поручитись за нього!"
    noname "На жаль цього також мало"
    noname "Вогонь, хлопці!"
    "Під страшним шумом автоматного вогню я почув, як кулі пронизують моє тіло"
    "Біль перетворився на жар, який поширився кожною клітинкою мого буття"
    "Мої останні думки здійнялися в пітьмі, змішуючись з вогнями стріл, які перетікали у вогні великого міста"
    "Все затихло. {w} Жодного звуку. {w} Жодного дихання"
    "Тільки темрява"
    scene end5
    pause
    if persistent.end5 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end5 = True
    return





# Рішення ігнорувати відсік - Кінцівка 6
label Not_check_cell:
    "В принципі немає нічого дивного в тому, що нам щось не показали, все ж ми не команда ковчега"
    "Тому я краще не буду лізти не в своє діло і просто заберу пляшку"
    "Я потягнувся за пляшкою і з великим зусиллям забрав її"
    "Втома нікуди не ділась, тож я зробив ще кілька зупинок і врешті-решт доніс останній бутль до їдальні"
    kok "О, ти вже впорався?"
    olek "Ну так"
    kok "Дякую тобі, хлопче, без тебе у нас би не вистачило часу"
    "Весь фартук кока був заляпаний кров'ю, тож я запитав"
    olek "Ви готуєте щось велике?"
    kok "Ну не сказати, що щось прям велике.. Це щось між куркою, та буком, тобі сподобається"
    olek "Тоді не буду вас відволікати, до побачення"
    kok "Бувай, хлопче"
    "Після цього день був дуже нудним"
    "Фактично я нічого не робив, тільки двічі сходив до їдальні на обід та вечерю і все"
    "Туман перешкоджав потраплянню будь якого сигналу, тож нічого не працювало і єдиною розвагою на весь день стало тинятись ковчегом"
    "Всі приміщення виглядали абсолютно однаково, тож це теж швидко набридло тому весь день я провів у себе в каюті постійно то засинаючи на кілька хвилин то прокидаючись"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ось і настав день відправлення"
    "Сьогодні все це закінчиться"
    "Але якось дивно, що нас досі не кличуть на сніданок, хоча на годиннику вже дев'ята"
    "Хоча, можливо це через те що сьогодні відправлення"
    "Ну добре, тоді піду прогуляюсь трохи"
    "Я вийшов з каюти та побачив Мілу"
    olek "Добрий ранок, ти вже не спиш?"
    mil "Добрий, та як бачиш"
    "Вона виглядала явно стурбованою"
    olek "Щось не так? Ти виглядаєш якось дивно"
    mil "А, так, все добре, просто сон якийсь дивний"
    olek "Як ще сон?"
    mil "Та таке.. Мені наснилось, що все це місце не справжнє, і замість того аби нести нас на евакуацію воно полетіло на схід, до мене додому"
    olek "Отакої, виходить не я один якусь дичину у снах бачу"
    mil "Напевно, що так.."
    mil "..."
    olek "Слухй, а ти не хочеш трохи пройтись ковчегом, за одно може будемо десь біля їдальні то може спитаємо, коли сніданок"
    mil "Ну пішли"
    "..."
    "Уже пройшла майже година, а жодних повідомлень досі не було"
    "З кают повиходило не так багато людей, напевно десь чоловік десять, ну не більше"
    "Щось це все дивно..."
    "Почувся звук удару чогось металевого об підлогу"
    "Я озирнувся і побачив, що всі каюти закрились решітками, через що вони стали більше схожі не на каюти, а на клітки"
    olek "Що це все значить?"
    "Ніби у відповідь мені почалося повідомлення"
    guch "Добрий ранок, гості кочєга, до вас обращається капітан судна Владімєр Соколов"
    guch "На жаль для вас, ми обдурили всєх присутніх і заманілі вас всіх на це судно не для порятунку, а для пополненія нашого запасу м'яса"
    guch "Фактично це даже не судно, а лише часний дом, який ми стилізували під \"Рятувальний ковчег\" аби заманіть вас сюда"
    guch "Ужасно, чи не так? Но самий жах ви дізнаєтесь зараз"
    guch "Мости, які раніше з'єднували ваші поселення, були підірвані нами. Ми залишили вам лише один маршрут, что би кожен дрон, що пролітає, міг повідомляти про переміщення \"Рятувального ковчега\", який насправді нікуди не переміщувався, справжній ковчег так само ждьот людей у Рівному"
    guch "Як ви думаєте, чому тут до вас ставились так добре? Звісно ж тому що відкормлені свині найсмачніші"
    guch "Ви спросітє нащо я це розказую? Тільки тому що люді мають право знати правду, хотя би перед смертю"
    guch "І так, уважаємиє гості, на цьому ми повинні простягнути вам останній привіт. А команді ковчега, бажаємо смачного"
    "Повідомлення затихло, а з кают почувся звук випуску якогось газу"
    "За декілька секунд люди в каютах почали непритомніти"
    mil "Не вірю своїм вухам, як таке може бути правдою?.."
    olek "Як бачиш, може.."
    "Команда псевдо-ковчега почала сходитись до головного відсіку"
    vla "Якого чорта, вони не в своїх каютах?"
    noname "Без поняття, пане"
    vla "Ну що, шкєт, теперь ти все знаєш.. і що будеш робити?"
    olek "Звільню всіх людей, але перд цим вб'ю тебе та твоїх клятих посіпак"
    vla "Какая гучна за'ява, а отвєтіть за неї зможеш?"
    olek "Головне, щоб ви відповіли за свої злочини"
    vla "Пф, не сміши.. У нас тут кінець світу, якщо ти не помітив, всім давно все одно, верхівка влади думає лише, як врятувати себе, на вас ім глибоко насрать"
    olek "Зате нам не насрать на долю цих людей"
    "Ті десять людей, які вийшли з кают раніше стали за моєю спиною, ніби ми в месниках"
    vla "Ну й нехай.. Розберіться з ними, парні"
    noname "Так, пане!"
    "Капітан розвернувся та пішов до командного центра"
    olek "Тікаєш, падло?!"
    "У відповідь нічого не прозвучало"
    "Команда ковчега була не маленька, тож кількісна перевага була очевидна всім, але навіть так здаватись ніхто не збирався"
    olek "Прикрийте мене!"
    "Чоловіки, що стояли за мною явно вирішили боротись до кінця, тож вони без зайвих сумнівів кинулись у бій"
    "Я ж рухався вперед, вдихаючи запах пороху та трохи диму, який залишався у повітрі після кожного пострілу"
    "Ненависть і вир увійшли в моє серце, даруючи моїй руці силу та мету"
    "Команда ковчега виявилася добре підготовленою і зловісною" 
    "Їхні обличчя були спокійними, майже без вияву емоцій"
    "Кожен постріл, кожен удар був відповіддю на зраду, болючу втрату і нікчемне життя, які вони призвели на нас"
    "Хвилі адреналіну накачували мої вени, підсилюючи будь який рух або рефлекс, але також він підсилював і біль від влучання в руки чи ноги"
    "Але у мене немає часу щоб піддавався, тож я не зупинявся"
    "Мета була проста - зупинити їх, звільнити тих, кого вони тримали у полоні" 
    "Кожен вражений ворог був кроком ближче до розкриття їхніх злочинів і правосуддя"
    "Кров тече по коридорах, фарбуючи білі стіни в червоний колір" 
    "Життя гасло, але не безплідно" 
    "Кожна жертва вартувала кожну секунду смерті, яка насувається над нами"
    "Нарешті мій погляд зустрівся зі злісними очима капітана ковчега"
    "Він напевно не чекав, що я спробую дістатись до нього, але він не розгубився"
    "Капітан швидко засунув руку в піджак та майже миттєво дістав пістолет"
    vla "Я визнаю, ти бил дуже інтересним, но час і тобі баю-бай"
    # Звук стрільби
    "..."
    "Куля прогризлась крізь мою грудну клітину, а біль проколов моє тіло, світло в очах почало згасати"
    "Невже це так і виглядає кінець?"
    "Я знаходився на межі світу життя і смерті, але моя воля залишалась непохитною"
    "Через мої останні подихи, я поклав свою надію на команду, яка залишалася позаду"
    "З деякими з них я побачусь дуже швидко.."
    "Але найголовніше, що незважаючи на мою загибель, або загибель їх друзів, боротьба не закінчується"
    "Вогонь боротьби досі палає в серцях інших, а отже у них все ще є шанс на свободу"
    "Оскільки свобода - це те що тоді дають в руки, свобода - це те що ти нікому не віддаси"
    scene end6
    pause
    if persistent.end6 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end6 = True
    return





# Рішення ігнорувати відсік (Заражений) - Кінцівка 7
label Not_check_cell_kill_neighbor:
    "В принципі немає нічого дивного в тому, що нам щось не показали, все ж ми не команда ковчега"
    "Тому я краще не буду лізти не в своє діло і просто заберу пляшку"
    "Я потягнувся за пляшкою і з великим зусиллям забрав її"
    "Втома нікуди не ділась, тож я зробив ще кілька зупинок і врешті-решт доніс останній бутль до їдальні"
    kok "О, ти вже впорався?"
    olek "Ну так"
    kok "Дякую тобі, хлопче, без тебе у нас би не вистачило часу"
    "Весь фартук кока був заляпаний кров'ю, тож я запитав"
    olek "Ви готуєте щось велике?"
    kok "Ну не сказати, що щось прям велике.. Це щось між куркою, та буком, тобі сподобається"
    olek "Тоді не буду вас відволікати, до побачення"
    kok "Бувай, хлопче"
    "Після цього день був дуже нудним"
    "Фактично я нічого не робив, тільки двічі сходив до їдальні на обід та вечерю і все"
    "Туман перешкоджав потраплянню будь якого сигналу, тож нічого не працювало і єдиною розвагою на весь день стало тинятись ковчегом"
    "Всі приміщення виглядали абсолютно однаково, тож це теж швидко набридло тому весь день я провів у себе в каюті постійно то засинаючи на кілька хвилин то прокидаючись"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ось і настав день відправлення"
    "Сьогодні все це закінчиться"
    "Але якось дивно, що нас досі не кличуть на сніданок, хоча на годиннику вже дев'ята"
    "Хоча, можливо це через те що сьогодні відправлення"
    "Ну добре, тоді піду прогуляюсь трохи"
    "Я вийшов з каюти та побачив Мілу"
    olek "Добрий ранок, ти вже не спиш?"
    mil "Добрий, та як бачиш"
    "Вона виглядала явно стурбованою"
    olek "Щось не так? Ти виглядаєш якось дивно"
    mil "А, так, все добре, просто сон якийсь дивний"
    olek "Як ще сон?"
    mil "Та таке.. Мені наснилось, що все це місце не справжнє, і замість того аби нести нас на евакуацію воно полетіло на схід, до мене додому"
    olek "Отакої, виходить не я один якусь дичину у снах бачу"
    mil "Напевно, що так.."
    mil "..."
    olek "Слухй, а ти не хочеш трохи пройтись ковчегом, за одно може будемо десь біля їдальні то може спитаємо, коли сніданок"
    mil "Ну пішли"
    "..."
    "Уже пройшла майже година, а жодних повідомлень досі не було"
    "З кают повиходило не так багато людей, напевно десь чоловік десять, ну не більше"
    "Щось це все дивно..."
    "Почувся звук удару чогось металевого об підлогу"
    "Я озирнувся і побачив, що всі каюти закрились решітками, через що вони стали більше схожі не на каюти, а на клітки"
    olek "Що це все значить?"
    "Ніби у відповідь мені почалося повідомлення"
    guch "Добрий ранок, гості кочєга, до вас обращається капітан судна Владімєр Соколов"
    guch "На жаль для вас, ми обдурили всєх присутніх і заманілі вас всіх на це судно не для порятунку, а для пополненія нашого запасу м'яса"
    guch "Фактично це даже не судно, а лише часний дом, який ми стилізували під \"Рятувальний ковчег\" аби заманіть вас сюда"
    guch "Ужасно, чи не так? Но самий жах ви дізнаєтесь зараз"
    guch "Мости, які раніше з'єднували ваші поселення, були підірвані нами. Ми залишили вам лише один маршрут, что би кожен дрон, що пролітає, міг повідомляти про переміщення \"Рятувального ковчега\", який насправді нікуди не переміщувався, справжній ковчег так само ждьот людей у Рівному"
    guch "Як ви думаєте, чому тут до вас ставились так добре? Звісно ж тому що відкормлені свині найсмачніші"
    guch "Ви спросітє нащо я це розказую? Тільки тому що люді мають право знати правду, хотя би перед смертю"
    guch "І так, уважаємиє гості, на цьому ми повинні простягнути вам останній привіт. А команді ковчега, бажаємо смачного"
    "Повідомлення затихло, а з кают почувся звук випуску якогось газу"
    "За декілька секунд люди в каютах почали непритомніти"
    mil "Не вірю своїм вухам, як таке може бути правдою?.."
    olek "Як бачиш, може.."
    olek "Кхе-кхе"
    "Зараз відкашлювання стало реально болючим тож я зігнувся майже вдвоє"
    mil "З тобою все гаразд?"
    olek "Щось зараз не дуже.."
    mil "Невже ти все ж заразився тоді.."
    olek "Можливо.."
    "Команда псевдо-ковчега почала сходитись до головного відсіку"
    olek "Ти напевно тікай, краще, щось я відчуваю, що зараз щось має статись"
    mil "Ні, я тебе не покину"
    olek "Я сказав тікай!"
    "Вже через біль крикнув я"
    vla "Опа, а якого це чорта, вони не в своїх каютах?"
    noname "Не знаю, пане"
    vla "Ну що, шкєт, теперь ти все знаєш.. і що будеш робити?"
    $ olek = Character("Олексій", color="#009900")
    olek "Аааа!"
    vla "Що, не можеш змиритись з поразкою, а шкєт?"
    "З рештою моє тіло просто впало"
    vla "Цей схоже вмер, розберіться із залишившимися.."
    noname "Так, пане"
    "Моє тіло непокірне, неслухняне. Схоже я більше не має влади над ним..."
    "Темрява починає покривати все навколо..."
    "Чи саме такими почуваються ті, хто перетворюється на гуманоїдів...?"
    "..."
    "Запах крові доноситься до мене. {w} Це мене захоплює... захоплює повністю"
    "Звуки тихі, далекі... Схоже, вони вже не досяжні"
    "Мабуть, останні людські відчуття зникають..."
    "Але в мене з'являється непереборна жага калічити й вбивати, і, що найдивніше, мені це подобається"
    "О, цей шматок крові та м'яса схожий на капітана"
    "Я хочу вбити його.."
    olek "Вбий... {w} Вбий... {w} Вбий!"
    # Звук стрільби
    scene end7
    pause
    if persistent.end7 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end7 = True
    return





# Рішення не дозаправлятись
label Not_refuel:
    "Все ж якщо ми втратимо зараз час на заправимось нам може не вистачити бензину, щоб доїхати, а що нам той бензин, якщо ми не встигнемо"
    "Найближча заправка має бути за декілька кілометрів звідси, тому це точно забере чимало часу, їхати туди просто недоцільно"
    olek "Вирушаємо зараз, неможна втрачати ні хвилини"
    mil "Добре, поїхали"
    window hide
    scene bg clock_10 with fade
    pause(1.0)
    scene bg clock_12 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Ми їдемо вже дві години, більша частина міста вже позаду" 
    "А отже нам лишився останній рубіж"
    "Найважчий рубіж"
    "Потрібно проїхати колись найбільш заселений район міста"
    "Він точно заповнений гуманоїдами, як в будівлях так і на вулицях"
    "Тож їхати треба обережно, не привертаючи зайвої уваги"
    "Не видаючи жодних звуків"
    "Щоб зменшити шуми від машини я заглушив двигун, перед цим набравши швидкість якої б мало вистачити, щоб виїхати з цього району за інерцією"
    "Колеса ледве крутяться та машина все ж рухалась до виїзду"
    "Ось уже і видно табличку з перекресленою назвою міста"
    "Залишилось ще трохи і ми з Мілою будемо у відносній безпеці"
    "Давай..."
    "Ще трохи..."
    "..."
    "По машині щось вдарило ззаду"
    "У дзеркалі заднього виду не було нічого"
    olek "Це напевно якась гілка"
    "Пошепки сказав я, не так для Міли, як для того щоб заспокоїти себе"
    mil "Угу"
    "..."
    # Гучний звук
    "Ззаду машини стояв гуманоїд, який нахабно тримав задні двері у руках"
    gumanoid "Гарррр!"
    "Гуманоїд прокричав так ніби кличе інших долучитись до розбору нашого авто"
    "І схоже його родичі не були проти"
    "З усіх будівель р'ясним дощем почали випадати гуманоїди"
    "Всі вони явно націлились на нас і вже мчали навипередки, аби поласувати нами"
    olek "Що за чортівня?!"
    "Треба швидко заводитись!"
    "Ключ знову, як на зло заклинило"
    "Нужбо... Нужбо..."
    "Двигун нарешті заревів"
    mil "Що? Що ж робити?"
    "Тепер думай, що далі"
    "Думай..."
    "Точно!"
    olek "Стріляй в каністру!"
    mil "Що?"
    olek "Стріляй в каністру, кажу!"
    "Вона стояла як раз навпроти дверей які вирвав гуманоїд"
    "Я швидко перерізав мотузку, якою перемотував бензобак, аби його не трясло по дорозі"
    "Каністра стрімко вилетіла з машини та впала перед натовпом монстрів, розплескавши деяку частину бензину по землі"
    olek "Зараз!"
    "Міла випустила кілька куль у каністру і бензин в середині неї миттєво спалахнув, утворивши деякий бар'єр з вогню"
    "Деякі гуманоїди намагались пройти через вогонь, проте підпаливши свої кінцівки вони зупинились"
    "Схоже вони зрозуміли, що вже не зможуть нас наздогнати, тож кинули нам в слід лише крик"
    "Крик, який звучав навіть не позвірячому, скоріше за все так звучали ті монстри під ліжком з дитинства, а їх силуєти підсилені вогнем лише підкріпляло це відчуття"
    "..."
    olek "Фухх..."
    olek "Вийшло..."
    mil "..."
    olek "Вітаю, ми за містом"
    window hide
    scene day_4 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#d2ead1")
    pause(1.5)
    scene bg bg with fade
    window show
    "Для мене ніч була довга, я весь час мав бути сконцентрований на дорозі і на педалях"
    "Оскільки я давно не седів за кермом, а тим паче ніколи довго не їздив, це було для мене дуже тяжко"
    "А от Міла заснула майже одразу після того як зайшло сонце, тож їхав я в суцільній тищі, лише десь вдалені було чутно цвіркунів, які ще не зрозуміли, що настала осінь"
    "Так же швидко, як і заснула, Міла прокинулась з першими промінцями сонця і почала вимагати їжу"
    mil "Ну зупинись, давай поїмо"
    "Повторювала вона, лише змінюючи інтонацію"
    olek "Та, почекай! Я то в принципі і не проти поснідати, але як бачиш тут нема де з'їхати, ми не можемо зупинитись посеред дороги, це ж трасса"
    mil "Яка кому різниця? Ти часом не забув, що у нас тут майже зомбіапокаліпсис, забий на ті правила і давай зупиняйся"
    olek "Ні! Ми маємо дотримуватись правил, бо якщо не будемо робити цього, що нас буде відрізняти від гуманоїдів?"
    mil "Ой, бач, який правильний.."
    "Сказавши це вона надула щоки та втупилась у вікно"
    "..."
    mil "Пригальмуй"
    olek "Я ж вже казав, що ми не будемо тут зупинятись"
    mil "Та я не через їжу, дивись"
    "Вона показувала пальцем у вікно"
    "Придивившись я помітив, як за парканом, що розмежовував дорогу, гуманоїди зібрались в коло та спостерігали за тим як один з них крутився і кричав"
    "Деякі з них виглядали, як сім'ї, вони тримались як омога ближче один до одного, але якщо до них намагався підійти хтось зайвий, вони швидко з'їдали його"
    "Уся ця сцена нагадувала, якесь первинне суспільство"
    "Воно мене заворижило своєю незвичністю, і в той же час лякало подібністю на людей"
    "Захопившись спостереженням я пригальмував і колодки видали пронизливий скрип"
    "В мить гуманоїди розвернулись на нас, декілька секунд уважно роздивлялись, а потім повернулись назад і продовжили це дійство"
    "Щоб не давати їм зайвих приводів на атаку, я притис педаль і ми рушили швидше"
    mil "І що це тільки що було?"
    olek "Схоже це їх спосіб співіснування, таке собі суспільство мутантів"
    mil "Це ж фактично зомбі, хіба вони не мають бути тупими?"
    olek "А хто тобі сказав, що зомбі обов'язково тупі?"
    olek "Тим паче, що ці істоти явно розумніші ніж зомбі з фільмів"
    olek "Можливо вони не такі розумні, як люди, проте все ж не тупіші за мавп"
    mil "А мені вони більше на алкоголіків схожі"
    olek "Ну може і так.." 
    "Після цього обговорення ми їхали в тиші"
    "Заїхавши на пагорб ми побачили місто з якого тікали"
    "Там був з'їзд з дороги, тож ми зупинились, аби нарешті поснідати"
    "Діставши з рякзака якісь булочки я підняв очі на каєвид Києва, який відкривався з цього пагорба"
    "Київ був, як на долоні"
    "Колись найприємніше для мене місто було завішане зеленим туманом, який робив із, і так не завжди приємних людей гуманоїдів, котрі намагаються мене з'їсти"
    "Але все ж який Київ гарний, звідси його видно майже повністю, від районів у яких протікала моя спокійна юність до Майдану та ..."
    olek "Сподіваюсь, що колись зможу повернутись до тебе"
    "Прошепотів я"
    mil "Ти щось сказав?"
    olek "Та ні не звертай уваги, просто цей вид навіює спогади"
    mil "А ти виріс у Києві?"
    olek "Ну так, а ти хіба ні?"
    mil "Та ні, я приїхала з Донечини на навчання, а потім якось тут і залишилась"
    olek "Он воно як.."
    olek "То ти виходить панаєхало?"
    "З усмішкою сказав я"
    mil "Ага, щось типу того.."
    "Холодно відповіла Міла"
    "Ми вже поїли, тож аби не витрачати час знову сіли в машину та рушили"
    olek "Слухай, а твої родичі там зараз?"
    mil "Напевно, я чесно кажучи давно з ними не бачилась, тільки по телефону і говоримо, а зараз, як знаєш зв'язку нема"
    olek "..."
    olek "А коли ситуація з цим усім стане легше, плануєш повертатись?"
    mil "Куди?"
    olek "Ну додому, на Донеччину"
    mil "Не знаю, та й чи є у цьому сенс?"
    mil "Все ж, якщо евакуація оголошена саме на захід, то на сході напевно теж все не та райдужно"
    olek "Про що ти?"
    mil "Ну там же теж напевно гуманоїди є.."
    olek "І що?"
    mil "А те що я не хочу бачити, що мої найдорожчі люди стали такими, тому я напевно туди вже ніколи не поїду, поки точно не буду знати, що вони не мутанти"
    olek "Ясно.."
    mil "А твої родичі, де вони?"
    olek "Чесно кажучи не знаю, вони наче мали їхати на відпочинок зараз, але.."
    olek "..."
    olek "В будь якому випадку я планую знайти їх, коли ситуація з цим тумано хоч трохи стане легше"
    mil "Удачі.."
    olek "..."
    olek "Доречі, ти ж сказала, що приїхала на навчання і потім залишилась, а ким ти була до цього всього?"
    mil "Та так, фітнес інструкторм"
    olek "А на нього ще й вчать?"
    mil "Ні, я поступала на лікаря, як і казали батьки, але на другому курсі зрозуміла, що це не моє. Зрештою я влаштувалась у кав'ярню офіціанткою, а на останні гроші я записалась у фітнес центр де мене помітили та запропонували бути інструктором"
    mil "Останні пів року я, можна сказати, працювала на двох роботах"
    olek "Ого, я б так не зміг"
    mil "А ти десь працював?"
    olek "Ну якщо це можна назвати роботою.."
    olek "Я був охоронцем на заводі"
    olek "В принципі нічого там ніколи не відбувалось, тож я постійно просто дивився у вікно"
    mil "Ясно"
    "Після цієї маленької ромови в машині знову запанувала тиша"
    if is_kill_neighbor == True:
        olek "Кхе-кхе"
        mil "З тобою все нормально?"
        olek "Так-так, просто кашель"
        mil "Щось не схоже.."
        mil "Ще й зелений димок при відкашлюванні, ти часом не заражений?"
        olek "Та звісно ні, я весь час був у імпровізованому протигазі, або в масці"
        olek "..."
        olek "Хіба що при моїй першій сутичці міг надихатись"
        olek "Хоча, я думаю все нормально, то я вже себе накручую, не переймайся"
        mil "Ну дивись, якщо що знай, що тебе жаліти я не буду"
        olek "А то ти мене і так жалієш"
        "Пробурмотів я собі під ніс"
    # Годинник міняє час з 12 на 20:30
    window hide
    scene bg clock_12 with fade
    pause(1.0)
    scene bg clock_20_30 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Все ж таки, їхати двоє суток поспіль дуже вимотуюче заняття, напевно треба зробити маленький відпочинок"
    # Очі закриваються поступово за декілька кадрів
    "Але де?.."
    # Темний екран
    "..."
    # Гучний звук сповішення
    "Що це..?"
    "Озираючись навкруги я помітив маленький дрон у небі"
    define guch = Character("Гучномовець", color="#FFFFFF")
    guch "Увага! Увага!"
    guch "Координати \"Рятувального ковчега\" були змінені та пересунені на схід. Тепер ковчег буде чекати на всіх у місті Плоскирів"
    guch "Повторюю, координати \"Рятувального ковчега\" були змінені та пересунені на схід. Тепер ковчег буде чекати на всіх у місті Плоскирів"
    "Схоже Міла прокинулась"
    mil "Вибач, про що там було? Я не дуже розібрала за сном"
    olek "Сказали, що переносять місце знаходження ковчега"
    mil "І куди?"
    olek "У Плоскирів"
    mil "Оце добре! Наскільки я пам'ятаю тут близько"
    mil "Отже будемо на місці уже завтра вдень"
    olek "Ну так то воно так, але тобі не здається це дивним?"
    mil "Ні, а що саме?"
    olek "Те що вони переносять зазначене раніше місце збору на ковчег"
    olek "Це ж тобі не просто пересунути, якийсь ларьок на кілька метрів, це переніс велечезного гвинтокрила, який служить для евакуації людей, та повідомити про це лише через дрон з гучномовцем"
    olek "Якось не викликає довіри.."
    mil "Та ну тебе, вони, напевно, змістили його, аби людям було легше дістатись до місця евакуації, до того ж зв'язку нема, як і радіо, тож де ти збирався почути про це?"
    olek "Може ти і права, але ж.."
    mil "Я відчуваю, що все буде добре, тож довірся мені, як я довірилась тобі"
    olek "..."
    olek "Добре..."
    window hide
    scene day_5 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#bedcbe")
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла спокійно"
    "Через те що я вже відключався за кермом я зрозумів, що мені точно потрібно відпочити, і як тільки випала така можливість я спрямував машину на лісову доріжку, аби нас було важче помітити"
    "Ми з Мілою домовились переночувати там змінюючись на вахті"
    "Я проспав приблизно 4 години, проте цього мені цілком вистачило, аби відновитись та бути бадьорим увесь день"
    "На данний момент ми їхали вже декілька годин і ось-ось мали вже прибути до нового місця \"ковчега\""
    "Його вже навіть видно на горизонті"
    "Хоча дивно якось, за чутками там мав бути просто неймовірно великий гелікоптер, який зміг би за один раз евакуювати, може не область, проте район, точно"
    "А цей якийссь малий..."
    "Якось це все підозріло..."
    "Хоча можливо він маленький тільки тому, що ми ще до нього не доїхали?"
    window hide
    scene bg clock_10 with fade
    pause(1.0)
    scene bg clock_12 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Час пролетів досить швидко і ми майже підїхали до Плоскиріва"
    "На моє здивування там вже стояло чимало машин схоже багато людей таки змогли вижити у тому жахітті"
    "Гвинтокрил, який стояв на в'їзді в місто, був, хоч і не таким великим як про нього розповідали у мережі, проте достатнь виликим, аби врятувати всіх хто вже прибув туди"
    "Коли ми підїхали до місця де вже стояли інші автівки до нас вийшов чоловік років п'ятидесяти"
    "Він був досить високий, у формі схожій на щось між воєнною та діловою, на ньому були окуляри та кашкет, а під носом у нього виднілися розкішні вуса, одним словом він був статний"
    $ vla = Character("???", color="#FFFFFF")
    vla "Драстє, вітаю вас на ковчєгє"
    vla "Я капітан цього судна Владімєр Соколов, а ким ви будете, новопрєбившиє?"
    $ vla = Character("Владімєр", color="#FFFFFF")
    olek "Я Олексій"
    mil "А я Міла"
    vla "О, ви у нас тут пєрва парочка, добре хоч буде кому страну розбудовувать, коли все закончиться"
    vla "Хахаха!"
    mil "Ми взагалі то не парочка.."
    "Пробурмотіла під ніс Міла"
    vla "Пардоньтє, просто ви єдині кто тут вдвох приїхали, так всі по одинці, багато хто не вижив, самі понімаєте"
    vla "..."
    olek "А де ті що приїхали?"
    vla "А я вам как раз зараз все і покажу"
    vla "Пойдьомтє-пойдьомтє"
    "Ми з Мілою вийшли з машини та попрямували за капітаном ковчега"
    "Не зважаючи на його дивний говір, він здавався досить позитивним та надійний, принаймні мені хотілося у це вірити"
    "Владімєр відвів нас в середину ковчега, там вже було чимало людей і нарешті побачивши їх мої сумніви, що до цього місця, як рукою зняло"
    vla "Ось тут у нас главний відсік, в ньом знаходяться усі кто прибув на ковчег та їх каюти"
    vla "Якщо пройти дальше, в глиб судна, можна буде побачити їдальню та командний пункт в якому какраз живе ваш покорий слуга"
    vla "Якщо вам буде щось інтєрєсно мої хлопці проведуть вам екскурсію"
    jump Menu_excursion
    return
# Рішення перевірити підозрілий відсік (Без бензину)
label Check_cell_no_refuel:
    "В принципі немає нічого дивного в тому, що нам щось не показали, все ж ми не команда ковчега"
    "Проте саме це місце викликає у мене багато сумнівів"
    "Можливо я таки не помилявся, коли сумнівався у правдивості переносу"
    "Все ж мені треба перевірити цей відсік, щоб я був повністю спокійний та міг довіритись команді ковчега"
    "Тож, включивши ліхтарик на телефоні, я заходжу"
    "..."
    "Світла ліхтарик давав дуже мало"
    "В кімнаті смерділо протсо нестрепно"
    "Температура тут досить низька, можливо це якийсь відсік для зберігання їжі"
    "Це ж звичайна практика тримати їжу у холодильнику, я сотні разів бачив такі на ринках, тож чому б такого холодильника не могло бути тут"
    "У спробах заспокоїтись думав я, але щось таки не давало мені спокою"
    "Я вирішив, що пройдусь до іншого кінця кімнати, аби все ж бути впевненим"
    "Ліхарик світить дуже слабко, напевно щоб побачити хоч щось мені треба буде впертись у це носом"
    "Не встиг я це подумати, як на світло все ж потрапив, якийсь об'єкт"
    "Підійшовши ближче у незрозумілому силуєті мені вдалось розгледіти..." 
    "Людську руку?.."
    "Ні, це точно не могла бути вона, це напевно світло, якось неправильно падало"
    "Це ж не може бути рука, правда?.."
    "У цей момент увімкнулось світло"
    "Я швидко сховався за одним із стендів"
    "Озираючись я намагався знайти тіні, або відображення у плитці, аби зрозуміти хто це йде, проте поки я шукав хоч якісь зачіпки на те хто це може бути я встиг роздивитись усе що було у тій кімнаті"
    "Навколо висіли пошматовані тіла людей, вони були у такому ж стані, як худоба у м'ясних відділах ринків"
    "Я намагався себе переконати, що мені все це мариться, але кожен раз коли я підіймав погляд, людські частини тіл вривались мені в очі"
    "Невже, це місце не є місцем порятунку?"
    "Мої думки перервав грубий голос, що лунав зі сторони дверей"
    kok "Шо цей довбень так довго носить ті бутлі"
    noname "Та, яка різниця, забий на нього"
    "Голоси невпинно наближались"
    kok "Ну так то воно так, але з чого мені робити юшку"
    "У кількох метрах від мене почувся брязкіт ланцюгів"
    noname "Та нічого, встигниш ще, вони все одно звідси не планують валити, ми ж типу рятуємо їх"
    kok "..."
    kok "Як ти думаєш, з чого краще робити бульйон, з ноги чи все ж з руку?"
    noname "Навіть незнаю..."
    noname "Ну дивлячись на цього товстуна, думаю краще все ж з ноги, ще й м'ясо в суп буде"
    kok "Напевно ти правий..."
    "В кімнаті пролунав хрускіт кісток"
    kok "Дідько, міцна кістка"
    "Звук повторився"
    kok "О, от так би одразу.."
    kok "Ну добре, хапай це та тягни на кухню"
    noname "Слухаюсь, пане"
    "Тіні почали прямувати до виходу"
    "Світло знову вимкнулось"
    "Тепер я вже ні в чому не сумнівався..."
    "Ніякого переносу ковчега не було, нас всіх просто заманили в пастку, ніхто навіть не думав нас рятувати, все це створено лише для того аби з'їсти нас"
    "Тож єдиний висновок, який у мене є це те що команда цього псевдоковчега - канібали, а ми тут для поповнення їх запасів"
    "Я недозволю цього!"
    "Ми боролись за виживання з гуманоїдами, що перевершують людину в усіх показниках, отже зможемо поборотись і з людьми"
    "Я маю попередити всіх та вшиватись звідси"
    "Для цього мені треба відіграти дурника, який ні про що не здогадується, аби проникнути у командний пункт і звільнити всіх"
    "..."
    "Я швидко виліз з таємничого відсіку захопивши з собою бутль"
    "Після того, що я побачив, я навіть не помітив, який важкий бутль та даніс його досить швидко"
    kok "О, дякую, друже"
    kok "Не сильно ухекався?"
    "З усмішкою сказав кок"
    olek "Чесно кажучи так, але я вже встиг відпочити"
    kok "Ясно, ну от і добре, тоді чекатиму всіх на обід"
    "Як двозначно звучить ця фраза від канібала..."
    olek "Так, я теж буду з нетерпінням чекати, до побачення"
    kok "Бувай"
    "Тепер треба знати Мілу, та забиратись звідси.."
    "Вона скоріш за все сидить у своїй каюті"
    "Отже заберу її та ми разом поїдемо звідси"
    "..."
    "Вона все ж таки була у себе в каюті"
    olek "Міла, мені поьрібна твоя допомога"
    mil "Що вже сталось?"
    "Я зайшов до її каюти та закрив двері"
    olek "Отже, розклад такий, після сніданку капітан запряг мене носити бутлі, пам'ятаєш?"
    mil "Ну так.. і що..."
    olek "Так ось, коли я ніс останній бутль я випадково впустив його та зробив дірку в стіні"
    mil "Тільки не проси мене допомагати латати її"
    olek "Та ні, я не за це.."
    olek "Простір за стіною здався мені підозрілим, тож я вирішив перевірити його..."
    mil "ну не тягни, розповідай уже.."
    olek "В цілому, я довідався, що це місце ніякий не ковчег, а так звана команда насправді канібали"
    mil "Що? Як це може бути правдою?"
    olek "Не знаю, але я власними очима бачив той відсік де вони зберігають людські тіла"
    olek "Тож у нас є не багато часу, поки вони не помітили дірку в стіні, аби врятувати людей, та врятуватись самим"
    mil "І який план?"
    olek "Нам треба пробратись у командний пункт та запустити оголошення про істиний сенс цього місця після чого ми будемо тікати через чорних хід в командному пункті"
    mil "Добре, тоді пішли..."
    "Ми вийшли з каюти забравши тільки те що можна убло просто нести, щоб не здаватись підозрілими"
    "Шлях до командного центру досить короткий, проте зараз він тягнеться цілу вічність"
    "Я відчуваю кожен крок, кожну секунду, кожен удар серця"
    "В цей момент в голові лишилась лише одна думка: \"Хоч би я не помилився...\""
    "Проте це не має мене відволікати від цілі"
    "Ось уже і видно командний центр, а отже у мене лишилась одна мить аби зібратись"
    noname "Стійте, а ви куди?"
    olek "До капітана, він просив зайти"
    noname "Дивно, він же пішов тільки що.."
    olek "Напевно забув..."
    olek "Може ми його всередині почекаємо?"
    noname "Ні, чекайте тут"
    olek "Ну, добре, почекаємо"
    "Ми з Мілою стали біля охоронця в очікуванні капітана"
    "Звісно ж капітан нам тут не потрібен, він буде лише заважати, до того ж довго чекати ми не можемо"
    "І що ж робити?.."
    "..."
    # Звук удару по шолому
    "Раптом охоронець почав падати"
    olek "Це що, божа допомога?"
    mil "Ну, якщо ти вважаєш мене богинею, то так.."
    "Міла стояла з іншого боку охоронця тримаючи пістолет в руках, напевно вона оглушила його ударом в голову"
    mil "Ну, чого стоїш? Пішли всередину"
    "Міла прочинила двері, а я затягнув туди тіло охоронця"
    mil "Отже, як будемо пускати сповіщення?"
    olek "Через гучномовець"
    olek "Тільки ще б зрозуміти, яка кнопка відповідає за нього"
    mil "А хіба не ця?"
    "Міла вказала на маленьку червону кнопку по середині пульта керування"
    mil "Здається нам про неї розповідали підчас екскурсії"
    "Звичайно, як зазвичай кругла червона кнопка вирішує все.. ну і добре"
    olek "Так, здається вона"
    # Звук сповіщення
    "Я натиснув на кнопку та почув гучний сигнал сповіщення"
    guch "Шановні пасажири ковчега, до вас звертається новий капітан судна, Олексій"
    guch "Двадцять хвилин тому мною було викрити єдиний відсік, який не демострували жодному з нас"
    guch "У тому відсіку зберігались людські частини тіла, які на цьому судні використовуються, як їжа"
    guch "Звідси слідує висновок, що команда ковчега - канібали, нас сюди заманили, аби поповнити їх запаси їжі"
    guch "І останнє, це місце не є \"Рятувальним ковчегом\", нас ніхто не врятує, а отже ми самі маємо рятуватись"
    guch "Біжіть звідси, та бережіть себе"
    "Промова вийшла трохи слабкувата, проте я сподіваюсь вона все ж буде мати свій ефект"
    olek "Добре, тут ми закінчили, тож тікаймо"
    mil "Так"
    "Ми розвернулись та збирались прямувати до чорного виходу"
    vla "Не так швидко, хлопче!"
    vla "Ти мені відповіси за це!"
    mil "Я так не думаю"
    "Міла дістала пістолет та стрільнула капітанові у плече"
    vla "Курва!"
    mil "Тепер ви наш заручник, і на майбутнє, не гарно кидатись такими словами в тендітну дівчинку"
    "Міла підійшла до псевдо-капітана та вдарила йому руків'ям від пістолета по макітрі, після чого взяла його під руки та понечсла прикриваючись ним, як щитом"
    "Схоже нам доведеться бігти до машини"
    "Але вона на протилежному боці псевдо-ковчега"
    "Трясця"
    "В будь якому разі нам по іншому не втекти"
    "Отже нам потрібно зробити якийсь відволікаючий маневр, щоб безпечно добігти до машини"
    "Але що ж ми можемо зробити?"
    "..."
    "Точно, можн спробувати зламати цю панець, можливо це виведе деяку апаратуру з ладу і команда псевдо-ковчега не зреагує на нас"
    "Я підняв з землі стілець капітана і жбурнув його в панель"
    "Вона почала трохи іскритись"
    mil "Ти що робиш? Нас же так помітять"
    olek "Не нас, а поламку"
    "Я повтрив свій кидок ще раз і в командному центрі вимкнулось світло"
    olek "Ось тепер можемо йти"
    "Я запам'ятав де саме знаходився чорний хід тож взявши Мілу за руку пошов туди"
    "Двері були звичайними, тож намацавши ручку я без жодних зусиль прочинив їх"
    "Навколо було досить темно, але на виході все ж було світло"
    "Побачивши світло Міла дуже швидко направилась туди, я ж в цей час трохи сповільнився аби послухати, чи йдуть уже за нами, чи поки ні"
    "..."
    "Схоже, що поки команда псевдо-ковчега не може зорієнтуватись і не зайшла до командного центру"
    "От і добре"
    "Світло, що символізувало свободу та виживання"
    "Біля виходу стояли клітки в яких лежали кістки, в цьому місті такому не дивуєшся, але все ж трохи лячно"
    "В одній із кліток почувся шурхіт"
    "За мить в тій клітці з'явилися дві білі цітки"
    "З клітки прозвучав насилу вичавлений звук"
    $ rom = Character("???", color="#FFFFFF")
    rom "Врятуйте..."
    "Я підсвітив ліхтариком клітку"
    "В ній стояв, чоловік дуже слабкий, змучений і без однієї руки"
    rom "Врятуйте, молю вас..."
    "Судячи з його стану він не зможе протриматись у тій клітці довго, проте також він маловірогідно зможе вижити у світі повному гуманоїдів"
    "Якщо я його врятую, совість не дозволить залишити його тут, але здоровий глузд підказує, що він буде лише плутатись під ногами і є великий шанс загинути через це"
    "Вирішувати треба швидко, доки за нами не з'явилась погоня"
    "Тож, що ти вирішиш Олексію?.."
    "..."








    "Відкриття таємниці про відсік"
    "Злам апаратури"
    menu:
        "Врятувати полоненого":
            jump Help_captive_no_refuel
        "Не рятувати полоненого":
            jump Not_help_captive_no_refuel
    return
# Рішення врятувати полоненого (Без бензину)
label Help_captive_no_refuel:
    "І все ж я не можу просто залишити його тут"
    "Я маю його врятувати"
    "Можливо на ключниці є ключі від цієї клітки?"
    "Я підсвітив ключницю ліхтариком та почав порпатись у ній"
    "Ні це за великий..."
    "Цей замалий.."
    "Цей плаский"
    mil "Ти ще довго там?"
    "Вона стояла вже біля виходу"
    olek "Так, зачекай секунду.."
    "Нарешті, це точно має бути він"
    "Ключ увійшов у замок та відчинив його"
    rom "Дякую, вам пане, я вік не забуду вашої доброти"
    olek "Та ну тебе, на моєму місці кожен вчинив би так само"
    rom "Ну не скажіть.."
    olek "В будь якому випадку, якщо я тебе врятував, то тут вже не залишу, поїхали з нами?"
    rom "А можна?"
    olek "Звісно, чого ж ні"
    rom "Дякую вам, пане"
    olek "Тебе до речі як звати?"
    rom "Роман, а вас?"
    $ rom = Character("Роман", color="#FFFFFF")
    olek "Олексій, приємно познайомитись"
    rom "Навзаємо, пане"
    mil "Агов, ви ще довго?"
    olek "Та йдемо, непереймайся"
    mil "Ото вже..."
    "Ми вийшли на двір"
    olek "Отже, Романе, наша машина знаходиться на іншому боці цього псевдо-ковчега, нам потрібно дістатись туди максимально тихо, аби нас не помітили, тож спробуйте не привертати уваги, добре?"
    rom "Добре, пане"
    olek "Тоді рушили"
    "Ми почали просуватись в здовж літака так щоб нас не помітили"
    "Кожен крок був дуже напруженим"
    "Кожен з нас намагався видавати як омога менше звуків, аби нас не помітили"
    "Так як псевдо-ковчег залишився без світла жодні охолоджувачі, системи подавання кисню і таке інше не працювали, то всі звуки з середини були багатократно підсилені через відлуння, і чутні на зовні"
    "Тож кожен шурхіт в середині зупиняв на секунду кожного з нашої трійці"
    "Врешті решт ми дістались до нашого пошарпаного автомобіля"
    "Я заліз в середину вставивши ключ в запалювання"
    "Проворот.. {w} Невдача"
    "Іще раз проворот.. {w} І знову невдача"
    rom "Вибачте, пане, щось не так?"
    olek "Машина не заводиться.."
    olek "У нас схоже закінчився бензин.."
    mil "Як зазвичай у найпідходящій момент.."
    mil "І що ж ми будемо робити?"
    olek "Варіантів у нас не багато.."
    olek "Або бігти, або спробувати захопити цей муляж ковчега"
    "Що ж робити?"
    "..."
    menu:
        "Бігти пішки":
            if is_kill_neighbor == False:
                jump Run_no_refuel
            else:
                jump Run_no_refuel_kill_neighbor
        "Повернутись і битись":
            if is_kill_neighbor == False:
                jump Fight_no_refuel
            else:
                jump Fight_no_refuel_kill_neighbor
    return
# Рішення бігти пішки - Кінцівка 8
label Run_no_refuel:
    olek "Я вважаю, що повертатись туди немає сенсу, тож нам треба бігти звідси, хоч кудись"
    mil "Ну може і так, але куди нам бігти?"
    rom "Я знаю одне невеличке містечко неподалік звідси, там має бути мало мутантів і багато ресурсів, оскільки місто було новим і його ще не встигли заселити"
    olek "А це варіант, і де те місто?"
    rom "На південь звідси"
    olek "..."
    olek "Справжній рятувальний ковчег також знаходиться на південь звідси.."
    olek "В принципі ми можемо спробувати дістатись до справжнього \"Рятувального ковчега\", а якщо не вийде, то залишитись у тому містечку про яке ти сказав поки військові не почнуть зачищати територіїї"
    rom "Я вважаю, що це хороший план, але вирішувати всеодно вам, молодь.."
    mil "..."
    mil "Напевно це таки оптимальний план"
    olek "Тоді пішли"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Фактично ми йшли усю ніч з маленькими перервами на поїсти"
    "Судячи з часу ковчег має злітати вже з хвилини на хвилину"
    "Карти у нас нема, але те містечко про яке говорив Роман ми вже пройшли, тож напевно нам залишилось не так багато"
    "Ще кілька кілометрів, напевно, отже нам треба прискоритись, шанс все ще є.."
    olek "У нас майже не лишилось часу, тож біжімо!"
    "Ми з Мілою взяли Романа підруки та намагалися бігти несучи його"
    "Так ми пробігли кілька хвилин"
    "Легені вже відмовлялися працювати"
    "Ноги ломила втома з болем"
    "Але я не мож здатись за цим лісом є трасса, якщо будемо бігти нею нас може помітять"
    "Отже нам лишився останній ривок"
    "Давай! Ти зможеш!"
    "Коли ми бігли по лісу я почув якийсь наближаючийся шум"
    "Невже у нас не вийшло і ковчег уже злетів без нас?"
    "Ні, це точно не так, це напевно їде машина із запізнюючимися як і ми людьми"
    "Якщо вони нас підберуть ми точно встигнемо"
    "Вибігли з лісу нас збив з ніг могутній порив вітру, що ніс за собою багато листків, що злітали з дерев під його натиском"
    "Нарешті вітер вщюх і я зміг розплющити очі"
    olek "Це кінець.."
    "Прошепотів я собі з істеричною посмішкою"
    "Ніякої машини не було в радіусі, як мінімум, 500 метрів, а небо над нами розривав величезний гвинтокрил, він був абсолютно прекрасним, він був ніби створений з надії, надії яка віддаляється від нас кожної секунди"
    scene end8
    pause
    if persistent.end8 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end8 = True
    return





# Рішення бігти пішки (Заражений) - Кінцівка 9
label Run_no_refuel_kill_neighbor:
    olek "Я вважаю, що повертатись туди немає сенсу, тож нам треба бігти звідси, хоч кудись"
    mil "Ну може і так, але куди нам бігти?"
    rom "Я знаю одне невеличке містечко неподалік звідси, там має бути мало мутантів і багато ресурсів, оскільки місто було новим і його ще не встигли заселити"
    olek "А це варіант, і де те місто?"
    rom "На південь звідси"
    olek "..."
    olek "Справжній рятувальний ковчег також знаходиться на південь звідси.."
    olek "В принципі ми можемо спробувати дістатись до справжнього \"Рятувального ковчега\", а якщо не вийде, то залишитись у тому містечку про яке ти сказав поки військові не почнуть зачищати територіїї"
    rom "Я вважаю, що це хороший план, але вирішувати всеодно вам, молодь.."
    mil "..."
    mil "Напевно це таки оптимальний план"
    olek "Тоді пішли"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Фактично ми йшли усю ніч з маленькими перервами на поїсти"
    "Судячи з часу ковчег має злітати вже з хвилини на хвилину"
    "Карти у нас нема, але те містечко про яке говорив Роман ми вже пройшли, тож напевно нам залишилось не так багато"
    "Ще кілька кілометрів, напевно, отже нам треба прискоритись, шанс все ще є.."
    olek "У нас майже не лишилось часу, тож біжімо!"
    "Ми з Мілою взяли Романа підруки та намагалися бігти несучи його"
    "Так ми пробігли кілька хвилин"
    "Легені вже відмовлялися працювати"
    "Ноги ломила втома з болем"
    "Але я не мож здатись за цим лісом є трасса, якщо будемо бігти нею нас може помітять"
    "Отже нам лишився останній ривок"
    "..."
    "Ноги, вес ж, відмовили першими"
    "Я вронив не зміг втримати рівновагу і разом зі мною впали і мої компаньйони"
    mil "Ти що виробляєш? Трясця ми ж так не встигнемо"
    olek "Почекай, щось мені погано.."
    mil "Я розумію, але нам треба ще трохи пробігти і ми будемо врятовані"
    olek "Я не можу. {w} Кхе-кхе"
    $ olek = Character("Олексій", color="#009900")
    "Зелений газ вирвався з моїх легеней"
    mil "Ти що знущаешся?"
    "У небі почувся наближаючийся гул"
    "Він ставав все ближче і ближче, аж в раз над деревами пролетів справжній, величезний гвинтокрил"
    "Це абсолютно точно був \"Рятувальний ковчег\""
    "Надії вже більше немає, ніхто нас не врятує..."
    "Тоді я маю врятувати всіх"
    "Курва! Я більше не контролюю своє тіло"
    "Чомусь воно враз стало таке легке, ніби вся втома кудись ділась"
    "Я хочу лише зробити своїх найбличих людей такими ж відпочившими"
    "Тому я маю поділитись цим газом для них"
    "Прийміть його... {w} Прийміт його"
    "Нужбо! Прийміть його!"
    olek "Я допоможу вам... {w} Прийміть цей газ... {w} Він всіх врят..."
    # Звук вистріли
    mil "Вибач, але я ж казала, що не стану тебе жаліти.."
    scene end9
    pause
    if persistent.end9 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end9 = True
    return





# Рішення повернутись та битись - Кінцівка 10
label Fight_no_refuel:
    olek "На мою думку сенсу бігти немає, тим паче, що нам ніяк не встигнути на справжній \"Рятувальний ковчег\", тож я вважаю, що нам потрібно ораганізуватись з тими хто ще не встиг вибігти і спробувати захопити цей псевдо-ковчег"
    rom "В цьому є якийсь сенс, але вам не здається, що це занадто ризиковано? В сенсі, що нас занадто мало для повноцінного захоплення ковчега"
    rom "Я можу запропонувати добігти до маленького мітечка на північ звідси, там має бути мало гуманоїдів, тож ми зможемо спокійно пересидіти там до приходу військових"
    rom "Але вирішувати все одно вам.. Ви мене врятуваали, тож я піду за вами, яке б не було ваше рішення, пане"
    olek "Я все ж вважаю, що боротися буде найбільш оптимальним варіантом, до того ж, якщо ми будемо бігти на нас в будь який момент можуть напасти гуманоїди, а ти що скажеш, Міла?"
    mil "Я думаю, що ти правий, тим паче, що зараз команда псевдо-ковчега розгублена через поламку апаратури і це дає нам перевагу, до того ж, навіть якщо на нас не нападатимуть гуманоїди, ми все одно не стигнемо добігти до справжнього ковчега"
    rom "Ну якщо ви обидвоє так думаєте, то можна зробити і так"
    olek "Тож нам треба пробратись у середину та знайти тих хто ще не встиг вийти з псевдо-ковчега"
    rom "Тоді, полетіли!"
    "Імпровізований спец. загін почав своє просування до головного входу"
    "Величезна брама, що мала би зачинятись автоматично, була привідкрита між нею та стінкою була маленька шпаринка у яку пройти можна було лише боком"
    "Ось ми і в середині, тепер треба знайти людей"
    "Найлогічнішим рішенням було би пошукати їх у відсіку з каютами, тож тиди ми і направились"
    "На сходах сиділи ті самі чоловіки, яких ми зустріли коли тільки прибули сюди, вони ніби живуть на тих сходах"
    "Вони сиділи у суцільній темряві, тільки маленький ліхтарик підсвічував їх силуети"
    olek "Вибачте, панове, на борту є ще хтось окрім вас?"
    "Прошепотів я"
    noname "Ні, всі втекли.."
    "Чоловік на сходах відповідав з такю ж гучністю, що і вчора, ніби він не хотів приховати свою присуність"
    olek "А чого тоді ви тут?"
    noname "Так, а що нам ще втрачати? Все що у нас було все уже і так забрали обставини.."
    olek "А як же життя, свобода? У вас все ще є все для того щоб збудувати нове життя, тільки треба перемогти цих канібалів з псевдо-ковчега, вставайте!"
    "Не стримався я переходячи на крик"
    noname "Ти молодий та інфантильний, схоже справжнього жаху ти не пережив, тож ти ніяк не зрозумієш нас.."
    "От трясця, старі впертюхи, і що ж мені робити з ними..?"
    rom "Дозвольте я спробую, пане"
    "Тихо сказав мені Роман"
    rom "Вибачте, панове, можливо ми ніколи не зрозуміємо того, що ви пережили. Але ось що я хочу сказати вам: якщо ви здастесь зараз, який сенс було все це переживати? Нащо ви боролися за життя тоді, якщо не хочете боротися за нього прямо зараз?"
    rom "Разом, панове, ми зможемо перемогти наших ворогів. Ми можемо дочекатись справжніх військових перемог, і тоді настане час, коли ми зможемо зажити повноцінним життям"
    rom "Подивіться на себе: ви, здорові фізично, здатні до багато більшого. Якщо так людина без ноги, як я, може встати та йти на зустріч майбутньому, то чому ж ви, панове, не можете встати та йти? Не дозволяйте своєму минулому обмежувати вас"
    noname "..."
    "Чоловіки на сходах так само сиділи"
    rom "Я розумію, що все що ви прожили залишить на ваших серцях невиправний шрам, але якщо ви зараз не встанете, вони скоро перестануть битися.."
    mil "Ходімо, Олексію, Романе, вони нам не допоможуть.."
    "Аж раптом за спино почувся шелест"
    noname "Я піду з вами!"
    "Сказав чоговік якого пограбували"
    noname "Хоч у мене вкрали все, від грошей до надії, але я більше не збираюсь стояти на місці, ви зі мною?"
    "Звернувся він до своїх товарищів по сходах"
    "Обидва чоловіки майже одночасно піднялися і майже хором сказали"
    noname "Так!"
    rom "Ну от і добре, тоді давайте знайомитись, панове"
    rom "Мене звати Роман, а це Міла та Олексій"
    noname "Мене Артем"
    noname "Я Максим"
    noname "А я Євген"
    "Раптом з дальньої частини відсіку, що вів у їдальню почувся шурхіт"
    kok "Яке прекрасне знайомство.. Жаль тільки що воно буде не довгим"
    olek "Тепер ти будеш корчити з себе капітана?"
    kok "Я? Ні що ти.. Я просто буду попрошу своїх помічників принести нам інгридієнтів"
    kok "До речі ось і вони.."
    "Із-за його спини почали виходити охоронці псевдо-ковчега"
    "Їх було чоловік з п'ятнадцять, нас же всього п'ятеро"
    kok "Розберіться з ними швиденько, а в нагороду я дам вам добавки!"
    noname "Так, пане!"
    "Команда псевдо-ковчега наближалася швидко, зберігаючи формування"
    "Люди з обох сторін були напружені та готові до протистояння"
    olek "Тепер у нас вже немає шляху назад. Переможемо їх!!!"
    "Команда псевдо-ковчега була озброєна ножами"
    "Адреналін почав переважати в крові і не витримавши напруги я кинувся на ворога першим"
    "Чудом увернувшись від удару ножем я все ж зміг зайти одному з них за спину та взяти його на больовий"
    "В принципі це єдине що я вмів з бойових мистецтв, тільки один залом руки і все, але зараз ця навичка явно виявилась над ефективною"
    "Я почав прикриватись цим канібалом, як щитом"
    "Темрява почала грати нам на руку, оскільки вороги почали бити свого ж товариша ножами, думаючи, що це я"
    "Поки я тримав їхнього одного біля себе, інші члени моєї команди почали активно взаємодіяти з командою псевдо-ковчега"
    "Роман почав розкидати під ноги противників різні предмети, щоб пошкодити їхні ноги та збити з ритму"
    "Міла використовувала свої бойові навички, ухиляючись від ударів та контратакуючи з ефектними рухами"
    "На а сходинкове брацтво були досить кримезними, аби битися з командою псевдо-ковчега на рівних"
    "Це все виглядало абсолютно не правдоподібно, ніби згайка молодшокласників вийшла проти студентів університету, але ми таки почали перемагати"
    "Наша перемога ставала все більш і більш не минучою подією і ось нарешті битва добігла кінця"
    "Ми таки здолали команду псевдо-ковчега, а кок Григорій у свою чергу швидко злиняв з псевдо-ковчега, хоча так навіть краще, не доведеться нічого з ним робити, хай цим краще займуться гуманоїди"
    "Тепер весь цей величезний дім стилізований під \"Рятувальний ковчег\" належав нам, ми мали протириматись у ньому до приходу військових"
    "В принципі ця подія могла статися як за два-три тижні, так і за два-три місяці, тож нам потрібно було почати відновлювати основні системи дому, щоб нам було зручніше жити тут"
    window hide
    scene clock_four with fade
    pause(1.0)
    scene bg clock_nine with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "День пролетів непомітно, після битви ми трохи відпочили і почали відновлювати електропостачання"
    "Звільнились ми тільки о дев'ятій, але вийшовши на двір я побачив захід сонця, що світило віддаючи все тепло нам"
    "Коден промінчик зігрівав мою душу і дарував надію, що далі все буде як ми того захчемо"
    "Якщо ми змогли пережити напади гуманоїдів, підставний ковчег з канібалами і навіть перемогти озброєних охоронців того ж псевдо-ковчега в меншості, то що взагалі може нас зупинити?"
    "Напевно нічого.."
    scene end10
    pause
    if persistent.end10 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end10 = True
    return





# Рішення повернутись та битись (Заражений) - Кінцівка 11
label Fight_no_refuel_kill_neighbor:
    olek "На мою думку сенсу бігти немає, тим паче, що нам ніяк не встигнути на справжній \"Рятувальний ковчег\", тож я вважаю, що нам потрібно ораганізуватись з тими хто ще не встиг вибігти і спробувати захопити цей псевдо-ковчег"
    rom "В цьому є якийсь сенс, але вам не здається, що це занадто ризиковано? В сенсі, що нас занадто мало для повноцінного захоплення ковчега"
    rom "Я можу запропонувати добігти до маленького мітечка на північ звідси, там має бути мало гуманоїдів, тож ми зможемо спокійно пересидіти там до приходу військових"
    rom "Але вирішувати все одно вам.. Ви мене врятуваали, тож я піду за вами, яке б не було ваше рішення, пане"
    olek "Я все ж вважаю, що боротися буде найбільш оптимальним варіантом, до того ж, якщо ми будемо бігти на нас в будь який момент можуть напасти гуманоїди, а ти що скажеш, Міла?"
    mil "Я думаю, що ти правий, тим паче, що зараз команда псевдо-ковчега розгублена через поламку апаратури і це дає нам перевагу, до того ж, навіть якщо на нас не нападатимуть гуманоїди, ми все одно не стигнемо добігти до справжнього ковчега"
    rom "Ну якщо ви обидвоє так думаєте, то можна зробити і так"
    olek "Тож нам треба пробратись у середину та знайти тих хто ще не встиг вийти з псевдо-ковчега"
    rom "Тоді, полетіли!"
    "Імпровізований спец. загін почав своє просування до головного входу"
    "Величезна брама, що мала би зачинятись автоматично, була привідкрита між нею та стінкою була маленька шпаринка у яку пройти можна було лише боком"
    "Ось ми і в середині, тепер треба знайти людей"
    "Найлогічнішим рішенням було би пошукати їх у відсіку з каютами, тож тиди ми і направились"
    "На сходах сиділи ті самі чоловіки, яких ми зустріли коли тільки прибули сюди, вони ніби живуть на тих сходах"
    "Вони сиділи у суцільній темряві, тільки маленький ліхтарик підсвічував їх силуети"
    olek "Вибачте, панове, на борту є ще хтось окрім вас?"
    "Прошепотів я"
    noname "Ні, всі втекли.."
    "Чоловік на сходах відповідав з такю ж гучністю, що і вчора, ніби він не хотів приховати свою присуність"
    olek "А чого тоді ви тут?"
    noname "Так, а що нам ще втрачати? Все що у нас було все уже і так забрали обставини.."
    olek "А як же життя, свобода? У вас все ще є все для того щоб збудувати нове життя, тільки треба перемогти цих канібалів з псевдо-ковчега, вставайте!"
    "Не стримався я переходячи на крик"
    noname "Ти молодий та інфантильний, схоже справжнього жаху ти не пережив, тож ти ніяк не зрозумієш нас.."
    "От трясця, старі впертюхи, і що ж мені робити з ними..?"
    rom "Дозвольте я спробую, пане"
    "Тихо сказав мені Роман"
    rom "Вибачте, панове, можливо ми ніколи не зрозуміємо того, що ви пережили. Але ось що я хочу сказати вам: якщо ви здастесь зараз, який сенс було все це переживати? Нащо ви боролися за життя тоді, якщо не хочете боротися за нього прямо зараз?"
    rom "Разом, панове, ми зможемо перемогти наших ворогів. Ми можемо дочекатись справжніх військових перемог, і тоді настане час, коли ми зможемо зажити повноцінним життям"
    rom "Подивіться на себе: ви, здорові фізично, здатні до багато більшого. Якщо так людина без ноги, як я, може встати та йти на зустріч майбутньому, то чому ж ви, панове, не можете встати та йти? Не дозволяйте своєму минулому обмежувати вас"
    noname "..."
    "Чоловіки на сходах так само сиділи"
    rom "Я розумію, що все що ви прожили залишить на ваших серцях невиправний шрам, але якщо ви зараз не встанете, вони скоро перестануть битися.."
    mil "Ходімо, Олексію, Романе, вони нам не допоможуть.."
    "Аж раптом за спино почувся шелест"
    noname "Я піду з вами!"
    "Сказав чоговік якого пограбували"
    noname "Хоч у мене вкрали все, від грошей до надії, але я більше не збираюсь стояти на місці, ви зі мною?"
    "Звернувся він до своїх товарищів по сходах"
    "Обидва чоловіки майже одночасно піднялися і майже хором сказали"
    noname "Так!"
    rom "Ну от і добре, тоді давайте знайомитись, панове"
    rom "Мене звати Роман, а це Міла та Олексій"
    noname "Мене Артем"
    noname "Я Максим"
    noname "А я Євген"
    "Раптом з дальньої частини відсіку, що вів у їдальню почувся шурхіт"
    kok "Яке прекрасне знайомство.. Жаль тільки що воно буде не довгим"
    olek "Тепер ти будеш корчити з себе капітана?"
    kok "Я? Ні що ти.. Я просто буду попрошу своїх помічників принести нам інгридієнтів"
    kok "До речі ось і вони.."
    "Із-за його спини почали виходити охоронці псевдо-ковчега"
    "Їх було чоловік з п'ятнадцять, нас же всього п'ятеро"
    kok "Розберіться з ними швиденько, а в нагороду я дам вам добавки!"
    noname "Так, пане!"
    "Команда псевдо-ковчега наближалася швидко, зберігаючи формування"
    "Люди з обох сторін були напружені та готові до протистояння"
    olek "Тепер у нас вже немає шляху назад. Переможемо їх!!!"
    "Команда псевдо-ковчега була озброєна ножами"
    "Адреналін почав переважати в крові і не витримавши напруги я кинувся на ворога першим"
    "Чудом увернувшись від удару ножем я все ж зміг зайти одному з них за спину та взяти його на больовий"
    "В принципі це єдине що я вмів з бойових мистецтв, тільки один залом руки і все, але зараз ця навичка явно виявилась над ефективною"
    "Я почав прикриватись цим канібалом, як щитом"
    "Темрява почала грати нам на руку, оскільки вороги почали бити свого ж товариша ножами, думаючи, що це я"
    "Поки я тримав їхнього одного біля себе, інші члени моєї команди почали активно взаємодіяти з командою псевдо-ковчега"
    "Роман почав розкидати під ноги противників різні предмети, щоб пошкодити їхні ноги та збити з ритму"
    "Міла використовувала свої бойові навички, ухиляючись від ударів та контратакуючи з ефектними рухами"
    "На а сходинкове брацтво були досить кримезними, аби битися з командою псевдо-ковчега на рівних"
    "Це все виглядало абсолютно не правдоподібно, ніби згайка молодшокласників вийшла проти студентів університету, але ми таки почали перемагати"
    "Наша перемога ставала все більш і більш не минучою подією і ось нарешті битва добігла кінця"
    "Ми таки здолали команду псевдо-ковчега, а кок Григорій у свою чергу швидко злиняв з псевдо-ковчега, хоча так навіть краще, не доведеться нічого з ним робити, хай цим краще займуться гуманоїди"
    "Відчуття полегшення подарувало моєму тілу спокій"
    "Я вдихнув на всі груди і раптом з моїх легеней вирався цей зрадницький кашель"
    olek "Кхе-кхе"
    "Я відчув, що зараз щось не так, ніби болять самі кістки"
    mil "З тобою все нормально?"
    olek "Не знаю"
    mil "Все ж таки той газ дістався легеней, чи не так?"
    olek "Напевно.."
    olek "Я краще піду, аби не зачепити нікого з вас.."
    mil "Навно, що так.."
    "Зібравши всі свої сили для останнього ривка подалі від моїх товаришів я краєм вуха почув їх діалог"
    rom "Щось не так? Куди це він?"
    mil "Почав перетворюватись.."
    rom "Ні... це не може бути правдою"
    mil "Як бачиш, може"
    "..."
    "Зі спокоєм у серці, я рухався подалі від команди, прагнучи знайти тихе та безпечне місце для останнього відпочинку" 
    "Незважаючи на біль та незручність, мені було відомо, що ми вже зробили багато, і в майбутньому ці люди зможуть зробити ще більше, тож аби не піддавати їх ризику я просто пішов"
    "Усю ніч я мучився відчуваючи, як мої кістки проростають у зворотньому напрямку, а мозок перестає працювати на повну, але поки він ще працює мені треба зробити щось, щоб не нашкодити нікому.."
    "Ранкове сонце вже почало засікати, коли я відчув, що газ повністю витіснив мою людську сутність"
    "Усі надії на повернення в нормальне життя були давно покинуті, і тепер лишився лише один шлях - віддати себе на прощання"
    "Роздумуючи над тим, що зробити, я зрозумів, що вже не повернутись"
    "Я вирішив, що якщо я виживу, я створю великий ризик напасти на невинних людей, а я такого не хочу.."
    "Я знайшов найближчу річку в якій я би зміг втонути і занурився у воду, яка мала би поховати небезпечного гуманоїда, щоб людина могла жити у пам'яті інших"
    scene end11
    pause
    if persistent.end11 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end11 = True
    return





# Рішення не рятувати полоненого (Без бензину)
label Not_help_captive_no_refuel:
    "І все ж ми не можемо його врятувати"
    "Він буде лише заважати, та й нам не вистачить провізії на трьох"
    "Опустивши голову, я попрямував до виходу"
    olek "Пробач"
    "Шепотів я"
    olek "Пробач, але нам тоді не вижити"
    "Короткий коридор, що вів до виходу здавався безкінечним"
    "Кожен крок відчувався, як крок від людяності, але це було раціональне рішення, рішення яке вело до виживання"
    "Нарешті ми з Мілою вийшли на двір"
    "Тепер нам наеобхідно було дістатись до машини"
    olek "Тепер йдемо до машини?"
    mil "Так, пішли"
    "Ми почали просуватись в здовж літака так щоб нас не помітили"
    "Кожен крок був дуже напруженим"
    "Кожен з нас намагався видавати як омога менше звуків, аби нас не помітили"
    "Так як псевдо-ковчег залишився без світла жодні охолоджувачі, системи подавання кисню і таке інше не працювали, то всі звуки з середини були багатократно підсилені через відлуння, і чутні на зовні"
    "Тож кожен шурхіт в середині зупиняв на секунду кожного з нашої трійці"
    "Врешті решт ми дістались до нашого пошарпаного автомобіля"
    "Я заліз в середину вставивши ключ в запалювання"
    "Проворот.. {w} Невдача"
    "Іще раз проворот.. {w} І знову невдача"
    mil "Що там вже таке? Щось не працює?"
    olek "Машина не заводиться.."
    olek "У нас схоже закінчився бензин.."
    mil "Як зазвичай у найпідходящій момент.."
    mil "І що ж ми будемо робити?"
    olek "Варіантів у нас не багато.."
    olek "Або бігти, або спробувати захопити цей муляж ковчега"
    "Що ж робити?"
    "..."
    menu:
        "Бігти пішки":
            if is_kill_neighbor == False:
                jump Run_no_refuel_not_help
            else:
                jump Run_no_refuel_not_help_kill_neighbor
        "Повернутись і битись":
            if is_kill_neighbor == False:
                jump Fight_no_refuel_not_help
            else:
                jump Fight_no_refuel_not_help_kill_neighbor
    return
# Рішення бігти пішки (Без бензину + Без полоненого) - Кінцівка 12
label Run_no_refuel_not_help:
    olek "Я от думаю, що повертатись туди немає сенсу, тож нам треба бігти звідси, хоч кудись"
    mil "Ну може і так, але куди нам бігти?"
    olek "Капітан псевдо-ковчега казав, що справжній \"Рятувальний ковчег\" знаходиться там же де і мав би, тож можемо піти туди"
    mil "Навіть не знаю, якщо я нічого не плутаю, то щоб дійти туди нам потрібно буде пройти близько ста п'ятидеясти кілометрів"
    olek "Так то ти права, але куди нам ще можна податись? Хіба що плвертатись"
    olek "До того ж сто п'ятдесят кіломентрів цілком можливо пройти пішки за півтора дня"
    mil "Напевно, ти таки правий, іти до справжнього ковчега - це оптимальний варіант"
    olek "Тоді пішли"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Фактично ми йшли усю ніч з маленькими перервами на поїсти"
    "Судячи з часу ковчег має злітати вже з хвилини на хвилину"
    "Карти у нас нема, але ми вже здолали чималу відстань: пройшли з десяток населених пунктів та кілька разів сплавлялись по річці"
    "На разі ми йшли по лісу, пташки співали, як і завжди, вітер грався листям на гілках, а в далені бачився невелий пагорб за яким мало бути міто Рівне"
    "Схоже нам лишилось ще кілька кілометрів, шанс встигнути все ще є, отже треба прискоритись.."
    olek "У нас майже не лишилось часу, тож біжімо!"
    "Ми з Мілою побігли у напрямку Рятувального ковчега"
    "Перед тим як вибігти на відкриту місцевість я почув, як з того боку рухається доволі шумна компанія гуманоїдів"
    "Всі вони ревіли та стогнали, ніби перемоляючись між собою"
    "Я схопив Мілу за руку та потягнув на себе"
    mil "Ти що виробляєш?!"
    olek "Тихіше, на нас рухається зграя гуманоїдів. Далі нам не пройти, поки що"
    mil "І що ти пропонуєш робити, просто сидіти та чекати поки ковчег полетить без нас?"
    olek "Якщо гуманоїди не змінять маршрут, давши нам змогу рухатись далі, то так.."
    mil "Але ж весь цей шлях виявиться марним, якщо ми не дістанемось ковчега"
    olek "Шлях виявиться марним тільки у тому випадку, якщо ми зараз будемо з'їдені гуманоїдами"
    mil "..."
    mil "Трясця.. Ми ж так не встигнемо.."
    olek "За нами ще прийдуть, а до того часу нам просто треба вижити"
    mil "Добре.."
    "Дійшовши якоїсь згоди ми з Мілою сховались у великих кущах вовчої ягоди"
    "Її обурення можна було відчути навіть не дивлячись на неї" 
    "Між нами запанувала мовчанка, а от гуманоїди навіть не планували замовкати, вони йшли так само повільно, ніби вони королі світу, та ревіли між собою"
    "За деякий час у небі над нами з'явився величезний гвинтокрил" 
    "Він був абсолютно прекрасним, він був ніби створений з надії, надії яка віддаляється від нас кожної секунди"
    mil "Дочекались, хай йому.."
    olek "Я ж вже казав, що краще так, ніж нас з'їдять гуманоїди"
    mil "..."
    "Гуманоїди наречті пройшли таку дистанцію, щоб ми не могли потрапити у їх поле зору і ми вийшли із-за кущів"
    mil "І що тепер? Куди ти тепер плануєш іти?"
    olek "Не знаю точно, але я думаю, що ми могли б осісти на деякий час у Рівному, поки нас не врятують військові"
    mil "Та що ти кажеш.. І коли ж це буде?"
    olek "Я не знаю, але до того моменту нам потрібно залишитись у живих"
    mil "Я більше не буду терпіти твого планування, якщо б ми побігли, ми б зараз були на ковчезі, а так ми посеред лісу без визначеного плану" 
    mil "Дякую, але я більше не хочу слухати твою маячню про виживання, якщо ми не будемо ризикувати, то який взагалі сенс у житті?"
    olek "..."
    "Невзмозі сформулювати відповідь я просто промовчав"
    "Міла не стала чекати відповіді та попрямувала у напрямку звідки ми прийшли"
    "Я виршив, що її треба повернути, але озернувшись, я помітив, що нікого там вже й нема"
    scene end12
    pause
    if persistent.end12 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end12 = True
    return





# Рішення бігти пішки (Заражений + Без бензину + Без полоненого) - Кінцівка 13
label Run_no_refuel_not_help_kill_neighbor:
    olek "Я от думаю, що повертатись туди немає сенсу, тож нам треба бігти звідси, хоч кудись"
    mil "Ну може і так, але куди нам бігти?"
    olek "Капітан псевдо-ковчега казав, що справжній \"Рятувальний ковчег\" знаходиться там же де і мав би, тож можемо піти туди"
    mil "Навіть не знаю, якщо я нічого не плутаю, то щоб дійти туди нам потрібно буде пройти близько ста п'ятидеясти кілометрів"
    olek "Так то ти права, але куди нам ще можна податись? Хіба що плвертатись"
    olek "До того ж сто п'ятдесят кіломентрів цілком можливо пройти пішки за півтора дня"
    mil "Напевно, ти таки правий, іти до справжнього ковчега - це оптимальний варіант"
    olek "Тоді пішли"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Фактично ми йшли усю ніч з маленькими перервами на поїсти"
    "Судячи з часу ковчег має злітати вже з хвилини на хвилину"
    "Карти у нас нема, але ми вже здолали чималу відстань: пройшли з десяток населених пунктів та кілька разів сплавлялись по річці"
    "На разі ми йшли по лісу, пташки співали, як і завжди, вітер грався листям на гілках, а в далені бачився невелий пагорб за яким мало бути міто Рівне"
    "Схоже нам лишилось ще кілька кілометрів, шанс встигнути все ще є, отже треба прискоритись.."
    olek "У нас майже не лишилось часу, тож біжімо!"
    "Ми з Мілою побігли у напрямку Рятувального ковчега"
    "Перед тим як вибігти на відкриту місцевість я почув, як з того боку рухається доволі шумна компанія гуманоїдів"
    "Всі вони ревіли та стогнали, ніби перемоляючись між собою"
    "Я схопив Мілу за руку та потягнув на себе"
    mil "Ти що виробляєш?!"
    olek "Тихіше, на нас рухається зграя гуманоїдів. Далі нма не пройти, поки що"
    mil "І що ти пропонуєш робити, просто сидіти та чекати поки ковчег полетить без нас?"
    olek "Якщо гуманоїди не змінять маршрут, давши нам змогу рухатись далі, то так.."
    mil "Але ж весь цей шлях виявиться марним, якщо ми не дістанемось ковчега"
    olek "Шлях виявиться марним тільки у тому випадку, якщо ми зараз будемо з'їдені гуманоїдами"
    mil "..."
    mil "Все ж я краще спробую і мене з'їдять ніж я не спробую і буду про це жаліти"
    mil "Не заню, як ти, але я не буду чекати"
    "Міла побігла у напрямку ковчега"
    olek "Трясця.."
    olek "Та гори воно все.."
    "Я кинувся в слід за Мілою"
    "Гуманоїди вже засікли її та бігли за нею"
    "Я намагався бігти з усіх сил аби наздогнати Мілу і у мене таки вийшло це зробити"
    olek "Міла, я маю ідею"
    olek "Але мені потрібно, щоб ти довірилась мені.."
    mil "Що ти там вже придумав? Якийсь новий аргумент про те що ми маємо сховатись..?"
    olek "Навпаки, виходячи з нинішньої ситуації сенсу ховатись уже немає"
    olek "Тож я попробую таке: я відманю гуманоїдів від тебе, і як тільки вони розгубляться, ти побіжиш до ковчега. Я наздожену тебе пізніше"
    mil "Що за маячня, а як же ти?"
    olek "Судячи з того що я весь час відхаркував зеленим газом є ймовірність, що я також перетворюсь на гуманоїда, тож найкращим варіантом буде врятувати тебе, а якщо я не мутую, то тоді і я зайду на ковчег"
    olek "То як, ти довіришся мені?"
    mil "..."
    mil "Я не хочу залишати тебе одного з ними.."
    olek "Я ж сказав, що важливіше врятувати здорову тебе ніж зараженого мене"
    mil "..."
    mil "Добре, тільки обіцяй, що прийдеш.."
    olek "Звісно прийду, навіть не сумнівайся"
    "Обіцяти таке було настількиж правдоподібно, як розказувати казки, але якщо б я цього не зробив вона б не послухалась"
    "Я почав відбігати вбік, намагаючись привернути їхню увагу"
    mil "Щось це не дуже працює, вони все ще біжать за мною.."
    "Крикнула Міла"
    "І справді, гуманоїди взагалі не відволікались на мої дії і продовжували переслідувати Мілу"
    "Схоже через те що у мене в легенях вже є деяка кількість газу вони вбачають у мені рівного гуманоїда"
    "Трясця, і що ж робити?"
    "..."
    "Єдине, що прийшло мені в голову, виходячи з побаченого раніше, це те що я можу спробувати збити одного з них і якщо вони вважають його сім'єю вони спробують мене наздогнати, тож так і зроблю"
    "Я розбігся що є сил і врізався у одного з них, \"жертвою\" я обрав найменшого з них"
    "Реакція решти не змусила себе довго чекати, вони майже миттєво спинились, аби запам'ятати мене та побігли за мною"
    "Міла помітила їх гальмування та з усіх сил побігла до ковчега"
    "Ось і одобре, тепер мені лишається якось завести їх подалі від ковчега"
    "Я швидко підвівся, але зграйка гуманоїдів вже наближалась до мене, тож я побіг полем у зворотньому напрямку до ковчега"
    "Легкість моєї попередньої бігової форми зникла, і кожен крок ставав важчим і болісним"
    "Все більше зеленого газу виходило з моїх легень, а мені здавалося, що я повільно перетворююся на гуманоїда"
    "Свідомість мутнішає, я вже плутаюсь у думках, але поки ще можу відслідковувати свій стан"
    "Поступово я відчував, як мої рухи стають неповороткими та незручними"
    "Болісний запах зеленого газу наповнював повітря, і я знав, що мій подих вже не схоже на подих здорової людини"
    "Декілька разів майже втрачаючи свідомість, я продовжував рухатись вперед"
    "Моє тіло було виснажене, але я все ж боровся за кожний метр, аби дати Мілі трохи більше часу"
    "Гуманоїди досі були на хвості, але вони схоже починали сповільнятись, невже це через те що я все більш і більш мутую?"
    "Нарешті, коли мої сили вже майже підійшли до кінця, я впав на землю"
    "Мої коліна вкотре дали під собою, але я стиснув зуби і не зупинявся. Подумки я благав Мілу не озиратись і просто бігти далі, я витягнув останні резерви енергії і продовжив рухатись вперед"
    "Кістки почали хрустіти та рости у зовсім не звичайному напрямку"
    "За моїми розрахунками Міла вже мала би добігти до ковчега, отже я впорався"
    "Тепер я можу трохи спочити.."
    "Це кінець.."
    "..."
    $ olek =  Character("Олексій", color="#009900")
    "Ох, знову очнувся?"
    "Справді, я вижив?"
    "Отож, здається, бог має плани для мене."
    "І я відчуваю... це непереможну силу, яку повинен поділитись з людьми на ковчезі."
    "Я повинен це зробити..."
    "Але я сам не справлюся. Мені потрібна допомога інших."
    "Мабуть, мої брати прочитали мої думки і вже готуються бігти на ковчег."
    "Тільки я знаю дорогу, тому я веду всіх вперед."
    "З новим цим тілом я відчуваю непереборну силу. Я біжу швидше, ніж коли-небудь раніше!"
    "І ось ми майже досягли ковчега."
    "Вже бачу його, але що тут твориться? Чому я чую вибухи зброї та крики військових?"
    "Я зупинився і підняв голову, сподіваючись побачити Мілу. Але замість неї, бачу велику групу людей, які стріляють у гуманоїдів, включаючи мене. Вони не розрізняють мене від інших. Я розумію, що вони бачать у мені лише загрозу зі страхом."
    "Але чому? Ми ж принесли їм спасіння від цих застарілих тіл. Все, що вони повинні зробити, це прийняти це... Тоді, чому...?"
    olek "Ааааа!!!"
    "З ковчега пролунав крик."
    noname "Цей занадто агресивний, хтось знять його!"
    # Звук пострілу
    scene end13
    pause
    if persistent.end13 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end13 = True
    return





# Рішення повернутись та битись (Без бензину + Без полоненого) - Кінцівка 14
label Fight_no_refuel_not_help:
    olek "На мою думку сенсу бігти немає, тим паче, що нам ніяк не встигнути на справжній \"Рятувальний ковчег\", тож я вважаю, що нам потрібно ораганізуватись з тими хто ще не встиг вибігти і спробувати захопити цей псевдо-ковчег"
    mil "Я згодна, але тобі не здається, що нас двох не вистачить?"
    olek "Саме тому нам треба пробратись у середину і спробувати знайти тих хто ще не встиг вийти з псевдо-ковчега"
    mil "Тоді добре, тим паче, що зараз у нас є деяка перевага через те що команда псевдо-ковчега спантеличена поламкою апаратури"
    olek "От і добре, що ти і сама все розумієш, тоді рушили?"
    mil "Звісно"
    "Ми з Мілою почали своє просування до головного входу"
    "Величезна брама, що мала би зачинятись автоматично, була привідкрита між нею та стінкою була маленька шпаринка у яку пройти можна було лише боком"
    "Ось ми і в середині, тепер треба знайти людей"
    "Найлогічнішим рішенням було би пошукати їх у відсіку з каютами, тож тиди ми і направились"
    "На сходах сиділи ті самі чоловіки, яких ми зустріли коли тільки прибули сюди, вони ніби живуть на тих сходах"
    "Вони сиділи у суцільній темряві, тільки маленький ліхтарик підсвічував їх силуети"
    olek "Вибачте, панове, на борту є ще хтось окрім вас?"
    "Прошепотів я"
    noname "Ні, всі втекли.."
    "Чоловік на сходах відповідав з такю ж гучністю, що і вчора, ніби він не хотів приховати свою присуність"
    olek "А чого тоді ви тут?"
    noname "Так, а що нам ще втрачати? Все що у нас було все уже і так забрали обставини.."
    olek "А як же життя, свобода? У вас все ще є все для того щоб збудувати нове життя, тільки треба перемогти цих канібалів з псевдо-ковчега, вставайте!"
    "Не стримався я переходячи на крик"
    noname "Ти молодий та інфантильний, схоже справжнього жаху ти не пережив, тож ти ніяк не зрозумієш нас.."
    "От трясця, старі впертюхи, і що ж мені робити з ними..?"
    mil "Дай но я спробую"
    "Тихо сказала мені Міла"
    mil "Слухайте сюди, шановні!"
    mil "Можливо ми ніколи не зрозуміємо того, що ви пережили. Але ось що я хочу сказати вам: якщо ви здастесь зараз, який сенс було все це переживати? Нащо ви боролися за життя тоді, якщо не хочете боротися за нього прямо зараз?"
    mil "Якщо ви доєднаєтесь до нас ми зможемо перемогти наших ворогів і в стокої дочекатись справжніх військових, і тоді настане час, коли ми зможемо зажити повноцінним життям"
    noname "..."
    mil "Чого мовчите? {w} Язики проковтнули?" 
    mil "Подивіться на себе: ви ж чоловіки, чого така молода і гарна дівчина має вам переконувати встати та іти?"
    noname "..."
    "Чоловіки на сходах так само сиділи"
    mil "Ну і грець з вами, ходімо, Олексію, вони не здатні боротися навіть за себе"
    olek "І куди ж ми підемо, без них нам не вистачить людей для перемоги.."
    "Прошепотів я"
    mil "Я знаю.. Я просто створюю більший попит на нас"
    "Відповіла Міла"
    "За спино почувся шелест"
    noname "Я піду з вами!"
    "Сказав чоговік якого пограбували"
    noname "Хоч у мене вкрали все, від грошей до надії, але я більше не збираюсь стояти на місці, ви зі мною?"
    "Звернувся він до своїх товарищів по сходах"
    "Обидва чоловіки майже одночасно піднялися і майже хором сказали"
    noname "Так!"
    mil "От і добре, тоді будемо давайте знайомитись?"
    mil "Я Міла, а це Олексій"
    noname "Мене звати Артем"
    noname "Я Максим"
    noname "А я Євген"
    "Раптом з дальньої частини відсіку, що вів у їдальню почувся шурхіт"
    kok "Яке прекрасне знайомство.. Жаль тільки що воно буде не довгим"
    olek "Тепер ти будеш корчити з себе капітана?"
    kok "Я? Ні що ти.. Я просто буду попрошу своїх помічників принести нам інгридієнтів"
    kok "До речі ось і вони.."
    "Із-за його спини почали виходити охоронці псевдо-ковчега"
    "Їх було чоловік з п'ятнадцять, нас же всього п'ятеро"
    kok "Розберіться з ними швиденько, а в нагороду я дам вам добавки!"
    noname "Так, пане!"
    "Команда псевдо-ковчега наближалася швидко, зберігаючи формування"
    "Люди з обох сторін були напружені та готові до протистояння"
    olek "Тепер у нас вже немає шляху назад. Переможемо їх!!!"
    "Команда псевдо-ковчега була озброєна ножами"
    "Адреналін почав переважати в крові і не витримавши напруги я кинувся на ворога першим"
    "Чудом увернувшись від удару ножем я все ж зміг зайти одному з них за спину та взяти його на больовий"
    "В принципі це єдине що я вмів з бойових мистецтв, тільки один залом руки і все, але зараз ця навичка явно виявилась над ефективною"
    "Я почав прикриватись цим канібалом, як щитом"
    "Темрява почала грати нам на руку, оскільки вороги почали бити свого ж товариша ножами, думаючи, що це я"
    "Поки я тримав їхнього одного біля себе, інші члени моєї команди почали активно взаємодіяти з командою псевдо-ковчега"
    "Міла використовувала свої бойові навички, ухиляючись від ударів та контратакуючи з ефектними рухами"
    "Ну а сходинкове братство були досить кримезними, аби битися з командою псевдо-ковчега на рівних"
    "Це все виглядало абсолютно не правдоподібно, ніби згайка молодшокласників вийшла проти студентів університету, але ми таки почали перемагати"
    "Наша перемога ставала все більш і більш не минучою подією і ось нарешті битва добігла кінця"
    "Залишки команди псевдо-ковчега почали відступати"
    kok "Добре, боягузи, я зроблю це сам"
    "Судячи по звукам кок заправляв патрони в магазин пістолета"
    kok "Хоч я і не люблю діставати кулі з м'яса, але схоже, по-іншому не впоратись"
    "Слова кока прозвучали холодно і безжалісно"
    "Всі зупинилися, замерли, усвідомивши, що їх долі тепер у руках цього безжалісного кока"
    "Він підняв зброю і почав розстрілювати нас безжалісно"
    "Кулі пронизували повітря, розриваючи тишу і забираючи життя. Я бачив, як один за одним мої товариші падали під смертельними пострілами"
    "Незабаром, і моє тіло почало відчувати сильний біль"
    "Востаннє я подивився на Мілу, яка лежала поруч, і зізнався собі, що наші сподівання на врятовання були зруйновані"
    "Закривши очі, я почув останні удари серця, переконаний, що наша історія завершилась на цьому печальному моменті"
    scene end14
    pause
    if persistent.end14 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end14 = True
    return





# Рішення повернутись та битись (Заражений + Без бензину + Без полоненого) - Кінцівка 15
label Fight_no_refuel_not_help_kill_neighbor:
    olek "На мою думку сенсу бігти немає, тим паче, що нам ніяк не встигнути на справжній \"Рятувальний ковчег\", тож я вважаю, що нам потрібно ораганізуватись з тими хто ще не встиг вибігти і спробувати захопити цей псевдо-ковчег"
    mil "Я згодна, але тобі не здається, що нас двох не вистачить?"
    olek "Саме тому нам треба пробратись у середину і спробувати знайти тих хто ще не встиг вийти з псевдо-ковчега"
    mil "Тоді добре, тим паче, що зараз у нас є деяка перевага через те що команда псевдо-ковчега спантеличена поламкою апаратури"
    olek "От і добре, що ти і сама все розумієш, тоді рушили?"
    mil "Звісно"
    "Ми з Мілою почали своє просування до головного входу"
    "Величезна брама, що мала би зачинятись автоматично, була привідкрита між нею та стінкою була маленька шпаринка у яку пройти можна було лише боком"
    "Ось ми і в середині, тепер треба знайти людей"
    "Найлогічнішим рішенням було би пошукати їх у відсіку з каютами, тож тиди ми і направились"
    "На сходах сиділи ті самі чоловіки, яких ми зустріли коли тільки прибули сюди, вони ніби живуть на тих сходах"
    "Вони сиділи у суцільній темряві, тільки маленький ліхтарик підсвічував їх силуети"
    olek "Вибачте, панове, на борту є ще хтось окрім вас?"
    "Прошепотів я"
    noname "Ні, всі втекли.."
    "Чоловік на сходах відповідав з такю ж гучністю, що і вчора, ніби він не хотів приховати свою присуність"
    olek "А чого тоді ви тут?"
    noname "Так, а що нам ще втрачати? Все що у нас було все уже і так забрали обставини.."
    olek "А як же життя, свобода? У вас все ще є все для того щоб збудувати нове життя, тільки треба перемогти цих канібалів з псевдо-ковчега, вставайте!"
    "Не стримався я переходячи на крик"
    noname "Ти молодий та інфантильний, схоже справжнього жаху ти не пережив, тож ти ніяк не зрозумієш нас.."
    "От трясця, старі впертюхи, і що ж мені робити з ними..?"
    mil "Дай но я спробую"
    "Тихо сказала мені Міла"
    mil "Слухайте сюди, шановні!"
    mil "Можливо ми ніколи не зрозуміємо того, що ви пережили. Але ось що я хочу сказати вам: якщо ви здастесь зараз, який сенс було все це переживати? Нащо ви боролися за життя тоді, якщо не хочете боротися за нього прямо зараз?"
    mil "Якщо ви доєднаєтесь до нас ми зможемо перемогти наших ворогів і в стокої дочекатись справжніх військових, і тоді настане час, коли ми зможемо зажити повноцінним життям"
    noname "..."
    mil "Чого мовчите? {w} Язики проковтнули?" 
    mil "Подивіться на себе: ви ж чоловіки, чого така молода і гарна дівчина має вам переконувати встати та іти?"
    noname "..."
    "Чоловіки на сходах так само сиділи"
    mil "Ну і грець з вами, ходімо, Олексію, вони не здатні боротися навіть за себе"
    olek "І куди ж ми підемо, без них нам не вистачить людей для перемоги.."
    "Прошепотів я"
    mil "Я знаю.. Я просто створюю більший попит на нас"
    "Відповіла Міла"
    "За спино почувся шелест"
    noname "Я піду з вами!"
    "Сказав чоговік якого пограбували"
    noname "Хоч у мене вкрали все, від грошей до надії, але я більше не збираюсь стояти на місці, ви зі мною?"
    "Звернувся він до своїх товарищів по сходах"
    "Обидва чоловіки майже одночасно піднялися і майже хором сказали"
    noname "Так!"
    mil "От і добре, тоді будемо давайте знайомитись?"
    mil "Я Міла, а це Олексій"
    noname "Мене звати Артем"
    noname "Я Максим"
    noname "А я Євген"
    "Раптом з дальньої частини відсіку, що вів у їдальню почувся шурхіт"
    kok "Яке прекрасне знайомство.. Жаль тільки що воно буде не довгим"
    olek "Тепер ти будеш корчити з себе капітана?"
    kok "Я? Ні що ти.. Я просто буду попрошу своїх помічників принести нам інгридієнтів"
    kok "До речі ось і вони.."
    "Із-за його спини почали виходити охоронці псевдо-ковчега"
    "Їх було чоловік з п'ятнадцять, нас же всього п'ятеро"
    kok "Розберіться з ними швиденько, а в нагороду я дам вам добавки!"
    noname "Так, пане!"
    "Команда псевдо-ковчега наближалася швидко, зберігаючи формування"
    "Люди з обох сторін були напружені та готові до протистояння"
    olek "Тепер у нас вже немає шляху назад. Переможемо їх!!!"
    "Команда псевдо-ковчега була озброєна ножами"
    "Адреналін почав переважати в крові і не витримавши напруги я кинувся на ворога першим"
    "Чудом увернувшись від удару ножем я все ж зміг зайти одному з них за спину та взяти його на больовий"
    "В принципі це єдине що я вмів з бойових мистецтв, тільки один залом руки і все, але зараз ця навичка явно виявилась над ефективною"
    "Я почав прикриватись цим канібалом, як щитом"
    "Темрява почала грати нам на руку, оскільки вороги почали бити свого ж товариша ножами, думаючи, що це я"
    "Поки я тримав їхнього одного біля себе, інші члени моєї команди почали активно взаємодіяти з командою псевдо-ковчега"
    "Міла використовувала свої бойові навички, ухиляючись від ударів та контратакуючи з ефектними рухами"
    "Ну а сходинкове братство були досить кримезними, аби битися з командою псевдо-ковчега на рівних"
    "Це все виглядало абсолютно не правдоподібно, ніби згайка молодшокласників вийшла проти студентів університету, але ми таки почали перемагати"
    "Наша перемога ставала все більш і більш не минучою подією і ось нарешті битва добігла кінця"
    "Залишки команди псевдо-ковчега почали відступати"
    kok "Добре, боягузи, я зроблю це сам"
    "Судячи по звукам кок заправляв патрони в магазин пістолета"
    kok "Хоч я і не люблю діставати кулі з м'яса, але схоже, по-іншому не впоратись"
    "Слова кока прозвучали холодно і безжалісно"
    "Всі зупинилися, замерли, усвідомивши, що їх долі тепер у руках цього безжалісного кока"
    "Він підняв зброю і почав розстрілювати нас безжалісно"
    "Кулі пронизували повітря, розриваючи тишу і забираючи життя. Я бачив, як один за одним мої товариші падали під смертельними пострілами"
    "Незабаром, і моє тіло почало відчувати сильний біль"
    "Востаннє я подивився на Мілу, яка лежала поруч, і зізнався собі, що наші сподівання на врятовання були зруйновані"
    "Закривши очі, я почув останні удари серця, переконаний, що наша історія завершилась на цьому печальному моменті"
    "..."
    "Очі все ж відкрилися"
    "Можливо коли куля пробила в моє тіло, газ таки проник в мої легені"
    "Я зрозумів, що вже нічого не можна зробити, і мій долільний бій за виживання завершується невдачею, але помсту ніхто ще не відміняв"
    "Я маю повернути всю біль, яку він подарував моїм компаньйонам"
    "Я маю вбити кока"
    "Мої кістки почали проростати у зворотньому напрямку, а я зациклювався на цій ідеї втрачаючи розсудок"
    "Вбити кока... {w} Вбити кока.. {w} Вбити кока"
    "Мої очі заплющились самі собою, а тіло саме почало рухатись у напрямку ворога"
    "Я чую, що якісь звуки вилітали з його рота, але я не можу розібрати, він занадто далеко.."
    "..."
    "Після того, як я розплющив очі, моєму погляду відкрилася відкрилась картина з розстріляних тіл моїх товаришів, а переді мною - відірвана рука кока"
    scene end15
    pause
    if persistent.end15 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end15 = True
    return





# Рішення не рятувати дівчну
label Not_help_girl:
    "Все ж я не зможу її врятувати, я не вмію користуватись зброєю"
    "Цим я просто наражаю себе на небезпеку"
    "Я їй вже ніяк не допоможу"
    "Тому мені треба рятуватися самому" 
    "Я маю скористатись тим що гуманоїди відволіклися на неї"
    "..."
    "Я тихо пробрався до своєї машини та заліз у неї"
    "Двигун, як на зло не хотів заводитись"
    "Все давило на мене: і гуманоїди які шуміли в сусідньому магазині, і моє рішення не рятувати дівчну, хоч воно і було раціональним"
    "Зі злості я дуже сильно навалився на ключ"
    "Завівся!"
    "Я притис педаль в підлогу та помчав з того місця"
    "Я зітхнув з полегшенням, загроза, схоже, вже була позаду, як і дівчина яку я кинув там.."
    "Втім, це було раціональне рішення, тож немає сенсу думати про це"
    "Наступним місцем у моєму плані був давно закинутий дім"
    "Майже всі його стіни були в дірках, а отже у мене буде не поганий огляд на всі боки"
    "Їхав я туди в суцільній тиші мертвого міста, яку порушувало лише ревіння мотора"
    "В принципі цей дім був досить близько до зброярні з якої я тільки що тікав, тож доїхав я досить швидко"
    "Він таки не змінився, залишившись саме таким який я його пам'ятав"
    "Я зайшов у середину та оглянув будівлю"
    "Схоже нікого окрім мене тут нема, як і дірок на першому поверсі, отже знаходячись на другому у мене буде повний огляд на вкруги, при цьому з першого поверху ніхто до мене не завалиться"
    "От і добре"
    "Тепер мені потрібно зайняти позицію для ідеального огляду території"
    "Дивлячись на будівлю я вирішив, що ідеальним місце буде горище, оскільки криша вся була в дірках, я міг побачити майже всі підходи до будівлі не сходячи з місця, а ті що я не міг побачити стоючи на місці я міг побачити через діру у дальній стіні, тож якщо щось буде наближатись до дому я це неодмінно помічю"
    "З місцем розібрався, отже час поїсти і спати"
    "Їжі у мене вдосталь, тож витягши перший попавшийся енергетичний батончик з консервами я повечеряв і ліг в очікувані сну"
    "Сон як зазвичай ніяк не хотів приходити і мій мозок почали сверлити думки"
    "Отже, коли на місто впав метеорит з нього почав витікат зелений газ, який, схоже, перетворює людей на гуманоїдів"
    "Але не ясно як я не став таким, це через щось на кшталт імунітету, чи через те що я використовували імпровізовані фільтри"
    "Далі, судячи з того що я побачив в парку гуманоїди мають деякий централізований розум, по іншому я не можу пояснити, як вони не передаючи жодних голосних сигналів могли зібратись в одному місці разом"
    "Проте якщо також взяти до уваги те що поки я їхав по місту на мене не кидались велитенські зграї цей розум може бути чимось типу телепатичного зв'язку з обмеженим полем дії"
    "Продовжимо безглузді теорії, так як людей перетворює у гуманоїдів саме газ, можливо їх вразливим місцем є легені?"
    "Підтвердити це я поки не можу, втім спростувати так само не можу.."
    "..."
    "За роздумами як зазвичай пройшло чимало часу, але не дійшовши єдиного висновку я таки заснув"
    window hide
    scene day_3 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#eef7ee")
    pause(1.5)
    scene bg bg with fade
    window show
    "На ранок я прокинувся з чітким відчуттям недосипу та важкості в животі" 
    "Схоже вчора я повечеряв досить добре, тож їсти ще не хочеться"
    "Зібравши речі я сів у автівку та рушив у напрямку запланованого виїздаз міста"
    "Мене знову вітало мертве місто"
    "Воно ніби всім своїм видом наказувало забиратись"
    "Вулички які колись були мені рідними зараз були вкриті зеленим туманом крізь який, інколи, блимали очі мутувавших людей"
    "Я їхав досить швидко враховуючи мої дуже скудні навички водіння"
    "Місце виїзду було дость не далеко тож я доїхав туди буквально за десять хвилин"
    "Прибувши на місце я побачив, що міст зруйновано"
    "Як і мої плани"
    "Так мені не дістатись до ковчега за два дні.."
    "Схоже все скінчено треба повернутись, перегрупуватись та визначитись, як виживати у місті повному гуманоїдів"
    "Я вже почав розвертати машину, як у поле мого зору кинувся якийсь барвистий папірець"
    "Він мене зацікавив причому я навіть не знаю як, він був схожий на будь який інший рекламний буклет, але дивлячись на нього я відчував, що там щось важливе"
    "Я підійшов ближче, аби роздивитись його"
    "Замість тексту про якийсь концерт чи щось таке я помітив карту міста, на ній були перечіркнуті всі виїзди з міста окрім одного"
    "Він знаходився на іншому кінці міста"
    "І щоб дістатись до нього було необхідно перетинати найбільш заселені, колись, райони"
    "Я дістав свою карту та звірив це місце"
    "Схоже, якщо їхати через той виїзд мені доведеться їхати три дні, тож якщо я і встигну, то вже в самий останній момент перед евакуацією"
    "В будь якому випадку спробувати треба"
    "Але якщо я буду їхати через другий виїзд, що буде довше ніж я розраховував, бензину може не вистачити"
    "В той же час заїзд на заправку також забере багато часу"
    "Тому треба швидше вирішувати що зараз важливіше час, чи бензин"
    "..."
    menu:
        "Дозаправитись":
            $ is_refuel = True
            jump To_refuel_no_girl
        "Не дозаправитись":
            $ is_refuel = False
            jump Not_refuel_no_girl
    return
# Рішення дозаправитись (Без супутниці)
label To_refuel_no_girl:
    "Все ж якщо не дозаправитись, навіть із запасом часу мені може не стати бензину щоб доїхати до ковчега, тому краще все ж дозаправитись"
    "Найближча заправка має бути за декілька кілометрів звідси тож туди мені і шлях"
    "Я знову сів у автівку та рушив"
    "До заправки я доїхав через двори"
    "В одному з будинків я помітив маленьку зграйку гуманоїдів"
    "Один з них надто підозріло дивився у мій бік, але жодної активності він не видавав, тож я вирішив, що вони все ж мене не помітили"
    "На заправці було вдосталь бензину, напевно нею давно ніхто не користувався"
    "Я почав набирати пальне у бак та дістав каністру"
    "Шланг, схоже, був пошкоджений, оскільки бензин подавав він повільно, та щей деяка частина капала на землю, незрозуміло звідки"
    "Пройшло кілька хвилин"
    "Бензин все ще крапав дуже повільно, проте я вже встиг набрати повний бак та десь на одну четверту каністри"
    "Десь за будинком почувся гуркіт"
    "..."
    "Згарайка гуманоїдів вийшла з двору, яким я їхав сюди"
    "Схоже вони таки помітили мене тоді"
    "Щоб не ризикувати я сховався за колонку не чекаючи поки вони підійдуть занадто близько"
    "Гуманоїди рухались дуже впевнено, але схоже, що вони мене не помітили"
    "Отже мені залишається лише сподіватись, що так буде і на далі"
    "Вони зайняли всю вулицю та йшли роздивляючись навколо"
    "Було схоже ніби вони шукають мене, проте вони проходили повз"
    "Кроки відлунювали від стін порожніх вулиць, кожен крок гуманоїдів відчувався особливо гучним, відбиваючись у кожній клітині мого серця"
    "Їх темп був дуосить низький, тож, за відчуттями, я просидів за колонкою декілька годин, годинник же ніби намагаючись набрехати показував, що пройшло лише три хвилини"
    "Зрештою я покинув своє укриття виявивши те що каністра вже повністю заповнена"
    "Я сів за кермо озираючись, схоже жодних проявів життя немає на кілька сот метрів"
    "На диво машина зевелась досить швидко і я рушив з однією лише думкою: \"До виїзду з міста ще приблизно година, от би там все було тихо, бо ще одна сутичка за день буде вже перебором для мене\""
    window hide
    scene bg clock_11 with fade
    pause(1.0)
    scene bg clock_12 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Більша частина міста вже позаду, мені лишився останній рубіж"
    "Найважчий рубіж"
    "Потрібно проїхати колись найбільш заселений район міста"
    "Він точно заповнений гуманоїдами, як в будівлях так і на вулицях"
    "Тож їхати треба обережно, не привертаючи зайвої уваги"
    "Не видаючи жодних звуків"
    "Щоб зменшити шуми від машини я заглушив двигун, перед цим набравши швидкість якої б мало вистачити, щоб виїхати з цього району за інерцією"
    "Колеса ледве крутяться та машина все ж рухалась до виїзду"
    "Ось уже і видно табличку з перекресленою назвою міста"
    "Залишилось ще трохи і я буду у відносній безпеці"
    "Давай..."
    "Ще трохи..."
    "..."
    "По машині щось вдарило ззаду"
    "У дзеркалі заднього виду не було нічого"
    olek "Це напевно якась гілка"
    "Сказав я заспокоюючи себе"
    "..."
    # Гучний звук
    "Ззаду машини стояв гуманоїд, який нахабно тримав задні двері у руках"
    gumanoid "Гарррр!"
    "Гуманоїд прокричав так ніби кличе інших долучитись до розбору моєї автівки"
    "І схоже його родичі не були проти"
    "З усіх будівель рясним дощем почали випадати гуманоїди"
    "Всі вони явно націлились на мене і вже мчали навипередки, аби поласувати мною"
    "Треба швидко заводитись!"
    "Ключ знову, як на зло заклинило"
    "Нужбо... Нужбо..."
    "Двигун нарешті заревів"
    "Тепер думай, що далі"
    "Думай..."
    "Точно!"
    "Якщо я викину каністру підпаливши її це дасть мені шанс на те щоб вирватись"
    "Вона стояла як раз навпроти дверей які вирвав гуманоїд, отже мені лишилось придумати, як підпалити її"
    "Як же це зробити?"
    "Трясця, це напевно перша ситуація за все життя коли я пожалкував, що не курю"
    "..."
    "Точно, я ж можу розігріти підкурювач, та кинути його у бензин"
    "Я швидко перерізав мотузку, якою перемотував бензобак, аби його не трясло по дорозі"
    "Каністра стрімко вилетіла з машини та впала перед натовпом монстрів, розплескавши деяку частину бензину по землі"
    "Отже все готово.."
    "Підкурювач вилетів з машини та полетів у вже розлитий бензин, який миттєво спалахнув, утворивши деякий бар'єр з вогню"
    "Деякі гуманоїди намагались пройти через вогонь, проте підпаливши свої кінцівки вони зупинились"
    "Схоже вони зрозуміли, що вже не зможуть нас наздогнати, тож кинули в слід лише крик"
    "Крик, який звучав навіть не позвірячому, скоріше за все так звучали ті монстри під ліжком з дитинства, а їх силуєти підсилені вогнем лише підкріпляло це відчуття"
    "..."
    olek "Фухх..."
    olek "Вийшло..."
    olek "Вітаю, ми за містом"
    window hide
    scene day_4 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#d2ead1")
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч була довга, я весь час мав бути сконцентрований на дорозі і на педалях"
    "Оскільки я давно не седів за кермом, а тим паче ніколи довго не їздив, це було для мене дуже тяжко"
    "Дорога за містом була досить спокійна, тож я їхав в суцільній тищі, яку порушували лише цвіркуни, які ще не зрозуміли, що настала осінь"
    "Ранок був такий самий як і ніч, тільки до загального почуття втомленості додався ще й голод"
    "Отже мені необхідно знайти де б я міг зупинитись"
    "Пагорб, що виднівся на горизонті, як раз здавався підходящим місцем"
    "Заїхавши на нього я побачив місто з якого тікав"
    "Там був з'їзд з дороги, тож я зупинився, аби нарешті поснідати"
    "Діставши з рякзака якісь булочки я підняв очі на краєвид Києва, який відкривався з цього пагорба"
    "Він був, як на долоні"
    "Колись найприємніше для мене місто було завішане зеленим туманом, який робив із, і так не завжди приємних людей гуманоїдів, котрі намагаються мене з'їсти"
    "Але все ж який Київ гарний, звідси його видно майже повністю, від районів у яких протікала моя спокійна юність до Майдану та ..."
    olek "Сподіваюсь, що колись зможу повернутись до тебе"
    "Прошепотів я"
    "За любуванням краєвидами Києва їжа просто зникла і я знову сів за своє звичне місце"
    if is_kill_neighbor == True:
        olek "Кхе-кхе"
        "З рота вилетів зелений дим, схоже мене таки не оминула таж участь, що і Васильовича"
        "В будь якому випадку, я думаю а ковчезі мені допоможуть, тож я не можу скидати темпу"
    # Годинник міняє час з 12 на 20:30
    window hide
    scene bg clock_12 with fade
    pause(1.0)
    scene bg clock_20_30 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Все ж таки, їхати двоє суток поспіль дуже вимотуюче заняття, напевно треба зробити маленький відпочинок"
    # Очі закриваються поступово за декілька кадрів
    "Але де?.."
    # Темний екран
    "..."
    # Гучний звук сповішення
    "Що це..?"
    "Озираючись навкруги я помітив маленький дрон у небі"
    guch "Увага! Увага!"
    guch "Координати \"Рятувального ковчега\" були змінені та пересунені на схід. Тепер ковчег буде чекати на всіх у місті Плоскирів"
    guch "Повторюю, координати \"Рятувального ковчега\" були змінені та пересунені на схід. Тепер ковчег буде чекати на всіх у місті Плоскирів"
    "Дрон полетів далі залишивши мене на одинці з шимом дороги"
    "Я трохи збавив хід аби подивитись на карті куди саме мені їхати"
    "Наскільки я пам'ятаю, це має бути тут близько"
    "Вирішивши не ризикувати я таки зупинився та дістав карту"
    "Я таки був правий, це досить близько"
    "Але мене якось насторожує, що інформацію про такий крупний переніс повідомляється всього лиш дроном"
    "Та й сам переніс не виглядає надто реалістичним, це ж тобі не ларьок пересунути, це просто величезний гвинтокрил, який з чутками може евакуювати, якщо не область, то район точно"
    "Втім, навіть попри мою недовіру, мій шлях все одно лежить через Плоскирів, тож як буду там, то й перевірю"
    window hide
    scene day_5 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#bedcbe")
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла спокійно"
    "Через те що я вже відключався за кермом я зрозумів, що мені точно потрібно відпочити, і як тільки випала така можливість я спрямував машину на лісову доріжку, аби я був більш непомітний"
    "Якимось дивом, згадуючи програми про виживання з дитинства, я обладнав своє спальне місце на дереві та відрубився абсолютно без сил"
    "Я проспав приблизно 4 години, проте я відчував, що цього мені цілком вистачить, аби відновитись та бути бадьорим увесь день"
    "На данний момент я їхав вже декілька годин і ось-ось мав би прибути до нового місця \"ковчега\""
    "Його вже навіть видно на горизонті"
    "Проте він не виглядав дуже вражаючим, ніби він був менший ніж по розказам, коли цю програму тільки починали"
    "Втім, люди завжди щось-щось та й прикрасять у своїй розповіді"
    "Хоча можливо він маленький тільки тому, що я ще не доїхали до нього?"
    window hide
    scene bg clock_10 with fade
    pause(1.0)
    scene bg clock_12 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Час пролетів досить швидко і я таки прибув до Плоскиріва, а отже і на нове місце ковчега"
    "Він таки величезний, хоча не такий величезний як про нього говорили"
    "Та й таке.."
    "На моє здивування там вже стояло чимало машин схоже багато людей таки змогли вижити у тому жахітті"
    "Коли я підїхав до місця де вже стояли інші автівки до автівки підійшов чоловік років п'ятидесяти"
    "Він був досить високий, у формі схожій на щось між воєнною та діловою, на ньому були окуляри та кашкет, а під носом у нього виднілися розкішні вуса, одним словом він був статний"
    $ vla = Character("???", color="#FFFFFF")
    vla "Драстє, вітаю вас на ковчєгє"
    vla "Я капітан цього судна Владімєр Соколов, а ким ви будете, новопрєбивший?"
    $ vla = Character("Владімєр", color="#FFFFFF")
    olek "Я Олексій"
    vla "Тоже сам? В любом разі я рад, що ти тут, а пару ми тобі завжди найдьом"
    vla "Хахаха!"
    olek "І нащо б це мені було потрібно"
    "Пробурмотів я собі"
    vla "Ну как \"нащо?\" це ж ковчег, каждой тварі по парє, ну сам понімаєш.."
    olek "..."
    vla "В любом випадку, тебе щось інтересуєт?"
    olek "Може підкажете де ті що приїхали раніше за мене?"
    vla "Я тебє как раз зараз все і покажу"
    vla "Пойдьомтє-пойдьомтє"
    "Я виліз з машини та попрямував за капітаном ковчега"
    "Не зважаючи на його дивний говір, він здавався досить позитивним та надійний, принаймні мені хотілося у це вірити"
    "Владімєр відвів мене в середину ковчега, там вже було чимало людей і нарешті побачивши їх мої сумніви, що до цього місця, як рукою зняло"
    vla "Ось тут у нас главний відсік, в ньом знаходяться усі кто прибув на ковчег та їх каюти"
    vla "Якщо пройти дальше, в глиб судна, можна буде побачити їдальню та командний пункт в якому какраз живе ваш покорий слуга"
    vla "Якщо тебє буде щось інтєрєсно мої хлопці проведуть тебє екскурсію"
    jump Menu_excursion_no_girl
# Вибір екскурсії (Без супутниці)
label Menu_excursion_no_girl:
    menu:
        "Залишитись у головному відсіку та поговорити з прибулими":
            olek "Я би хотів поговрити з тими хто прибув до нас"
            if is_talk == False:
                vla "Хорошо, ето тебє сюди"
                vla "Тут знаходиться каюти прибувших, можеш там побазікати з кимось, може щось цікаве розкажуть"
                olek "Добре, так і зроблю"
                "Я попрямував у напрямку кают"
                "На сходах сиділо троє чоловіків, вони були дуже вимотані, їх очі були пустими, ніби вони дивляться крізь об'єкти прямо у вічність"
                olek "Вітаю, панове, я новенький тут, і хотів би дізнатись, як тут обстановка на кочезі, може ви мені розкажете?"
                noname "Ну, як тут обстановка, звичайна для таких місць, всі на нервах, всі пережили якесь жахіття, яке хочеться поскоріше забути"
                noname "..."
                noname "Єдине, що тут добре, так це те що добре годують, особливо м'ясо, воно тут особливо смачне.."
                olek "Вибачте, можливо це не тактовне запитання, але ви сказали, що всі тут пережили якесь жахіття, чи могли б ви поділитись, тим що сталося з вами?"
                "Очі повні пустоти піднялись на мене"
                noname "Я можу розповісти свою історію, але чи ти справді хочеш це слухати?"
                olek "Звісно, я хочу зіставити повну катрину, того що сталось"
                # Про  копіювання гуманоїдом
                noname "Тоді, добре"
                noname "Я почну з того, що початок цього апокаліпсису я зустрів не вдома, я був у сауні з друзями"
                noname "Ми сиділи, щось парились, реготали як зазвичай, і тут як бахне щось"
                noname "Ми вибігли на вулицю, аби подивитись що це було, але нічого не побачили, тож вирішили, що це, напевно, фура десь не подалік проїхала"
                noname "Тож ми знову зайшли в лазню, і сиділи там нічого не підозрюючи"
                noname "Коли ми вже збирались їхати по домівках, я помітив, що Вадим кудись подівся"
                noname "Я власне пішов його шукати, бо малолі що могло статися з людиною після лазні, це ж все серйозно"
                noname "Ходив я ходив, але все не міг знайти, аж раптом омітив якийсь дивний силуєт в лісі"
                noname "Я подумав, що це Вадим та вирішив підійти ближче"
                noname "З лісу тоді саме стелився якийсь зелений газ, але я не сильно звернув на це увагу"
                noname "Я гукнув його, але у відповідь нуль реакція"
                noname "Я підійшов ближче та гукнув його ще раз"
                noname "Тепер він нарешті обернувся, але виглядав він якось дивно"
                noname "Він стояв навпроти мене у порваних лахах та просто дивився на мене"
                noname "Коли я помітив, що його очі вже були з чорним белком, я подумав, що щось не так, але все ж не кидати ж друга ось так у лісі, ще й з якоюсь болячкою"
                noname "Я покликав його ще раз, і він почав кривлятись, імітуючи мої рухи ротом"
                noname "Це було дуже дивно, але я все ж не залишав надії, що йому просто стало погано"
                noname "Я гукнув його знову, на що він відповів агресивним стрибком у мій бік"
                noname "Він опинився на світу і тільки тоді я помітив, що це вже був точно не Вадим"
                noname "Тож я вирішив, що якщо не робитиму жодних різких рухів, можливо я зможу здобути собі фору"
                noname "Я намагався робити максимально повільні кроки назад"
                noname "І вгадай, що почав робити це падлюка.."
                noname "Він почав робити кроки назад намагаючись наслідувати мене"
                noname "Це мене дуже лякало, і я крикнув йому, щось тупу: \"А ну, закінчуй це, Вадиме!\""
                noname "На що він у відповідь почав ворушити губами, дуже дивно кривляючись, ніби він намагався наслідувати кожен мій рух"
                noname "Тоді, я зрозумів, що він намагається вчитись бути мною і я втік"
                noname "Він намагався мене наздогнати, проте хлопці які вже з півгодини чекали на наше повернення були готові стартувати, але ніхто не думав, що доведеться стартувати від Вадима"
                olek "Ясно, може й ви розкажете свою історію?"
                # Про пограбування
                noname "Та мені то особливо нема що й розказувати, єдиний висновок, який можна зробити з моєї історії, що люди залишаються людьми в будь яких умовах"
                olek "А може більш докладно поділетесь?"
                noname "Та було б чим.. Тут як у тому анекдоті, немає речей, нема й історії"
                olek "Всенсі?"
                noname "Та господи, що ти хочеш почути?"
                noname "Жив був я, коли все це сталось я з сім'єю намагався виїхати з міста, на північ звідси, а на виїзді нас зупинили грабіжники, забрали все, гроші, машину та й все цінне, що було з собою, блааго одяг лишили"
                noname "Довелося пішки йти сюди, добре що хоч ковчег перенесли поближче, і не довелось іти через пів країни"
                olek "..."
                olek "А ви пане, можете поділитись своєю історією?"
                # Про останнього вижившого
                noname "Ти точно хочеш послухати, тобі не вистачає свого болю?"
                "Я з впевненістю кивнив"
                noname "Тоді, слухай.."
                noname "Навіть не знаю з чого почати, напевно ж з початку.."
                noname "Я жив в Дніпровському районі, був звичайним роботягою, що пів життя працював на будівництві"
                noname "Як і всі знайомі я також дивились телевізор, та бачив новину про наближення метеориту"
                noname "Як і багато хто я не вірив у можливість падіння метеориту, та що він міг принести щось що переверне світ"
                noname "Ніби жартома ми з кологами всеж домовились, що якщо що збираємось усі разом та їдемо з міста калонною"
                noname "Коли це сталось ми всі зібрались та готувались виїзжати, лише один з нас запізнювався"
                noname "Ми вже збирались їхати йому на допомогу, але він всеж приїхав і якось дивно кашляв"
                noname "Він сказав, що мутант напав на нього, але він зміг його вбити"
                noname "Згодом, десь на другий день шляху, ми почули з дрона інформацію про перенесення ковчега та почали їхати сюди"
                noname "Так як їхати сюди було явно ближче, ми вирішили зупинитись на ночівлю"
                noname "Якби ж не це..."
                noname "..."
                "Чоловік явно знітився"
                olek "Що, що було далі?"
                noname "А далі я побачив, як ця мразота, натовпом накинулась на наш табір поки я ходив по хмиз для багаття"
                noname "Вони не залишили живими нікого"
                noname "Я вже був готовий померти разом із своєю сімєю, але тіло.."
                noname "Тіло мене не слухалось і я просто заціпенів від страху"
                noname "Розумієш.. Я просто стояв та дивився, як моїх найближчих лидей роздерають на шмаття..."
                olek "..."
                "..."
                vla "Олексію, йди но сюди!"
                olek "Дякую, що поділились, я це дуже ціню"
                olek "Бувайте"
                noname "Бувай, хлопче, бережи тебе господь"
                "..."
                vla "Ну, як поговорив?"
                olek "Та, як бачите... Вони пройшли через таке жахіття, я навіть боюся уявити як це можливо пережити"
                vla "Отож бо і воно."
                olek "..."
                $ is_talk = True
                jump Menu_excursion_no_girl
            else: 
                vla "Тобі хіба не вистачило тих історі? Іди краще глянь щось інше..."
                jump Menu_excursion_no_girl
        "Піти у їдальню":
            olek "Я хочу оглянути їдальню"
            if is_eat == False:
                vla "Хорошо, тогда знакомся це наш кок Григорій Смаколюбов, він проведе тебє ексурсію до їдальні та покаже тебє свою кухню"
                olek "Приємно познайомитись"
                kok "Мені так само, солоденький"
                kok "Тож, ходімо за мною, я тобі все покажу"
                "Ми з коком рушили у напрямку носа ковчега, схоже їдальня була прямо по середині судна"
                kok "Отже, ось і їдальня, місце де всі ситі і добрі"
                kok "Тут у нас все дуже простенько, проте мінімалізм нинче в моді, тож так напевно і краще"
                "Їдальня і дійсно була досить простою, в чомусь навіть схожа на шкільну"
                "Столики спаяні разом із лавочками, розставлені дуже близько один до одного, напевно між ними може пройти лише одна людина"
                kok "У нас, до речі, скоро обід, тож ти скоро і сам спробуєш все що тут побачите"
                olek "Це добре, буду чекати з нетерпінням"
                olek "До речі, а коли у вас тут обід"
                kok "Взагалі то, не у \"вас\", а у \"нас\", а так о 14:00, якщо нічого не станеться"
                kok "Але то таке"
                kok "В їдальні особливо нема на що дивитись, тож запрошую до кухні, от там вже все найцікавіше"
                "Кок завів мене до невеликої кімнатки з боку від їдальні"
                "Вона була дійсно облаштована досить добре, на противагу їдальні з около-радянською мебеллю, тут все знаряддя, пічки та таке інше було сучаним"
                kok "Саме тут і твориться магія!"
                "Розсміявся він"
                kok "Ось тут у нас щось на зразок складу" 
                "Він вказав на чималий холодильник, що знаходився у іншому краю кімнати"
                kok "Тут зберігаються всі продукти , їх має вистачити на 2-3 тижні, заежно від кількості прибулих на ковчег"
                kok "А ось тут зберігаються вся наша утварь та ножі"
                kok "Також зі мною ще працюють двоє помічників, але зараз вони пішли на вилазку разом з віськовими"
                olek "А нащо потрібні вилазки, якщо всі продукти вже і так на борту?"
                kok "Ну як, \"для чого?\", для того щоб добрати деякі ресурси, я ж казав, що харчів вистачить на 2-3 тижні, а якщо щось піде не так, на що люди будуть жити? Не жерти ж їм один одного..."
                olek "Он воно як.. А я думав, що вас вже всім забезпечили перед вильотом"
                kok "Ну ми теж так думали, але ж ти знаєш в якій країні ми живемо..."
                olek "..."
                kok "Ну добре, не будемо про погане, в принципі я тобі вже все показав, якщо є ще якісь питання то задавай"
                if is_talk == True:
                    olek "Ну не сказав би що це прямо питання, але я чув що у вас дуже смачне м'ясо"
                    kok "Та ні, моє м'ясо не смаче, смачно я його лише готую"
                    "Розсміявся кок"
                    olek "Хе-хе"
                    "Ніяково посміявся я"
                    kok "Доречі, якщо ти вже спитав про м'ясо, може ти хочеш бути першим хто спробує сьогоднішній обід?"
                    olek "Чесно кажучи не відмовлюсь, а що у нас на обід?"
                    kok "Власне, це локшина з м'ясом"
                    "Кок поставив маленьку піалочку супу, який виглядав не надто апетитно, але аби не засмучувати кухаря, я всеж вирішив спробувати"
                    kok "Ну як?"
                    olek "Хоч на вигляд він здався мені занадто жирним, але на смак дуже смачно"
                    kok "Отож бо і воно, головне ж не те що ззовні, головне те що в середині, ти так не вважаєш?"
                    olek "Так, ви повністю праві"
                    kok "Можливо у тебе зараз з'явислись якісь питання?"
                    olek "Та ні, питань більше нема"
                    kok "Ну от і добре, тоді можемо повертатись, тільки про обід нікому ні слова, хочу щоб це був сюрприз"
                    olek "Добре, я збережу це в таємниці"
                    "Кок розсміявся"
                    kok "Тоді, до обіду!"
                    "Сказавши це кок відвів нас назад до головного відсіку"
                else:
                    olek "Так то, питань у мене немає"
                    kok "Ну от і добре, тоді можемо повертатись"
                    "Ми з коком  попрямували у зворотньому напрямку і вже за декілька секунд опинились у головному відсіку"
                $ is_eat = True
                jump Menu_excursion_no_girl
            else: 
                vla "Так ти ж вже був в їдальні, не відволікай вже кока, іди, он, краще ще щось подивись..."
                jump Menu_excursion_no_girl
        "Піти в командний центр":
            if is_command == False:
                vla "Вот, ми і дістались самого цікавого, мого робочєго мєста"
                vla "Пойдьом, зараз ти побачите св'ятиню всєх кто потрапляє на це судно"
                "Ми попрямували в глиб ковчега"
                "Командний пункт був в носі ковчега, тож нам потрібно було пройти каюти прибувших, їдальню, і аж тоді дістатись до командного пункту"
                "Хода капітана була дуже шидка, а кроки широкими, я ледве встигав за ним, але через цей високий темп ми дійшли до командного пункта досить швидко"
                vla "Такс, уважаємий, ти готов побачити найголовніше, що є на цьому судні?"
                olek "Т-так звісно"
                vla "Тогда, пусті нас товаріщ!"
                "Охоронець швидко відійшов відкривши прохід"
                vla "Смотрі, ось він, пункт на якому і проходить керування цим мєстом"
                "Навкруги було чимало апаратури, все мерехтіло та переливалось"
                vla "Ось кнопка, яка вмикає гучномовець, хочете штото сказати?"
                menu:
                    "Звісно хочу":
                        olek "Так звісно хочу"
                        vla "Оце настрой, я понімаю. {w} Давай, на щьот три.."
                        vla "Раз. {w}Два. {w}Три"
                        $ user_massage = renpy.input("Що ви хочете сказати прибувшим на ковчег?")
                        guch "[user_massage]"
                        mil "І щоб це мало значити?"
                        olek "Та так.. не звертайте уваги"
                    "Щось я не певен":
                        olek "Щось я не певен, що мені є що сказати.."
                        vla "Та нє дрєйфь, просто скажи, што першим приходить у голову"
                        vla "В будь якому разі, коли тобі ще така можливість випадьот?"
                        olek "Ну я навіть не знаю"
                        olek "..."
                        olek "Хоча, знаєте, я дещо придумав, давайте я спробую"
                        vla "Тоді я тисну ти кажеш.. на рахунок три"
                        vla "Раз... {w}Три!"
                        "Капітан явно намагався застати мене в зненацька, і у нього це вийшло, але із деякою затримкою я все ж сказав, що придумав"
                        init python:
                            import os
                            user_name = os.environ.get("USERNAME")
                        guch "Нехай живе [user_name]!"
                        vla "Ахахахаха! Ото ти даєш, шкєт, я то думал ти зараз щось серйозне ляпнеш, а ти, ахаха!"
                        vla "До речі, а хто це твій [user_name]?"
                        olek "Та так, один знайомий любитель почитати всяке, не звертайте уваги"
                    "Не хочу":
                        olek "НІ, дякую, я щось не хочу"
                        vla "Ну, как занєш, мойо дело предложить, как говорітся"
                vla "Добре, тоді продовжимо"
                vla "На всякий случай у нас тут є аварійний вихід, в принципі вони розкидані по всьому кочєгу, але зараз вони забарикадовані, шоб гуманоїди не могли через них залізти"
                vla "Також у нас тут є багато разнообразних систем контроля, як і на всіх інших апаратах такого плану"
                vla "В принципі показувати тут ще багато, але без знань в області літаків та гвинтокрилів всі пояснення будуть майже пустим звуком, так шо пропоную завершувати нашу екскурсію"
                vla "Чи є у тебя якісь питання по тому що я тобі показав?"
                olek "Та ні, наче нема"
                vla "Тоді вертаймось до головного відсіку"
                "Ми з капітаном так само швидко напрвився до головного відсіку"
                $ is_command = True
                jump Menu_excursion_no_girl
            else: 
                vla "Ти ж вже бачив наш командний центр, я думаю на сьогодні тобі хватіт тайн, іди краще ще щось подивись"
                jump Menu_excursion_no_girl
        "Піти відпочити" if is_talk == True and is_eat == True and is_command == True:
            olek "Дякую за все, проте тепер я б краще відпочив"
            olek "Можете показати де це можна зробити?"
            vla "Да, звісно"
            vla "Із свободних єсть каюта на другому поверсі, я провєду"
            "Він провів мене на другий поверх, там дійсно залишилось не так багато кают"
            vla "Ну значіца, можеш розміститись в етой каютє і відпочівати"
            olek "Добре, дякую, до побачення"
            vla "Пака, хлопче"
            "..."
            "Зайшовши в каюту я побачив дуже маленьку кімнатку, хоча воно й не дивно, все ж треба вмістити побільше людей"
            "Кімнатка була дійсно маленька, проте обладнана вона була добре, навіть краще ніж у тому гуртожитку у якому приойшли мої студентські роки"
            "В принципі тут було все чого мені не вистачало там: приємне ліжко, туалет не на поверсі та відсутність тарганів"
            "Проте знаючи, що мені довелось пережити для того щоб опинитись тут, я б волів залишитись у тому старому гуртожитку, аби тільки усього цього не було"
            "Втім це все вже сталось, я тут, тож все що мені залишається - це просто чекати завтрашньої евакуації"
            "Як тільки я приліг на ліжко м'яке, приємно пахнуче, я згадав той час, коли ми щороку їхали на море з батьками"
            "Ця кімнатка дійсно була чимось схожа на купе укрзалізниці, хоча і трохи більша"
            "Засинаючи я відчув теж саме хвилювання, як і тоді..."
            "В дитинстві..."
            jump To_rest_no_girl
    return
# Нічого не робити (Без супутниці)
label To_rest_no_girl:
    window hide
    scene day_6 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#b5deb5")
    pause(1.5)
    scene awakening_1
    window show    
    ""
    scene awakening_2
    "..."
    scene awakening_3
    ".."
    scene awakening_4
    "Я вдома?"
    "Невже це був сон?"
    scene kovcheg_room
    "..."
    "Ні, це точно не моя кімната, а те що сталось явно не сон"
    # Звукове сповщення, типу будильника, але не маханічного
    guch "Добрий ранок, гості ковчега, запрошуємо вас на сніданок, тільки поспішіть, бо він триватиме всього півгодини, замість звичайної години"
    guch "Повторюю, сніданок триватиме всього півгодини, завість звичайної години"
    "І до чого б це?"
    "Чесно кажучи з моменту, як ми потрапили на ковчег мене не полишає відчуття, що, ніби всі забули, що відбувається назовні"
    "Цей капітан із своїми екскурсіями, це повідомлення про тривалість сніданку навіюють лише відчуття якогось дитячого табору, а не рятувальної міссії"
    "Чесно кажучи мене це трохи бентежить, але краще вже так, ніж щоб всі сиділи в просякнутих валер'янкою каютах та чекали на те що їх врятують"
    "В будь якому випадку, треба поспішити на сніданок, бо хто зна коли нас ще погодують після евакуації"
    "Я вийшов з каюти та попрямував до їдальні"
    "Там вже стояла велика черга на вхід, яку довелося вистояти, але я все ж дістався місця призначення зайнявши столик з їжею"
    "На вчорашній вечері мене не було, тож це перший раз, як я пробую тут нормально поїсти"
    "Що цікаво, моє вчорашнє порівняння про шкільну їдальню підтверджується сьогодні тим що вся їжа вже розставлена на місця, чекаючи щоб її хтось з'їв, та й раціон сильно не відрізнявся"
    "Сьогодні на сніданок подавали гречку та м'сний стейк"
    "Чесно кажучи я не дуже полюбляю нажертись прямо з ранку, я скоріше залив би гречку молоком додавши туди цукор, а стейк я би взагалі залишив на обід, але повертаючись до того що після сніданку, ми можливо не скоро поїмо, це не поганий варіант набратись енергії на довго"
    "..."
    "Їжа була досить смачна, а особливо м'ясо, як і казали інші прибулі на ковчег"
    "Я встав, відніс пусті тарілки та попрямував до виходу"
    "До мене підійшов капітан"
    vla "Можно тебе на секундочку"
    olek "А що таке?"
    vla "Та нічого такого, просто треба твоя допомога"
    olek "Ну, добре"
    vla "Тогда відійдемо.."
    "Ми з капітанов відійшли на кілька метрів в бік"
    olek "Так що ви там хотіли?"
    vla "Та, я ось хотів щоб ти допоміг принести декілька бутлів води"
    vla "Наші хлопці просто ходили на вилазку в місто та набрали трохи, а віднести нема кому"
    olek "Але чому саме я?"
    vla "Ну от подобаєшся ти мені, ти якийсь надійний, чи що.."
    vla "То як допоможеш?"
    olek "Добре...Звідки хоч ті бутлі брати, і куди нести?"
    vla "Та он там, біля входу, а нести власне сюди, в їдальню"
    vla "Ти парубок міцний, за пару ходок все і донесеш"
    olek "..."
    vla "Дякую тобі, виручив..."
    vla "Ну добре, я пішов"
    olek "Куди? А бутлі?"
    vla "Які бутлі? Ти бачив хоч раз, щоб капітан бутлі таскав.."
    "Розсміявшись він миттєво зник у командному центрі"
    "Ось так завжди, Льоха працюй, а ми, капітани, таким не займаємось"
    "..."
    "З іншого боку я і хотів чимось допомогти, не сидіти ж мені весь час до евакуації без діла"
    "Я дійшов до входу, там стояло чотири бутлів по дев'ятнадцять літрів"
    "Я такі ще ніколи не носив, навіть не знаю, як до них підступитися"
    "Напевно краще все ж не ризикувати спиною та носити по одному"
    "Я підняв перший"
    "Ну, рушили..."
    "..."
    "Таскав я бутлі досить довго, проте вже переніс майже всі, лишився лише один"
    "Схоже, моя скудна фізична підготовка дає про себе знати"
    "Восьмий бутль дається вже дуже тяжко, напевно треба буде робити декілька зупинок"
    "..."
    "Ну добре, останній ривок і я закінчу з цим дорученням"
    "Погнали..."
    "Я закинув бутль собі на плече, але ноги підкосились та я почав падати назад"
    # Звук типу "Бух!"
    olek "Ай-ай-ай.."
    "Я таки вдарився головою а бутль випав з рук"
    "Бутль.. Бутль.."
    "Доречі де він, щось я не бачу.."
    "Я почав крутитись довкола, і озернувшись побачив, що на місці де раніше була суцільна стіна, зараз була чимала дірка"
    "Бутль лежав по ту сторону стіни"
    "Із-за стіни віяло холодом, а  в середині було дуже темно"
    "Коли нам проводили екскурсію ковчегом про це місце нічого не казали"
    "Чи варто мені його перевірити?"
    "..."
    "Вирішувати треба швидко, поки ніхто ще не помітив"
    $ time = 7
    $ timer_range = 7
    $ timer_jump = 'Timer_cell'
    show screen countdown
    menu:
        "Перевірити підозрілий відсік":
            hide screen countdown
            if is_refuel == True:
                jump Check_cell_no_girl
            else:
                jump Check_cell_no_girl_no_refuel
        "Проігнорувати відсік і просто забрати бутль":
            hide screen countdown
            if is_kill_neighbor == False:
                jump Not_check_cell_no_girl
            else: 
                jump Not_check_cell_no_girl_kill_neighbor
    return
# Рішення перевірити підозрілий відсік (Без супутниці)
label Check_cell_no_girl:
    "В принципі немає нічого дивного в тому, що нам щось не показали, все ж ми не команда ковчега"
    "Проте саме це місце викликає у мене багато сумнівів та підозр"
    "Можливо я таки не помилявся, коли сумнівався у правдивості переносу"
    "Все ж мені треба перевірити цей відсік, щоб я був повністю спокійний та міг довіритись команді ковчега"
    "Тож, включивши ліхтарик на телефоні, я заходжу"
    "..."
    "Світла ліхтарик давав дуже мало"
    "В кімнаті смерділо протсо нестрепно"
    "Температура тут досить низька, можливо це якийсь відсік для зберігання їжі"
    "Це ж звичайна практика тримати їжу у холодильнику, я сотні разів бачив такі на ринках, тож чому б такого холодильника не могло бути тут"
    "У спробах заспокоїтись думав я, але щось таки не давало мені спокою"
    "Я вирішив, що пройдусь до іншого кінця кімнати, аби все ж бути впевненим"
    "Ліхарик світить дуже слабко, напевно щоб побачити хоч щось мені треба буде впертись у це носом"
    "Не встиг я це подумати, як на світло все ж потрапив, якийсь об'єкт"
    "Підійшовши ближче у незрозумілому силуєті мені вдалось розгледіти..." 
    "Людську руку?.."
    "Ні, це точно не могла бути вона, це напевно світло, якось неправильно падало"
    "Це ж не може бути рука, правда?.."
    "У цей момент увімкнулось світло"
    "Я швидко сховався за одним із стендів"
    "Озираючись я намагався знайти тіні, або відображення у плитці, аби зрозуміти хто це йде, проте поки я шукав хоч якісь зачіпки на те хто це може бути я встиг роздивитись усе що було у тій кімнаті"
    "Навколо висіли пошматовані тіла людей, вони були у такому ж стані, як худоба у м'ясних відділах ринків"
    "Я намагався себе переконати, що мені все це мариться, але кожен раз коли я підіймав погляд, людські частини тіл вривались мені в очі"
    "Невже, це місце не є місцем порятунку?"
    "Мої думки перервав грубий голос, що лунав зі сторони дверей"
    kok "Шо цей довбень так довго носить ті бутлі"
    noname "Та, яка різниця, забий на нього"
    "Голоси невпинно наближались"
    kok "Ну так то воно так, але з чого мені робити юшку"
    "У кількох метрах від мене почувся брязкіт ланцюгів"
    noname "Та нічого, встигниш ще, вони все одно звідси не планують валити, ми ж типу рятуємо їх"
    kok "..."
    kok "Як ти думаєш, з чого краще робити бульйон, з ноги чи все ж з руку?"
    noname "Навіть незнаю..."
    noname "Ну дивлячись на цього товстуна, думаю краще все ж з ноги, ще й м'ясо в суп буде"
    kok "Напевно ти правий..."
    "В кімнаті пролунав хрускіт кісток"
    kok "Дідько, міцна кістка"
    "Звук повторився"
    kok "О, от так би одразу.."
    kok "Ну добре, хапай це та тягни на кухню"
    noname "Слухаюсь, пане"
    "Тіні почали прямувати до виходу"
    "Світло знову вимкнулось"
    "Тепер я вже ні в чому не сумнівався..."
    "Ніякого переносу ковчега не було, нас всіх просто заманили в пастку, ніхто навіть не думав нас рятувати, все це створено лише для того аби з'їсти нас"
    "Тож єдиний висновок, який у мене є це те що команда цього псевдоковчега - канібали, а ми тут для поповнення їх запасів"
    "Я недозволю цього!"
    "Ми боролись за виживання з гуманоїдами, що перевершують людину в усіх показниках, отже зможемо поборотись і з людьми"
    "Я маю попередити всіх та вшиватись звідси"
    "Для цього мені треба відіграти дурника, який ні про що не здогадується, аби проникнути у командний пункт і звільнити всіх"
    "..."
    "Я швидко виліз з таємничого відсіку захопивши з собою бутль"
    "Після того, що я побачив, я навіть не помітив, який важкий бутль та даніс його досить швидко"
    kok "О, дякую, друже"
    kok "Не сильно ухекався?"
    "З усмішкою сказав кок"
    olek "Чесно кажучи так, але я вже встиг відпочити"
    kok "Ясно, ну от і добре, тоді чекатиму тебе на обіді"
    "Як двозначно звучить ця фраза від канібала..."
    olek "Так, я теж буду з нетерпінням чекати, до побачення"
    kok "Бувай"
    "Тепер мені треба забиратись звідси.."
    "Заберу все необхідне та буду тікати"
    "..."
    "Я зайшов до своєї каюти, забрав пістолет, ключі від машини та парочку консерв"
    "Все це дуже зручно помітилось у кишені, особливо не викликаючи підозр"
    "Знову прокрутив побачене у себе в голові, щоб переконатись, що це не можна було сприйняти ніяк інакше та рушив у командний центр"
    "Шлях до нього досить короткий, проте зараз він тягнеться цілу вічність"
    "Я відчуваю кожен крок, кожну секунду, кожен удар серця"
    "В цей момент в голові лишилась лише одна думка: \"Хоч би я не помилився...\""
    "Проте це не має мене відволікати від цілі"
    "Ось уже і видно командний центр, а отже у мене лишилась одна мить аби зібратись"
    noname "Стій, куди зібрався?"
    olek "До капітана, він просив зайти"
    noname "Дивно, він же пішов тільки що.."
    olek "Напевно забув..."
    olek "Може я його всередині почекаю?"
    noname "Ні, чекайте тут"
    olek "Ну, добре, як скажеш.."
    "Я став біля охоронця в очікуванні капітана"
    "Звісно ж капітан мені тут не потрібен, він буде лише заважати, до того ж довго чекати я не можу"
    "І що ж робити?.."
    "..."
    "Єдине рішення оглушити охоронця"
    "Я зайшов у його сліпу зону та наніс удар руківям пістолету йому точно в потилицю"
    # Звук удару по шолому
    "Охоронець впав"
    "Схоже спрацювало"
    "Я затягнув охоронця в середину, а сам підбіг до пульту керування"
    "Кнопок там дійсно було багато, але потрібна мені лише одна.."
    "Кнопка для ввімкнення гучномовця"
    "Капітан розповідав про неї, тож я запам'ятав як вона приблизно виглядає"
    "Тож тисну.."
    # Звук сповіщення
    "Я натиснув на кнопку та почув гучний сигнал сповіщення"
    guch "Шановні пасажири ковчега, до вас звертається новий капітан судна, Олексій"
    guch "Двадцять хвилин тому мною було викрити єдиний відсік, який не демострували жодному з нас"
    guch "У тому відсіку зберігались людські частини тіла, які на цьому судні використовуються, як їжа"
    guch "Звідси слідує висновок, що команда ковчега - канібали, а нас сюди заманили, аби поповнити їх запаси їжі"
    guch "І останнє, це місце не є \"Рятувальним ковчегом\", нас ніхто не врятує, а отже ми самі маємо рятуватись"
    guch "Біжіть звідси, та бережіть себе"
    "Промова вийшла трохи слабкувата, проте я сподіваюсь вона все ж буде мати свій ефект"
    "Отже тут я закінчив і мені лишається лише тікати"
    "Я розвернувся та попрямував до чорного виходу"
    vla "Не так бистро, хлопче!"
    vla "Ти мнє відповіси за це!"
    mil "Я так не думаю"
    "Я дістав пістолет та націлив на нього"
    vla "Ти ж не стрільнеш.. Ти слішком мягкотел.."
    # Звук стрільби
    "Я стрільнув псевдо-капітану в плече"
    vla "Курва!"
    olek "Ти зовсім мене не знаєш, але я знаю все про вас.."
    vla "І що ж ти з цим зробиш? Здаси мене поліції?"
    vla "От тільки всім глибоко насрати, у нас тут апокаліпсис, якщо ти не забув.."
    olek "Замовкни вже.."
    "Я вдарив псевдо-капітана руківям пістолета по макітрі і він відключився"
    "Зваживши всі за та проти я залишив знерухомлене тіло псевдо-капітана тут, проте забрав зі столу ключницю" 
    "До неї було доєднано чимало ключів, хоч один та й мав згодитись десь"
    "Тепер я можу йти"
    "Я відчинив двері чорного ходу, який схоже і дійсно був чорним"
    "Навколо було досить темно, але на виході все ж було світло"
    "Світло, що символізувало свободу та виживання"
    "Біля виходу стояли клітки в яких лежали кістки, в цьому місті такому не дивуєшся, але все ж трохи лячно"
    "В одній із кліток почувся шурхіт"
    "За мить в тій клітці з'явилися дві білі цітки"
    "З клітки прозвучав насилу вичавлений звук"
    $ rom = Character("???", color="#FFFFFF")
    rom "Врятуйте..."
    "Я підсвітив ліхтариком клітку"
    "В ній стояв, чоловік дуже слабкий, змучений і без однієї руки"
    rom "Врятуйте, молю вас..."
    "Судячи з його стану він не зможе протриматись у тій клітці довго, проте також він маловірогідно зможе вижити у світі повному гуманоїдів"
    "Якщо я його врятую, совість не дозволить залишити його тут, але здоровий глузд підказує, що він буде лише плутатись під ногами і є великий шанс загинути через це"
    "Вирішувати треба швидко, доки за нами не з'явилась погоня"
    "Тож, що ти вирішиш Олексію?.."
    "..."
    menu:
        "Врятувати полоненого":
            if is_kill_neighbor == False:
                jump Help_captive_no_girl
            else:
                jump Help_captive_no_girl_kill_neighbor
        "Не рятувати полоненого":
            if is_kill_neighbor == False:
                jump Not_help_captive_no_girl
            else:
                jump Not_help_captive_no_girl_kill_neighbor
    return
# Рішення врятувати полоненого (Без супутниці) - Кінцівка 16
label Help_captive_no_girl:
    "І все ж я не можу просто залишити його тут"
    "Я маю його врятувати"
    "Можливо на ключниці є ключі від цієї клітки?"
    "Я підсвітив ключницю ліхтариком та почав порпатись у ній"
    "Ні це за великий..."
    "Цей замалий.."
    "Цей плаский"
    "Часу було не так вже і багато, але я все ж маю врятувати його"
    "Нарешті, це точно має бути він"
    "Ключ увійшов у замок та відчинив його"
    rom "Дякую, вам пане, я вік не забуду вашої доброти"
    olek "Та ну тебе, на моєму місці кожен вчинив би так само"
    rom "Ну не скажіть.."
    olek "В будь якому випадку, якщо я тебе врятував, то тут вже не залишу, поїхали з нами?"
    rom "А можна?"
    olek "Звісно, чого ж ні"
    rom "Дякую вам, пане"
    olek "Тебе до речі як звати?"
    rom "Роман, а вас?"
    $ rom = Character("Роман", color="#FFFFFF")
    olek "Олексій, приємно познайомитись"
    rom "Навзаємо, пане"
    olek "Добре, за нами вже має бути погоня, тож поспішимо"
    rom "Добре, пане"
    "Ми вийшли на двір"
    "В ключниці було одназу кілька ключів схожих на ключі від машин, але лише на одному був дармовис з кнопками відкрити, тож вібір був очевидний, яка машина відкриється по натисканню на цю кнопку, така і буде нашою"
    # Звук відкривання машини (типу пік-пік)
    "Звук лунав від шикарного джипа"
    olek "Схоже доля нарешті вирішила вирішила нас винагородити"
    rom "Доля завжди прихильна до тих хто цього заслуговує"
    olek "Напевно, ти правий.."
    "Ми залишили псевдо-ковчег та сіли у машину, після чого відїхали на кілька-сот метрів від псевдо-ковчега, аби не попастись у руки розлюченого екіпажа"
    olek "Отже, поки ми ще не відїхали, давайте вирішимо куди нам далі їхати?"
    olek "Більшість людей вже не вірять у існування \"Рятувального ковчега\", тож просто розїхались у різних напрямках, а ті що все ж вірять у ковчег вже напевно досить далеко"
    olek "Як ви вважаєтє, чи є сенс спробувати доїхати до попереднього місця ковчега, чи все ж це буде марна витрата бензину і нам краще спробувати придумати інший план?"
    rom "Я за те щоб їхати до минулого місця ковчега, бо є високі шанси на те що це справжній ковчег, а якщо ні, то там явно мають бути такі ж обдурені люди, як і ми, тож ми зможемо обєднатись з ними в групу"
    rom "Але в будь якому випадку вирішувати вам, пане"
    olek "Я думаю, що це оптимальний план"
    olek "Їдьмо.."
    "Нарешті ми рушили"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла досить спокійно, проте все відчувалось як в тумані" 
    "Через декілька днів я напевно вже і не згадаю жодної фрази, яку я почув в ночі"
    "Зараз на годиннику десята п'ятдесят, до відбуття ковчега лишилось трохи більше двох годин, а ми досі не доїхали туди"
    "Мені здалося дивним, що за весь час, з моменту, як ми виїхали з псевдо-ковчега, ми не бачили жодного гуманоїда, проте так навіть краще"
    "..."
    "В подорожі прийшла ще година"
    "На горизонті нарешті з'явився велечезний гвинтокрил, це означало, що наш шлях майже закінчений"
    "Але також в двуїста метрах від нас майоріла велечезна зграя гуманоїдів, що прямували в сторону ковчега"
    "Їх було так багато, що дивлячись на них мені ввижався велечезний живий організм, що плететься своїми волохатими лапками пожираючи дорогу перед собою"
    "Схоже нам доведеться якимось чином продертися через цей натовп, тож я піддав газу"
    olek "Тримайтесь, зараз буде трохи жорсткувато!"
    "Машина продералась крізь весь той натовп гуманоїдів"
    "Вони намагались залізти на машину, та збивали один одного"
    "Деякі з них падали під колеса, чим сповільнювали нас, проте машина все ж була досить потужна і у нас таки вийшло продертись через жах, але тепер гуманоїди прямували не на ковчег, а саме за нами"
    "Я намагався їхати максимально швидко, як тільки вмів"
    "За рахунок цього ми досить швидко прибули до ковчега"
    "Коли ми прибули до місця де вже стояло багато машин по гучно мовцю до нас звернувся військовий"
    guch "Зупиніться!"
    "З неохотою я зупинився"
    olek "Але ж погоня.."
    "Тільки я подумав про це, як я почув дуже багато пострілів"
    "З верху ковчега по гуманоїдам був відкритий вогонь"
    "Через декілька секунд від їх величезної зграї не залишилось нікого живого"
    guch "Отже, панове, вітаю з прибуттям на ковчег, хотів би сказати я, але вам ще треба пройти мінне поле, останнім часом навали гуманоїдів стали більші, тож нам довелося розмістити перед ковчегом мінне поле"
    guch "Просимо вибачення, але вам доведеться пройти це.."
    rom "Я так бачу, що міни розкидані на доволі великій відстані, тож у нас не має бути проблем з тим щоб його пройти"
    olek "Добре, зробімо це"
    "Ми почали проходити через мінне поле, міни були розкидані досить далеко одна від одної, тож напевно це не мало б викликати у нас проблем"
    "Так сюди.."
    "Тепер сюди.."
    "..."
    "Схоже я вже майже закінчив"
    "Тож мені сю.."
    "В середині пролунав якийсь гучний звук, відволікшись на нього я не помітив куди я наступаю.."
    olek "Дідько, це що міна?"
    guch "Без паніки, громадяни, тільки не відступайте, ця міна створена для того, аби ранити супротивника у спину, тож єдине, що ви маєте зробити, це не робити нічого"
    guch "Тільки не рухайтесь, ми зараз придумаємо що робити.."
    olek "Легко сказати.."
    rom "Я можу допомогти"
    olek "Що?"
    rom "Я можу допомогти, я сапер у минулому"
    olek "Ти певен? Краще іди до ковчега"
    rom "Ні пане, я певен, ви врятували мене, тож, щоб не бути винним, я маю врятувати вас"
    "Він підскочив до мене та почав щось робити підмоєю ногою"
    "Він підкопався під міну і почав щось розручувати нігтем на мізинці правої руки"
    "Десь з хвилину він щось там крутив та надавлював, постійно негадуюючи тримати ногу у тому ж положені"
    rom "От дідько, нехоче і все, а якщо так..?"
    "..."
    # Звку типу Клац
    "Я закрив очі в очікуванні кінця, але він чомусь не наставав"
    rom "Пане, все нормально?"
    olek "Що?"
    rom "Я все зробив, ми можемо рухатись далі"
    olek "Дякую, Романе!"
    "Я зробив останній крок і мінне поле було нарешті пройдене"
    noname "Отже, панове, тепер я вітаю вас на борту \"Рятувального ковчега\", тут ви будете у безпеці, до відправки лишилось кілька хвилин, тож прошу вас займати вільні місця для евакуації"
    "Ми піднялись на борт"
    "Найближчими місцями були місця біля входу, туди ми і сіли"
    olek "Ну ось і все, нарешті ми у безпеці"
    "Прошепотів я собі"
    olek "Дякую, Романе, що врятували мене, як би не ви я і не знаю щоб я робив"
    rom "Дорота повертається, як то кажуть"
    rom "Ви врятували мене, і я врятував вас, так зробив би будь хто на моєму місці"
    "Нашу розмову перебив запуск двигунів"
    "Гвинтокрил почав злітати"
    "Тепер точно не може бути жодних підступів"
    "Ми в безпеці..."
    "Як тільки я це подумав, я відчув, щось зачепилось мені за ногу"
    "Це напевно чийсь рюкзак впав"
    "Але схоже ні, бо тягнув мене він дуже сильно"
    "Засумнівавшись я поглянув вниз і побачив верхню частину тіла гуманоїда, який намагався тягти мене вниз"
    olek "Якого біса?"
    "Гуманоїд, явно не збирався летіти з нами довго, тож докладав максимальних зусиль, аби зтягти мене якомога швидше"
    "У нього схоже вийшло"
    "Він витяг мене з крісла і я почав з'їзжати з палуби в слід за гуманоїдом"
    "Я намагався чіплятись за крісла, але все було марно, їх ніжки були поза зоною моєї досяжності"
    "Я почав активно жестикулювати, аби привернути увагу хоч когось, але це було марно, мій голос перебивав мотор, а рухи були непомітні через те що я був на підлозі"
    "З останніх сил я зміг дістати з кармана консерви та жбурнув їми у Романа"
    rom "Що сталось?"
    "Він почав роззератись на всі біч, нарешті помітивши мене"
    rom "Швидше сюди!"
    "Військові помітили, що ми якось дивно себе поводимо побігли до нас аби заспокоювати"
    "Але вони не встигли нічого зробити, бо я вже був на краю ковчега, а гуманоїд зробив останній ривок у низ, після чого я зірвався у низ"
    "Зігнувшись у повітрі, я бачив, як наближаюсь до зграї гуманоїдів що вже очікує здобичі внизу"
    "Їхні безлюдні очі та зловісні посмішки наближалися що миті, коли я швидко зближався з небезпечною землею"
    "Життя пронеслось перед очима відбиваючись у навколишньому середовищі немов у калейдоскопі"
    "Аж раптом калейдоскоп зупинився на останньому образі землі"
    scene end16
    pause
    if persistent.end16 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end16 = True
    return





# Рішення врятувати полоненого (Заражений + Без супутниці) - Кінцівка 17
label Help_captive_no_girl_kill_neighbor:
    "І все ж я не можу просто залишити його тут"
    "Я маю його врятувати"
    "Можливо на ключниці є ключі від цієї клітки?"
    "Я підсвітив ключницю ліхтариком та почав порпатись у ній"
    "Ні це за великий..."
    "Цей замалий.."
    "Цей плаский"
    "Часу було не так вже і багато, але я все ж маю врятувати його"
    "Нарешті, це точно має бути він"
    "Ключ увійшов у замок та відчинив його"
    rom "Дякую, вам пане, я вік не забуду вашої доброти"
    olek "Та ну тебе, на моєму місці кожен вчинив би так само"
    rom "Ну не скажіть.."
    olek "В будь якому випадку, якщо я тебе врятував, то тут вже не залишу, поїхали з нами?"
    rom "А можна?"
    olek "Звісно, чого ж ні"
    rom "Дякую вам, пане"
    olek "Тебе до речі як звати?"
    rom "Роман, а вас?"
    $ rom = Character("Роман", color="#FFFFFF")
    olek "Олексій, приємно познайомитись"
    rom "Навзаємо, пане"
    olek "Добре, за нами вже має бути погоня, тож поспішимо"
    rom "Добре, пане"
    "Ми вийшли на двір"
    "В ключниці було одназу кілька ключів схожих на ключі від машин, але лише на одному був дармовис з кнопками відкрити, тож вібір був очевидний, яка машина відкриється по натисканню на цю кнопку, така і буде нашою"
    # Звук відкривання машини (типу пік-пік)
    "Звук лунав від шикарного джипа"
    olek "Схоже доля нарешті вирішила вирішила нас винагородити"
    rom "Доля завжди прихильна до тих хто цього заслуговує"
    olek "Напевно, ти правий.."
    "Ми залишили псевдо-ковчег та сіли у машину, після чого відїхали на кілька-сот метрів від псевдо-ковчега, аби не попастись у руки розлюченого екіпажа"
    olek "Отже, поки ми ще не відїхали, давайте вирішимо куди нам далі їхати?"
    olek "Більшість людей вже не вірять у існування \"Рятувального ковчега\", тож просто розїхались у різних напрямках, а ті що все ж вірять у ковчег вже напевно досить далеко"
    olek "Як ви вважаєтє, чи є сенс спробувати доїхати до попереднього місця ковчега, чи все ж це буде марна витрата бензину і нам краще спробувати придумати інший план?"
    rom "Я за те щоб їхати до минулого місця ковчега, бо є високі шанси на те що це справжній ковчег, а якщо ні, то там явно мають бути такі ж обдурені люди, як і ми, тож ми зможемо обєднатись з ними в групу"
    rom "Але в будь якому випадку вирішувати вам, пане"
    olek "Я думаю, що це оптимальний план"
    olek "Їдьмо.."
    "Нарешті ми рушили"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла досить спокійно, проте все відчувалось як в тумані" 
    "Через декілька днів я напевно вже і не згадаю жодної фрази, яку я почув в ночі"
    "Зараз на годиннику десята п'ятдесят, до відбуття ковчега лишилось трохи більше двох годин, а ми досі не доїхали туди"
    "Мені здалося дивним, що за весь час, з моменту, як ми виїхали з псевдо-ковчега, ми не бачили жодного гуманоїда, проте так навіть краще"
    "..."
    "В подорожі прийшла ще година"
    "На горизонті нарешті з'явився велечезний гвинтокрил, це означало, що наш шлях майже закінчений"
    "Але також в двуїста метрах від нас майоріла велечезна зграя гуманоїдів, що прямували в сторону ковчега"
    "Їх було так багато, що дивлячись на них мені ввижався велечезний живий організм, що плететься своїми волохатими лапками пожираючи дорогу перед собою"
    "Схоже нам доведеться якимось чином продертися через цей натовп, тож я піддав газу"
    olek "Тримайтесь, зараз буде трохи жорсткувато!"
    "Машина продералась крізь весь той натовп гуманоїдів"
    "Вони намагались залізти на машину, та збивали один одного"
    "Деякі з них падали під колеса, чим сповільнювали нас, проте машина все ж була досить потужна і у нас таки вийшло продертись через жах, але тепер гуманоїди прямували не на ковчег, а саме за нами"
    "Я намагався їхати максимально швидко, як тільки вмів"
    "За рахунок цього ми досить швидко прибули до ковчега"
    "Коли ми прибули до місця де вже стояло багато машин по гучно мовцю до нас звернувся військовий"
    guch "Зупиніться!"
    "З неохотою я зупинився"
    olek "Але ж погоня.."
    "Тільки я подумав про це, як я почув дуже багато пострілів"
    "З верху ковчега по гуманоїдам був відкритий вогонь"
    "Через декілька секунд від їх величезної зграї не залишилось нікого живого"
    guch "Отже, панове, вітаю з прибуттям на ковчег, хотів би сказати я, але вам ще треба пройти мінне поле, останнім часом навали гуманоїдів стали більші, тож нам довелося розмістити перед ковчегом мінне поле"
    guch "Просимо вибачення, але вам доведеться пройти це.."
    rom "Я так бачу, що міни розкидані на доволі великій відстані, тож у нас не має бути проблем з тим щоб його пройти"
    olek "Добре, зробімо це"
    "Ми почали проходити через мінне поле, міни були розкидані досить далеко одна від одної, тож напевно це не мало б викликати у нас проблем"
    "Так сюди.."
    "Тепер сюди.."
    "..."
    "Схоже я вже майже закінчив"
    "Тож мені сю.."
    "В середині пролунав якийсь гучний звук, відволікшись на нього я не помітив куди я наступаю.."
    olek "Дідько, це що міна?"
    guch "Без паніки, громадяни, тільки не відступайте, ця міна створена для того, аби ранити супротивника у спину, тож єдине, що ви маєте зробити, це не робити нічого"
    guch "Тільки не рухайтесь, ми зараз придумаємо що робити.."
    olek "Легко сказати.."
    rom "Я можу допомогти"
    olek "Що?"
    rom "Я можу допомогти, я сапер у минулому"
    olek "Ти певен? Краще іди до ковчега"
    rom "Ні пане, я певен, ви врятували мене, тож, щоб не бути винним, я маю врятувати вас"
    "Він підскочив до мене та почав щось робити підмоєю ногою"
    "Він підкопався під міну і почав щось розручувати нігтем на мізинці правої руки"
    "Десь з хвилину він щось там крутив та надавлював, постійно негадуюючи тримати ногу у тому ж положені"
    rom "От дідько, нехоче і все, а якщо так..?"
    "..."
    # Звку типу Клац
    "Я закрив очі в очікуванні кінця, але він чомусь не наставав"
    rom "Пане, все нормально?"
    olek "Що?"
    rom "Я все зробив, ми можемо рухатись далі"
    olek "Дякую, Романе!"
    "Я зробив останній крок і мінне поле було нарешті пройдене"
    noname "Отже, панове, тепер я вітаю вас на борту \"Рятувального ковчега\", тут ви будете у безпеці, до відправки лишилось кілька хвилин, тож прошу вас займати вільні місця для евакуації"
    "Ми піднялись на борт"
    olek "Кхе-кхе"
    "Я знову викашляв трихи зеленого газу"
    noname "А ну стояти!"
    "Військовий дістав рацію"
    noname "Всі, швидко сюди, у нас мутант на борту!"
    olek "Який ще мутант, ви про що взагалі?"
    noname "Ви відхаркуєте зелений газ, отже він уже в легенях і ви скоро можете перетворитись на повноцінного мутант"
    rom "Вибачте, панове, а що ви будете з ним робити?"
    noname "Власне, нам не потрібен ризик.. {w} Нам доведься його прибрати"
    "В цей момент за спиною військового з'явилась підмога, яку він викликав по рації, та всі вони наставили на мене свої автомати"
    noname "Тримай руки так щоб я їх бачив!"
    "Безвихідь кипіла у моєму мозку"
    "У мене було відчуття, що весь цей шлях був пройдений марно"
    "І схоже, що надії на порятунок вже немає"
    "Тож я змирився із таким кінцем"
    "..."
    rom "Пане військовий, я можу за нього ручатись"
    rom "Нехай ми знайомі не надто довго, проте якихось ознак мутації я не виявив"
    noname "Я все розумію, проте ми не можемо ризикувати людьми на ковчезі, а отже на борт можете піднятись лише ви"
    rom "..."
    rom "Я відмовляюсь"
    rom "Я не можу покинути у біді людину, яка врятувала мене з того лігва людожерів"
    noname "І що ж ви пропонуєте?"
    rom "Дайте нам рушниці для захисту від гуманоїдів"
    olek "Ти що робиш? Схаменися, мене вже не врятувати, рятуйся сам"
    rom "Вибачте, пане, але я не можу цього зробити..."
    noname "Ми не можемо дати рушницю потенційно мутувавшій людині... власне, ми не можемо дати зброю і вам, але тримайте мою"
    noname "На жаль більшого я не можу зробити"
    rom "А нам і цього вистачить, дякую, пане військовий"
    noname "Щасти"
    "Військовий зайшов на борт ковчега, мотори увімкнулись і ковчег злетів, а ми лишились у низу з однією рушницею, особливо без бензину чи набоїв, проте з міцною вірою в те, що разом ми зможемо впоратись з усіма перешкодами, що стоять на нашому шляху"
    scene end17
    pause
    if persistent.end17 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end17 = True
    return





# Рішення не рятувати полоненого (Без супутниці) - Кінцівка 18
label Not_help_captive_no_girl:
    "І все ж ми не можемо його врятувати"
    "Він буде лише заважати, та й нам не вистачить провізії на трьох"
    "Опустивши голову, я попрямував до виходу"
    olek "Пробач"
    "Шепотів я"
    olek "Пробач, але нам тоді не вижити"
    "Короткий коридор, що вів до виходу здавався безкінечним"
    "Кожен крок відчувався, як крок від людяності, але це було раціональне рішення, рішення яке вело до виживання"
    "Нарешті ми з Мілою вийшли на двір"
    "В ключниці було одназу кілька ключів схожих на ключі від машин, але лише на одному був дармовис з кнопками відкрити, тож вібір був очевидний, яка машина відкриється по натисканню на цю кнопку, така і буде нашою"
    # Звук відкривання машини (типу пік-пік)
    "Звук лунав від шикарного джипа"
    olek "Схоже доля нарешті вирішила мене винагородити"
    "Я лишив псевдо-ковчег позаду та сів у нову машину, після чого відїхав на кілька-сот метрів від псевдо-ковчега, аби не попастись у руки розлюченого екіпажа"
    "Отже, тепер у мене є два варіанти подальших дій"
    "Перший - спробувати знайти відносно безпечне місце в околицях, бо бензину явно лишилось не так багато як хотілося б, а другий - їхати до старого місця де мав бути ковчег"
    "З одного боку перший варінт більш стабільний і там менше ризиків, але мені дається що все ж краще їхати до ковчега, бо якщо він таки там, то не хотілося б дивитись як він летить над моєю головю"
    "Отже вирішено, хто не ризикує той не п'є шампанського, я їду до ковчега"
    "Тож, рушили!"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла досить спокійно, проте все відчувалось як в тумані" 
    "Через декілька днів я напевно вже і не згадаю абсолютно нічого з цієї поїздки"
    "Зараз на годиннику десята п'ятдесят, до відбуття ковчега лишилось трохи більше двох годин, а я досі не доїхав туди"
    "Мені здалося дивним, що за весь час, з моменту, як я виїхав з псевдо-ковчега, я не бачив жодного гуманоїда, проте так навіть краще"
    "..."
    "В подорожі прийшла ще година"
    "На горизонті нарешті з'явився велечезний гвинтокрил, це означало, що наш шлях майже закінчений"
    "Але також в двухста метрах від машини майоріла велечезна зграя гуманоїдів, що прямували в сторону ковчега"
    "Їх було так багато, що дивлячись на них мені ввижався велечезний живий організм, що плететься своїми волохатими лапками пожираючи дорогу перед собою"
    "Напевно доведеться якимось чином продертися через цей натовп" 
    "Отже час піддати газу"
    "Машина продералась крізь весь той натовп гуманоїдів"
    "Вони намагались залізти на машину, та збивали один одного"
    "Деякі з них падали під колеса, чим сповільнювали нас, проте машина все ж була досить потужна і у нас таки вийшло продертись через жах, але тепер гуманоїди прямували не на ковчег, а саме за нами"
    "Я намагався їхати максимально швидко, як тільки вмів"
    "За рахунок цього хмара монстрів була подолана досить швидко, в додачу я ще й прибув до ковчега"
    "Коли я підїжалав до місця де вже стояло багато машин з гучномовмця почувся голос військового"
    guch "Зупиніться!"
    "З неохотою я зупинився"
    olek "Але ж погоня.."
    "Тільки я подумав про це, як я почув дуже багато пострілів"
    "З верху ковчега по гуманоїдам був відкритий вогонь"
    "Через декілька секунд від їх величезної зграї не залишилось нікого живого"
    guch "Отже, вітаю з прибуттям на ковчег, хотів би сказати я, але вам ще треба пройти мінне поле, останнім часом навали гуманоїдів стали більші, тож нам довелося розмістити перед ковчегом мінне поле"
    guch "Просимо вибачення, але вам доведеться пройти це.."
    "Відстань між мінами була досить велика, тож особливих проблем з тим щоб пройти це не мало бути"
    "Тоді треба починати"
    "Отже спочатку сюди"
    "Так сюди.."
    "Тепер сюди.."
    "..."
    "Схоже я вже майже закінчив"
    "Тож мені сюди"
    "І останній крок.."
    "Готово"
    noname "Отже, тепер я вітаю вас на борту \"Рятувального ковчега\", тут ви будете у безпеці, до відправки лишилось кілька хвилин, тож прошу вас займати вільні місця для евакуації"
    "Я піднявся на борт і помітив, що найближчі вільні місця знаходяться біля входу, тому я рухнувся туди й сів"
    "Я просто розтягнувся у кріслі, відчуваючи втому та напругу, які накопичилися в мені"
    "Розглядаючи ковчег зсередини, я не міг не захоплюватись його грандіозністю. Він був надзвичайно величезним і, здається, мав потужну евакуаційну потужність"
    "Але коли мої очі оглядали ковчег, я помітив дівчину напроти себе - ту саму, яку залишив на призволящі біля зброярні"
    "Вона була покрита шрамами та синцями, і хоч її волосся було ретельно зачісане, було видно, що вона втратила частину його. Її погляд був таким самим порожнім, як у тих чоловіків, які спускалися по сходах з псевдо-ковчега"
    "Моє сумління відчувало ще більший внутрішній бій"
    "Я робив раціональні рішення протягом всього шляху сюди, щоб вижити, але якби тільки я набрався сміливості й допоміг їм, комусь із них..."
    "Спогади про того полоненого, якого я також залишив у тому місці, теж мучили мою душу"
    "Ні, я робив раціональні рішення, вже занадто пізно замислюватись про минуле..."
    "Але навіть тоді я не можу просто залишитись тут і дозволити тому полоненому померти"
    "Я швидко підскочив на ноги, взявши з собою все, що забрав з псевдо-ковчега, та побіг до машини"
    noname "Пане, куди ви? Відправлення через дві хвилини"
    olek "Я знаю, але я не можу полетіти з вами"
    "Я вилетів з ковчега, швидко промчався через мінне поле та стрибнув у машину"
    "У мене ще є шанс спокутувати свої гріхи, тому я врятую того полоненого і всіх, кого зможу"
    scene end18
    pause
    if persistent.end18 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end18 = True
    return





# Рішення не рятувати полоненого (Заражений + Без супутниці) - Кінцівка 19
label Not_help_captive_no_girl_kill_neighbor:
    "І все ж ми не можемо його врятувати"
    "Він буде лише заважати, та й нам не вистачить провізії на двох"
    "Опустивши голову, я попрямував до виходу"
    olek "Пробач"
    "Шепотів я"
    olek "Пробач, але нам тоді не вижити"
    "Короткий коридор, що вів до виходу здавався безкінечним"
    "Кожен крок відчувався, як крок від людяності, але це було раціональне рішення, рішення яке вело до виживання"
    "Нарешті я вийшов на двір"
    "В ключниці було одназу кілька ключів схожих на ключі від машин, але лише на одному був дармовис з кнопками відкрити, тож вібір був очевидний, яка машина відкриється по натисканню на цю кнопку, така і буде нашою"
    # Звук відкривання машини (типу пік-пік)
    "Звук лунав від шикарного джипа"
    olek "Схоже доля нарешті вирішила мене винагородити"
    "Я лишив псевдо-ковчег позаду та сів у нову машину, після чого відїхав на кілька-сот метрів від псевдо-ковчега, аби не попастись у руки розлюченого екіпажа"
    "Отже, тепер у мене є два варіанти подальших дій"
    "Перший - спробувати знайти відносно безпечне місце в околицях, бо бензину явно лишилось не так багато як хотілося б, а другий - їхати до старого місця де мав бути ковчег"
    "З одного боку перший варінт більш стабільний і там менше ризиків, але мені дається що все ж краще їхати до ковчега, бо якщо він таки там, то не хотілося б дивитись як він летить над моєю головю"
    "Отже вирішено, хто не ризикує той не п'є шампанського, я їду до ковчега"
    "Тож, рушили!"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла досить спокійно, проте все відчувалось як в тумані" 
    "Через декілька днів я напевно вже і не згадаю абсолютно нічого з цієї поїздки"
    "Зараз на годиннику десята п'ятдесят, до відбуття ковчега лишилось трохи більше двох годин, а я досі не доїхав туди"
    "Мені здалося дивним, що за весь час, з моменту, як я виїхав з псевдо-ковчега, я не бачив жодного гуманоїда, проте так навіть краще"
    "..."
    "В подорожі прийшла ще година"
    "На горизонті нарешті з'явився велечезний гвинтокрил, це означало, що наш шлях майже закінчений"
    "Але також в двухста метрах від машини майоріла велечезна зграя гуманоїдів, що прямували в сторону ковчега"
    "Їх було так багато, що дивлячись на них мені ввижався велечезний живий організм, що плететься своїми волохатими лапками пожираючи дорогу перед собою"
    "Напевно доведеться якимось чином продертися через цей натовп" 
    "Отже час піддати газу"
    "Машина продералась крізь весь той натовп гуманоїдів"
    "Вони намагались залізти на машину, та збивали один одного"
    "Деякі з них падали під колеса, чим сповільнювали нас, проте машина все ж була досить потужна і у нас таки вийшло продертись через жах, але тепер гуманоїди прямували не на ковчег, а саме за нами"
    "Я намагався їхати максимально швидко, як тільки вмів"
    "За рахунок цього хмара монстрів була подолана досить швидко, в додачу я ще й прибув до ковчега"
    "Коли я підїжалав до місця де вже стояло багато машин з гучномовмця почувся голос військового"
    guch "Зупиніться!"
    "З неохотою я зупинився"
    olek "Але ж погоня.."
    "Тільки я подумав про це, як я почув дуже багато пострілів"
    "З верху ковчега по гуманоїдам був відкритий вогонь"
    "Через декілька секунд від їх величезної зграї не залишилось нікого живого"
    guch "Отже, вітаю з прибуттям на ковчег, хотів би сказати я, але вам ще треба пройти мінне поле, останнім часом навали гуманоїдів стали більші, тож нам довелося розмістити перед ковчегом мінне поле"
    guch "Просимо вибачення, але вам доведеться пройти це.."
    "Відстань між мінами була досить велика, тож особливих проблем з тим щоб пройти це не мало бути"
    "Тоді треба починати"
    "Отже спочатку сюди"
    "Так сюди.."
    "Тепер сюди.."
    "..."
    "Схоже я вже майже закінчив"
    "Тож мені сюди"
    "І останній крок.."
    "Готово"
    noname "Отже, тепер я вітаю вас на борту \"Рятувального ковчега\", тут ви будете у безпеці, до відправки лишилось кілька хвилин, тож прошу вас займати вільні місця для евакуації"
    "Я піднявся на борт і помітив, що найближчі вільні місця знаходяться біля входу, тому я попрямував туди аби сісти сів"
    olek "Кхе-кхе.."
    "З рота вирвався зелений дим, він ніби шкрябав моє горло, схоже він таки дістався до легеней"
    noname "А ні руш"
    "Військовий дістав рацію"
    noname "Всі, швидко сюди, у нас мутант на борту!"
    "Я подумав що гуманоїд пробрався на борт і швидко роззернувся аби роздивитись його, але я побачив лише гвинтівку націлену мені в обличчя"
    noname "Я сказав - а ні руш, курво!"
    olek "Це ви мені?"
    "З повним нерозумінням запитав я"
    noname "Так, тобі, не рухайся, мутанте!"
    olek "Вибачте, чи можу я поцікавитись, чого ви вважаєте мене мутантом?"
    noname "Ви тільки що відхаркнули зелений газ, отже ви являєтесь зараженим, ми не можемо ризикувати всіма на борту заради вас"
    olek "І що ж ви плануєте зі мною робити?"
    noname "Власне, нам не потрібен ризик.. {w} Нам доведься вас прибрати"
    olek "В сенсі прибрати? Я ж не зробив нічого поганого та й не факт, що я взагалі стану мутантом"
    noname "Те що ви ще нічого не зробили не гарантує того, що нічого не зробите"
    olek "Хіба ви можете вбити невинну людину?"
    noname "Людину ні, але ви не людина"
    olek "..."
    "В цей момент за спиною військового з'явилась підмога, яку він викликав по рації, та всі вони наставили на мене свої автомати"
    "Безвихідь кипіла у моєму мозку"
    "У мене було відчуття, що весь цей шлях був пройдений марно"
    "І схоже, що надії на порятунок вже немає"
    "Тож я змирився із таким кінцем"
    "..."
    noname "За моєю командою.. {w} Вогонь!"
    "Я почув постріл та відчув, як куля проникає у моє тіло. Біль пронизав мене, але через стан шоку я його не відчував"
    "Мій рух зупинився, і я повільно впав на підлогу" 
    "Кров струменіла з мого пораненого тіла, змочуючи білу підлогу красномовними слідами"
    "Мої очі стали туманними, і кожне дихання ставало все важче" 
    "Час змивався в безпорадному мареві, і я відчував, що життя покидає моє тіло"
    "У голові почало прокручуватись все життя до цього, а особливо яскраво я бачив перед собою обличчя тієї дівчини яку я не врятував та полоненого на псевдо-ковчезі"
    "Схоже за те що я їм не допоміг, я скоро з ними зустрінусь"
    scene end19
    pause
    if persistent.end19 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end19 = True
    return





# Рішення ігнорувати відсік (Без супутниці) - Кінцівка 20
label Not_check_cell_no_girl:
    "В принципі немає нічого дивного в тому, що нам щось не показали, все ж ми не команда ковчега"
    "Тому я краще не буду лізти не в своє діло і просто заберу пляшку"
    "Я потягнувся за пляшкою і з великим зусиллям забрав її"
    "Втома нікуди не ділась, тож я зробив ще кілька зупинок і врешті-решт доніс останній бутль до їдальні"
    kok "О, ти вже впорався?"
    olek "Ну так"
    kok "Дякую тобі, хлопче, без тебе у нас би не вистачило часу"
    "Весь фартук кока був заляпаний кров'ю, тож я запитав"
    olek "Ви готуєте щось велике?"
    kok "Ну не сказати, що щось прям велике.. Це щось між куркою, та биком, тобі сподобається"
    olek "Тоді не буду вас відволікати, до побачення"
    kok "Бувай, хлопче"
    "Після цього день був дуже нудним"
    "Фактично я нічого не робив, тільки двічі сходив до їдальні на обід та вечерю і все"
    "Туман перешкоджав потраплянню будь якого сигналу, тож нічого не працювало і єдиною розвагою на весь день стало тинятись ковчегом"
    "Всі приміщення виглядали абсолютно однаково, тож це теж швидко набридло і весь час що залишився я провів у себе в каюті постійно то засинаючи на кілька хвилин то прокидаючись"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ось і настав день відправлення"
    "Сьогодні все це закінчиться"
    "Але якось дивно, що нас досі не кличуть на сніданок, хоча на годиннику вже дев'ята"
    "Хоча, можливо це через те що сьогодні відправлення"
    "Ну добре, тоді піду прогуляюсь трохи"
    "За планом маршрут не мав відрізнятись від вчорашнього, одна думка про це викликала у мене зівоту, але краще вже так ніж просто лежати у ліжку"
    "..."
    "Уже пройшла майже година, а жодних повідомлень досі не було"
    "З кают повиходило не так багато людей, напевно десь чоловік десять, ну не більше"
    "Щось це все дивно..."
    "Почувся звук удару чогось металевого об підлогу"
    "Я озирнувся і побачив, що всі каюти закрились решітками, через що вони стали більше схожі не на каюти, а на клітки"
    olek "Що це все значить?"
    "Ніби у відповідь мені почалося повідомлення"
    guch "Добрий ранок, гості кочєга, до вас обращається капітан судна Владімєр Соколов"
    guch "На жаль для вас, ми обдурили всєх присутніх і заманілі вас всіх на це судно не для порятунку, а для пополненія нашого запасу м'яса"
    guch "Фактично це даже не судно, а лише часний дом, який ми стилізували під \"Рятувальний ковчег\" аби заманіть вас сюда"
    guch "Ужасно, чи не так? Но самий жах ви дізнаєтесь зараз"
    guch "Мости, які раніше з'єднували ваші поселення, були підірвані нами. Ми залишили вам лише один маршрут, что би кожен дрон, що пролітає, міг повідомляти про переміщення \"Рятувального ковчега\", який насправді нікуди не переміщувався, справжній ковчег так само ждьот людей у Рівному"
    guch "Як ви думаєте, чому тут до вас ставились так добре? Звісно ж тому що відкормлені свині найсмачніші"
    guch "Ви спросітє нащо я це розказую? Тільки тому що люді мають право знати правду, хотя би перед смертю"
    guch "І так, уважаємиє гості, на цьому ми повинні простягнути вам останній привіт. А команді ковчега, бажаємо смачного"
    "Повідомлення затихло, а з кают почувся звук випуску якогось газу"
    "За декілька секунд люди в каютах почали непритомніти"
    noname "Якого біса? Це точно не може бути правдою"
    "Майже прокричав один з чоловіків"
    olek "Як бачите, може.."
    "Команда псевдо-ковчега почала сходитись до головного відсіку"
    vla "Якого чорта, вони не в своїх каютах?"
    noname "Без поняття, пане"
    vla "Ну що, шкєт, теперь ти все знаєш.. і що будеш робити?"
    olek "Звільню всіх людей, але перед цим вб'ю тебе та твоїх клятих посіпак"
    vla "Какая гучна за'ява, а отвєтіть за неї зможеш?"
    olek "Головне, щоб ви відповіли за свої злочини"
    vla "Пф, не сміши.. У нас тут кінець світу, якщо ти не помітив, всім давно все одно, верхівка влади думає лише, як врятувати себе, на вас ім глибоко насрать"
    olek "Зате нам не насрать на долю цих людей"
    "Ті десять людей, які вийшли з кают раніше стали за моєю спиною, ніби ми в месниках"
    vla "Слухайте, ребята, я так сильно хочу етого парня, пусть он будет взятий в плен"
    noname "Так, пане!"
    "Капітан розвернувся та пішов до командного центра"
    olek "Тікаєш, падло?!"
    "У відповідь нічого не прозвучало"
    "Команда ковчега була не маленька, тож кількісна перевага була очевидна всім, але навіть так здаватись ніхто не збирався"
    olek "Прикрийте мене!"
    "Чоловіки, що стояли за мною явно вирішили боротись до кінця, тож вони без зайвих сумнівів кинулись у бій"
    "Я ж рухався вперед, вдихаючи запах пороху та трохи диму, який залишався у повітрі після кожного пострілу"
    "Ненависть і вир увійшли в моє серце, даруючи моїй руці силу та мету"
    "Команда ковчега виявилася добре підготовленою і зловісною" 
    "Їхні обличчя були спокійними, майже без вияву емоцій"
    "Кожен постріл, кожен удар був відповіддю на зраду, болючу втрату і нікчемне життя, які вони призвели на нас"
    "Хвилі адреналіну накачували мої вени, підсилюючи будь який рух або рефлекс, але також він підсилював і біль від влучання в руки чи ноги"
    "Але у мене немає часу щоб піддавався, тож я не зупинявся"
    "Мета була проста - зупинити їх, звільнити тих, кого вони тримали у полоні" 
    "Аж раптом з-за спини я почув крик"
    noname "Ось ти і попався гад!"
    "Це був один з команди псевдо-ковчега він замахнувся рушницею, та вдарив мене у потилицю"
    "Все в очах почало темніти"
    "Звуки боротьби все ще звучали, але вони ставали все далі"
    "І останнім, що я почув було звернення капітана псевдо-ковчега"
    vla "Агов, обережно там, не пошкодь його мозок. Я хочу спробувати здорову сіру речовину когось настільки ідейного"
    scene end20
    pause
    if persistent.end20 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end20 = True
    return





# Рішення ігнорувати відсік (Заражений + Без супутниці) - Кінцівка 21
label Not_check_cell_no_girl_kill_neighbor:
    "В принципі немає нічого дивного в тому, що нам щось не показали, все ж ми не команда ковчега"
    "Тому я краще не буду лізти не в своє діло і просто заберу пляшку"
    "Я потягнувся за пляшкою і з великим зусиллям забрав її"
    "Втома нікуди не ділась, тож я зробив ще кілька зупинок і врешті-решт доніс останній бутль до їдальні"
    kok "О, ти вже впорався?"
    olek "Ну так"
    kok "Дякую тобі, хлопче, без тебе у нас би не вистачило часу"
    "Весь фартук кока був заляпаний кров'ю, тож я запитав"
    olek "Ви готуєте щось велике?"
    kok "Ну не сказати, що щось прям велике.. Це щось між куркою, та биком, тобі сподобається"
    olek "Тоді не буду вас відволікати, до побачення"
    kok "Бувай, хлопче"
    "Після цього день був дуже нудним"
    "Фактично я нічого не робив, тільки двічі сходив до їдальні на обід та вечерю і все"
    "Туман перешкоджав потраплянню будь якого сигналу, тож нічого не працювало і єдиною розвагою на весь день стало тинятись ковчегом"
    "Всі приміщення виглядали абсолютно однаково, тож це теж швидко набридло і весь час що залишився я провів у себе в каюті постійно то засинаючи на кілька хвилин то прокидаючись"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ось і настав день відправлення"
    "Сьогодні все це закінчиться"
    "Але якось дивно, що нас досі не кличуть на сніданок, хоча на годиннику вже дев'ята"
    "Хоча, можливо це через те що сьогодні відправлення"
    "Ну добре, тоді піду прогуляюсь трохи"
    "За планом маршрут не мав відрізнятись від вчорашнього, одна думка про це викликала у мене зівоту, але краще вже так ніж просто лежати у ліжку"
    "..."
    "Уже пройшла майже година, а жодних повідомлень досі не було"
    "З кают повиходило не так багато людей, напевно десь чоловік десять, ну не більше"
    "Щось це все дивно..."
    "Почувся звук удару чогось металевого об підлогу"
    "Я озирнувся і побачив, що всі каюти закрились решітками, через що вони стали більше схожі не на каюти, а на клітки"
    olek "Що це все значить?"
    "Ніби у відповідь мені почалося повідомлення"
    guch "Добрий ранок, гості кочєга, до вас обращається капітан судна Владімєр Соколов"
    guch "На жаль для вас, ми обдурили всєх присутніх і заманілі вас всіх на це судно не для порятунку, а для пополненія нашого запасу м'яса"
    guch "Фактично це даже не судно, а лише часний дом, який ми стилізували під \"Рятувальний ковчег\" аби заманіть вас сюда"
    guch "Ужасно, чи не так? Но самий жах ви дізнаєтесь зараз"
    guch "Мости, які раніше з'єднували ваші поселення, були підірвані нами. Ми залишили вам лише один маршрут, что би кожен дрон, що пролітає, міг повідомляти про переміщення \"Рятувального ковчега\", який насправді нікуди не переміщувався, справжній ковчег так само ждьот людей у Рівному"
    guch "Як ви думаєте, чому тут до вас ставились так добре? Звісно ж тому що відкормлені свині найсмачніші"
    guch "Ви спросітє нащо я це розказую? Тільки тому що люді мають право знати правду, хотя би перед смертю"
    guch "І так, уважаємиє гості, на цьому ми повинні простягнути вам останній привіт. А команді ковчега, бажаємо смачного"
    "Повідомлення затихло, а з кают почувся звук випуску якогось газу"
    "За декілька секунд люди в каютах почали непритомніти"
    noname "Якого біса? Це точно не може бути правдою"
    "Майже прокричав один з чоловіків"
    olek "Як бачите, може.."
    "Команда псевдо-ковчега почала сходитись до головного відсіку"
    vla "Якого чорта, вони не в своїх каютах?"
    noname "Без поняття, пане"
    vla "Ну що, шкєт, теперь ти все знаєш.. і що будеш робити?"
    olek "Звільню всіх людей, але перед цим вб'ю тебе та твоїх клятих посіпак"
    vla "Какая гучна за'ява, а отвєтіть за неї зможеш?"
    olek "Головне, щоб ви відповіли за свої злочини"
    vla "Пф, не сміши.. У нас тут кінець світу, якщо ти не помітив, всім давно все одно, верхівка влади думає лише, як врятувати себе, на вас ім глибоко насрать"
    olek "Зате нам не насрать на долю цих людей"
    "Ті десять людей, які вийшли з кают раніше стали за моєю спиною, ніби ми в месниках"
    vla "Слухайте, ребята, я так сильно хочу етого парня, пусть он будет взятий в плен"
    noname "Так, пане!"
    "Капітан розвернувся та пішов до командного центра"
    olek "Тікаєш, падло?!"
    "У відповідь нічого не прозвучало"
    "Команда ковчега була не маленька, тож кількісна перевага була очевидна всім, але навіть так здаватись ніхто не збирався"
    olek "Прикрийте мене!"
    "Чоловіки, що стояли за мною явно вирішили боротись до кінця, тож вони без зайвих сумнівів кинулись у бій"
    "Я ж рухався вперед, вдихаючи запах пороху та трохи диму, який залишався у повітрі після кожного пострілу"
    "Ненависть і вир увійшли в моє серце, даруючи моїй руці силу та мету"
    "Команда ковчега виявилася добре підготовленою і зловісною" 
    "Їхні обличчя були спокійними, майже без вияву емоцій"
    "Кожен постріл, кожен удар був відповіддю на зраду, болючу втрату і нікчемне життя, які вони призвели на нас"
    "Хвилі адреналіну накачували мої вени, підсилюючи будь який рух або рефлекс, але також він підсилював і біль від влучання в руки чи ноги, це також підняло мій темп дихання і я відчув як зелений газ потрапив у легені"
    "А, грець з ним, я все одно доберусь до капітана"
    olek "Кхе-кхе"
    "Дихання збилось і я зірвався на кашель"
    noname "Це наш шанс, забираємо його!"
    "Команда псевдо-ковчега почала наближатись до мене"
    "Чоловіки, що залишились у живих вирішили скористатись цим та самі побігли на капітана"
    vla "Ото вже, кок просив не стріляти у їжу, але схоже виправдатись перед ним буде простіше ніж перед ними"
    "Він дістав з піджака пістолет та розрядив магазин у наближаючихся чоловіків"
    "Постріли були дуже точні і жоден з них схоже не зміг вижити"
    "Я ж відчував якісь метаморфози у організмі"
    "Все почало плисти, кістки хрустіли, проростаючи у зворотньому напрямку, а разум почав мутнішати"
    "Команда-псевдо-ковчега почала про щось перекрикуватись, але єдине, що я зміг з того всього розібрати був голос капітана"
    vla "Ну, якщо не вийде захопити його, як людину, ми можемо вперше спробувати м'ясо гуманоїда.."
    scene end21
    pause
    if persistent.end21 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end21 = True
    return





#Рішення не заправлятись
label Not_refuel_no_girl:
    "Все ж якщо зараз втратити час на заправку мені може не вистачити бензину, щоб доїхати, а що мені той бензин, якщо я не встигну"
    "Найближча заправка має бути за декілька кілометрів звідси, тому це точно забере чимало часу, їхати туди просто не логічно"
    window hide
    scene bg clock_10 with fade
    pause(1.0)
    scene bg clock_12 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Більша частина міста вже позаду, мені лишився останній рубіж"
    "Найважчий рубіж"
    "Потрібно проїхати колись найбільш заселений район міста"
    "Він точно заповнений гуманоїдами, як в будівлях так і на вулицях"
    "Тож їхати треба обережно, не привертаючи зайвої уваги"
    "Не видаючи жодних звуків"
    "Щоб зменшити шуми від машини я заглушив двигун, перед цим набравши швидкість якої б мало вистачити, щоб виїхати з цього району за інерцією"
    "Колеса ледве крутяться та машина все ж рухалась до виїзду"
    "Ось уже і видно табличку з перекресленою назвою міста"
    "Залишилось ще трохи і я буду у відносній безпеці"
    "Давай..."
    "Ще трохи..."
    "..."
    "По машині щось вдарило ззаду"
    "У дзеркалі заднього виду не було нічого"
    olek "Це напевно якась гілка"
    "Сказав я заспокоюючи себе"
    "..."
    # Гучний звук
    "Ззаду машини стояв гуманоїд, який нахабно тримав задні двері у руках"
    gumanoid "Гарррр!"
    "Гуманоїд прокричав так ніби кличе інших долучитись до розбору моєї автівки"
    "І схоже його родичі не були проти"
    "З усіх будівель рясним дощем почали випадати гуманоїди"
    "Всі вони явно націлились на мене і вже мчали навипередки, аби поласувати мною"
    "Треба швидко заводитись!"
    "Ключ знову, як на зло заклинило"
    "Нужбо... Нужбо..."
    "Двигун нарешті заревів"
    "Тепер думай, що далі"
    "Думай..."
    "Точно!"
    "Якщо я викину каністру підпаливши її це дасть мені шанс на те щоб вирватись"
    "Вона стояла як раз навпроти дверей які вирвав гуманоїд, отже мені лишилось придумати, як підпалити її"
    "Як же це зробити?"
    "Трясця, це напевно перша ситуація за все життя коли я пожалкував, що не курю"
    "..."
    "Точно, я ж можу розігріти підкурювач, та кинути його у бензин"
    "Я швидко перерізав мотузку, якою перемотував бензобак, аби його не трясло по дорозі"
    "Каністра стрімко вилетіла з машини та впала перед натовпом монстрів, розплескавши деяку частину бензину по землі"
    "Отже все готово.."
    "Підкурювач вилетів з машини та полетів у вже розлитий бензин, який миттєво спалахнув, утворивши деякий бар'єр з вогню"
    "Деякі гуманоїди намагались пройти через вогонь, проте підпаливши свої кінцівки вони зупинились"
    "Схоже вони зрозуміли, що вже не зможуть нас наздогнати, тож кинули в слід лише крик"
    "Крик, який звучав навіть не позвірячому, скоріше за все так звучали ті монстри під ліжком з дитинства, а їх силуєти підсилені вогнем лише підкріпляло це відчуття"
    "..."
    olek "Фухх..."
    olek "Вийшло..."
    olek "Вітаю, ми за містом"
    window hide
    scene day_4 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#d2ead1")
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч була довга, я весь час мав бути сконцентрований на дорозі і на педалях"
    "Оскільки я давно не седів за кермом, а тим паче ніколи довго не їздив, це було для мене дуже тяжко"
    "Дорога за містом була досить спокійна, тож я їхав в суцільній тищі, яку порушували лише цвіркуни, які ще не зрозуміли, що настала осінь"
    "Ранок був такий самий як і ніч, тільки до загального почуття втомленості додався ще й голод"
    "Отже мені необхідно знайти де б я міг зупинитись"
    "Пагорб, що виднівся на горизонті, як раз здавався підходящим місцем"
    "Заїхавши на нього я побачив місто з якого тікав"
    "Там був з'їзд з дороги, тож я зупинився, аби нарешті поснідати"
    "Діставши з рякзака якісь булочки я підняв очі на краєвид Києва, який відкривався з цього пагорба"
    "Він був, як на долоні"
    "Колись найприємніше для мене місто було завішане зеленим туманом, який робив із, і так не завжди приємних людей гуманоїдів, котрі намагаються мене з'їсти"
    "Але все ж який Київ гарний, звідси його видно майже повністю, від районів у яких протікала моя спокійна юність до Майдану та ..."
    olek "Сподіваюсь, що колись зможу повернутись до тебе"
    "Прошепотів я"
    "За любуванням краєвидами Києва їжа просто зникла і я знову сів за своє звичне місце"
    if is_kill_neighbor == True:
        olek "Кхе-кхе"
        "З рота вилетів зелений дим, схоже мене таки не оминула таж участь, що і Васильовича"
        "В будь якому випадку, я думаю а ковчезі мені допоможуть, тож я не можу скидати темпу"
    # Годинник міняє час з 12 на 20:30
    window hide
    scene bg clock_12 with fade
    pause(1.0)
    scene bg clock_20_30 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Все ж таки, їхати двоє суток поспіль дуже вимотуюче заняття, напевно треба зробити маленький відпочинок"
    # Очі закриваються поступово за декілька кадрів
    "Але де?.."
    # Темний екран
    "..."
    # Гучний звук сповішення
    "Що це..?"
    "Озираючись навкруги я помітив маленький дрон у небі"
    guch "Увага! Увага!"
    guch "Координати \"Рятувального ковчега\" були змінені та пересунені на схід. Тепер ковчег буде чекати на всіх у місті Плоскирів"
    guch "Повторюю, координати \"Рятувального ковчега\" були змінені та пересунені на схід. Тепер ковчег буде чекати на всіх у місті Плоскирів"
    "Дрон полетів далі залишивши мене на одинці з шимом дороги"
    "Я трохи збавив хід аби подивитись на карті куди саме мені їхати"
    "Наскільки я пам'ятаю, це має бути тут близько"
    "Вирішивши не ризикувати я таки зупинився та дістав карту"
    "Я таки був правий, це досить близько"
    "Але мене якось насторожує, що інформацію про такий крупний переніс повідомляється всього лиш дроном"
    "Та й сам переніс не виглядає надто реалістичним, це ж тобі не ларьок пересунути, це просто величезний гвинтокрил, який з чутками може евакуювати, якщо не область, то район точно"
    "Втім, навіть попри мою недовіру, мій шлях все одно лежить через Плоскирів, тож як буду там, то й перевірю"
    window hide
    scene day_5 with fade
    if is_kill_neighbor == True:
        $ olek = Character("Олексій", color="#bedcbe")
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла спокійно"
    "Через те що я вже відключався за кермом я зрозумів, що мені точно потрібно відпочити, і як тільки випала така можливість я спрямував машину на лісову доріжку, аби я був більш непомітний"
    "Якимось дивом, згадуючи програми про виживання з дитинства, я обладнав своє спальне місце на дереві та відрубився абсолютно без сил"
    "Я проспав приблизно 4 години, проте я відчував, що цього мені цілком вистачить, аби відновитись та бути бадьорим увесь день"
    "На данний момент я їхав вже декілька годин і ось-ось мав би прибути до нового місця \"ковчега\""
    "Його вже навіть видно на горизонті"
    "Проте він не виглядав дуже вражаючим, ніби він був менший ніж по розказам, коли цю програму тільки починали"
    "Втім, люди завжди щось-щось та й прикрасять у своїй розповіді"
    "Хоча можливо він маленький тільки тому, що я ще не доїхали до нього?"
    window hide
    scene bg clock_10 with fade
    pause(1.0)
    scene bg clock_12 with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Час пролетів досить швидко і я таки прибув до Плоскиріва, а отже і на нове місце ковчега"
    "Він таки величезний, хоча не такий величезний як про нього говорили"
    "Та й таке.."
    "На моє здивування там вже стояло чимало машин схоже багато людей таки змогли вижити у тому жахітті"
    "Коли я підїхав до місця де вже стояли інші автівки до автівки підійшов чоловік років п'ятидесяти"
    "Він був досить високий, у формі схожій на щось між воєнною та діловою, на ньому були окуляри та кашкет, а під носом у нього виднілися розкішні вуса, одним словом він був статний"
    $ vla = Character("???", color="#FFFFFF")
    vla "Драстє, вітаю вас на ковчєгє"
    vla "Я капітан цього судна Владімєр Соколов, а ким ви будете, новопрєбивший?"
    $ vla = Character("Владімєр", color="#FFFFFF")
    olek "Я Олексій"
    vla "Тоже сам? В любом разі я рад, що ти тут, а пару ми тобі завжди найдьом"
    vla "Хахаха!"
    olek "І нащо б це мені було потрібно"
    "Пробурмотів я собі"
    vla "Ну как \"нащо?\" це ж ковчег, каждой тварі по парє, ну сам понімаєш.."
    olek "..."
    vla "В любом випадку, тебе щось інтересуєт?"
    olek "Може підкажете де ті що приїхали раніше за мене?"
    vla "Я тебє как раз зараз все і покажу"
    vla "Пойдьомтє-пойдьомтє"
    "Я виліз з машини та попрямував за капітаном ковчега"
    "Не зважаючи на його дивний говір, він здавався досить позитивним та надійний, принаймні мені хотілося у це вірити"
    "Владімєр відвів мене в середину ковчега, там вже було чимало людей і нарешті побачивши їх мої сумніви, що до цього місця, як рукою зняло"
    vla "Ось тут у нас главний відсік, в ньом знаходяться усі кто прибув на ковчег та їх каюти"
    vla "Якщо пройти дальше, в глиб судна, можна буде побачити їдальню та командний пункт в якому какраз живе ваш покорий слуга"
    vla "Якщо тебє буде щось інтєрєсно мої хлопці проведуть тебє екскурсію"
    jump Menu_excursion_no_girl
    return
# Рішення перевірити підозрілий відсік (Без супутниці + Без бензину)
label Check_cell_no_girl_no_refuel:
    "В принципі немає нічого дивного в тому, що нам щось не показали, все ж ми не команда ковчега"
    "Проте саме це місце викликає у мене багато сумнівів та підозр"
    "Можливо я таки не помилявся, коли сумнівався у правдивості переносу"
    "Все ж мені треба перевірити цей відсік, щоб я був повністю спокійний та міг довіритись команді ковчега"
    "Тож, включивши ліхтарик на телефоні, я заходжу"
    "..."
    "Світла ліхтарик давав дуже мало"
    "В кімнаті смерділо протсо нестрепно"
    "Температура тут досить низька, можливо це якийсь відсік для зберігання їжі"
    "Це ж звичайна практика тримати їжу у холодильнику, я сотні разів бачив такі на ринках, тож чому б такого холодильника не могло бути тут"
    "У спробах заспокоїтись думав я, але щось таки не давало мені спокою"
    "Я вирішив, що пройдусь до іншого кінця кімнати, аби все ж бути впевненим"
    "Ліхарик світить дуже слабко, напевно щоб побачити хоч щось мені треба буде впертись у це носом"
    "Не встиг я це подумати, як на світло все ж потрапив, якийсь об'єкт"
    "Підійшовши ближче у незрозумілому силуєті мені вдалось розгледіти..." 
    "Людську руку?.."
    "Ні, це точно не могла бути вона, це напевно світло, якось неправильно падало"
    "Це ж не може бути рука, правда?.."
    "У цей момент увімкнулось світло"
    "Я швидко сховався за одним із стендів"
    "Озираючись я намагався знайти тіні, або відображення у плитці, аби зрозуміти хто це йде, проте поки я шукав хоч якісь зачіпки на те хто це може бути я встиг роздивитись усе що було у тій кімнаті"
    "Навколо висіли пошматовані тіла людей, вони були у такому ж стані, як худоба у м'ясних відділах ринків"
    "Я намагався себе переконати, що мені все це мариться, але кожен раз коли я підіймав погляд, людські частини тіл вривались мені в очі"
    "Невже, це місце не є місцем порятунку?"
    "Мої думки перервав грубий голос, що лунав зі сторони дверей"
    kok "Шо цей довбень так довго носить ті бутлі"
    noname "Та, яка різниця, забий на нього"
    "Голоси невпинно наближались"
    kok "Ну так то воно так, але з чого мені робити юшку"
    "У кількох метрах від мене почувся брязкіт ланцюгів"
    noname "Та нічого, встигниш ще, вони все одно звідси не планують валити, ми ж типу рятуємо їх"
    kok "..."
    kok "Як ти думаєш, з чого краще робити бульйон, з ноги чи все ж з руку?"
    noname "Навіть незнаю..."
    noname "Ну дивлячись на цього товстуна, думаю краще все ж з ноги, ще й м'ясо в суп буде"
    kok "Напевно ти правий..."
    "В кімнаті пролунав хрускіт кісток"
    kok "Дідько, міцна кістка"
    "Звук повторився"
    kok "О, от так би одразу.."
    kok "Ну добре, хапай це та тягни на кухню"
    noname "Слухаюсь, пане"
    "Тіні почали прямувати до виходу"
    "Світло знову вимкнулось"
    "Тепер я вже ні в чому не сумнівався..."
    "Ніякого переносу ковчега не було, нас всіх просто заманили в пастку, ніхто навіть не думав нас рятувати, все це створено лише для того аби з'їсти нас"
    "Тож єдиний висновок, який у мене є це те що команда цього псевдоковчега - канібали, а ми тут для поповнення їх запасів"
    "Я недозволю цього!"
    "Ми боролись за виживання з гуманоїдами, що перевершують людину в усіх показниках, отже зможемо поборотись і з людьми"
    "Я маю попередити всіх та вшиватись звідси"
    "Для цього мені треба відіграти дурника, який ні про що не здогадується, аби проникнути у командний пункт і звільнити всіх"
    "..."
    "Я швидко виліз з таємничого відсіку захопивши з собою бутль"
    "Після того, що я побачив, я навіть не помітив, який важкий бутль та даніс його досить швидко"
    kok "О, дякую, друже"
    kok "Не сильно ухекався?"
    "З усмішкою сказав кок"
    olek "Чесно кажучи так, але я вже встиг відпочити"
    kok "Ясно, ну от і добре, тоді чекатиму тебе на обіді"
    "Як двозначно звучить ця фраза від канібала..."
    olek "Так, я теж буду з нетерпінням чекати, до побачення"
    kok "Бувай"
    "Тепер мені треба забиратись звідси.."
    "Заберу все необхідне та буду тікати"
    "..."
    "Я зайшов до своєї каюти, забрав пістолет, ключі від машини та парочку консерв"
    "Все це дуже зручно помітилось у кишені, особливо не викликаючи підозр"
    "Знову прокрутив побачене у себе в голові, щоб переконатись, що це не можна було сприйняти ніяк інакше та рушив у командний центр"
    "Шлях до нього досить короткий, проте зараз він тягнеться цілу вічність"
    "Я відчуваю кожен крок, кожну секунду, кожен удар серця"
    "В цей момент в голові лишилась лише одна думка: \"Хоч би я не помилився...\""
    "Проте це не має мене відволікати від цілі"
    "Ось уже і видно командний центр, а отже у мене лишилась одна мить аби зібратись"
    noname "Стій, куди зібрався?"
    olek "До капітана, він просив зайти"
    noname "Дивно, він же пішов тільки що.."
    olek "Напевно забув..."
    olek "Може я його всередині почекаю?"
    noname "Ні, чекайте тут"
    olek "Ну, добре, як скажеш.."
    "Я став біля охоронця в очікуванні капітана"
    "Звісно ж капітан мені тут не потрібен, він буде лише заважати, до того ж довго чекати я не можу"
    "І що ж робити?.."
    "..."
    "Єдине рішення оглушити охоронця"
    "Я зайшов у його сліпу зону та наніс удар руківям пістолету йому точно в потилицю"
    # Звук удару по шолому
    "Охоронець впав"
    "Схоже спрацювало"
    "Я затягнув охоронця в середину, а сам підбіг до пульту керування"
    "Кнопок там дійсно було багато, але потрібна мені лише одна.."
    "Кнопка для ввімкнення гучномовця"
    "Капітан розповідав про неї, тож я запам'ятав як вона приблизно виглядає"
    "Тож тисну.."
    # Звук сповіщення
    "Я натиснув на кнопку та почув гучний сигнал сповіщення"
    guch "Шановні пасажири ковчега, до вас звертається новий капітан судна, Олексій"
    guch "Двадцять хвилин тому мною було викрити єдиний відсік, який не демострували жодному з нас"
    guch "У тому відсіку зберігались людські частини тіла, які на цьому судні використовуються, як їжа"
    guch "Звідси слідує висновок, що команда ковчега - канібали, а нас сюди заманили, аби поповнити їх запаси їжі"
    guch "І останнє, це місце не є \"Рятувальним ковчегом\", нас ніхто не врятує, а отже ми самі маємо рятуватись"
    guch "Біжіть звідси, та бережіть себе"
    "Промова вийшла трохи слабкувата, проте я сподіваюсь вона все ж буде мати свій ефект"
    "Отже тут я закінчив і мені лишається лише тікати"
    "Я розвернувся та попрямував до чорного виходу"
    vla "Не так бистро, хлопче!"
    vla "Ти мнє відповіси за це!"
    mil "Я так не думаю"
    "Я дістав пістолет та націлив на нього"
    vla "Ти ж не стрільнеш.. Ти слішком мягкотел.."
    # Звук стрільби
    "Я стрільнув псевдо-капітану в плече"
    vla "Курва!"
    olek "Ти зовсім мене не знаєш, але я знаю все про вас.."
    vla "І що ж ти з цим зробиш? Здаси мене поліції?"
    vla "От тільки всім глибоко насрати, у нас тут апокаліпсис, якщо ти не забув.."
    olek "Замовкни вже.."
    "Я вдарив псевдо-капітана руківям пістолета по макітрі і він відключився"
    "Зваживши всі за та проти я залишив знерухомлене тіло псевдо-капітана тут"
    "Команда псевдо-ковчега вже явно щось запідозрила, тож тепер мені треба линяти"
    "Я відчинив двері чорного ходу, який схоже і дійсно був чорним"
    "Навколо було досить темно, але на виході все ж було світло"
    "Світло, що символізувало свободу та виживання"
    "Біля виходу стояли клітки в яких лежали кістки, в цьому місті такому не дивуєшся, але все ж трохи лячно"
    "В одній із кліток почувся шурхіт"
    "За мить в тій клітці з'явилися дві білі цітки"
    "З клітки прозвучав насилу вичавлений звук"
    $ rom = Character("???", color="#FFFFFF")
    rom "Врятуйте..."
    "Я підсвітив ліхтариком клітку"
    "В ній стояв, чоловік дуже слабкий, змучений і без однієї руки"
    rom "Врятуйте, молю вас..."
    "Судячи з його стану він не зможе протриматись у тій клітці довго, проте також він маловірогідно зможе вижити у світі повному гуманоїдів"
    "Якщо я його врятую, совість не дозволить залишити його тут, але здоровий глузд підказує, що він буде лише плутатись під ногами і є великий шанс загинути через це"
    "Вирішувати треба швидко, доки за нами не з'явилась погоня"
    "Тож, що ти вирішиш Олексію?.."
    "..."
    menu:
        "Врятувати полоненого":
            jump Help_captive_no_girl_no_refuel
        "Не рятувати полоненого":
            jump Not_help_captive_no_girl_no_refuel
    return
# Рішення врятувати полоненого (Без супутниці + Без бензину)
label Help_captive_no_girl_no_refuel:
    "І все ж я не можу просто залишити його тут"
    "Я маю його врятувати"
    "Можливо на ключниці є ключі від цієї клітки?"
    "Я підсвітив ключницю ліхтариком та почав порпатись у ній"
    "Ні це за великий..."
    "Цей за малий.."
    "Цей плаский"
    "Та де ж він трясця.."
    "Нарешті, це точно має бути він"
    "Ключ увійшов у замок та відчинив його"
    rom "Дякую, вам пане, я вік не забуду вашої доброти"
    olek "Та ну тебе, на моєму місці кожен вчинив би так само"
    rom "Ну не скажіть.."
    olek "В будь якому випадку, якщо я тебе врятував, то тут вже не залишу, поїхали з нами?"
    rom "А можна?"
    olek "Звісно, чого ж ні"
    rom "Дякую вам, пане"
    olek "Тебе до речі як звати?"
    rom "Роман, а вас?"
    $ rom = Character("Роман", color="#FFFFFF")
    olek "Олексій, приємно познайомитись"
    rom "Навзаємо, пане"
    "Ми вийшли на двір"
    olek "Отже, Романе, моя машина знаходиться на іншому боці цього псевдо-ковчега, нам потрібно дістатись туди максимально тихо, аби нас не помітили, тож мпробуймо не привертати уваги, добре?"
    rom "Добре, пане"
    olek "Тоді рушили"
    "Ми почали просуватись в здовж літака так щоб нас не помітили"
    "Кожен крок був дуже напруженим"
    "Кожен з нас намагався видавати як омога менше звуків, аби нас не помітили"
    "Так як псевдо-ковчег залишився без світла жодні охолоджувачі, системи подавання кисню і таке інше не працювали, то всі звуки з середини були багатократно підсилені через відлуння, і чутні на зовні"
    "Тож кожен шурхіт в середині зупиняв на секунду кожного з нашої трійці"
    "Врешті решт ми дістались до нашого пошарпаного автомобіля"
    "Я заліз в середину вставивши ключ в запалювання"
    "Проворот.. {w} Невдача"
    "Іще раз проворот.. {w} І знову невдача"
    rom "Вибачте, пане, щось не так?"
    olek "Машина не заводиться.."
    olek "У нас схоже закінчився бензин.."
    rom "У вас є план на такий випадок, пане?"
    olek "Ні, але .." 
    olek "..."
    olek "Хоча ні, є два варіанти.."
    olek "Або бігти, або спробувати захопити цей муляж ковчега"
    "Що ж мені обрати?"
    "..."
    menu:
        "Бігти пішки":
            if is_kill_neighbor == False:
                jump Run_no_girl_no_refuel
            else:
                jump Run_no_girl_no_refuel_kill_neighbor
        "Повернутись і битись":
            if is_kill_neighbor == False:
                jump Fight_no_girl_no_refuel
            else:
                jump Fight_no_girl_no_refuel_kill_neighbor
    return
# Рішення бігти (Без супутниці + Без бензину) - Кінцівка 22
label Run_no_girl_no_refuel:
    olek "Я вважаю, що повертатись туди немає сенсу, тож нам треба бігти звідси, хоч кудись"
    olek "Єдине, що я взагалі не знаю куди.."
    rom "Я знаю одне невеличке містечко неподалік звідси, там має бути мало мутантів і багато ресурсів, оскільки місто було новим і його ще не встигли заселити"
    olek "А це варіант, і де те місто?"
    rom "На південь звідси"
    olek "..."
    olek "В принципі це хороший план, так ми зможемо залишитись у тому містечку про яке ви сказали поки військові не почнуть зачищати територіїї"
    olek "Проте, я тут згадав, що справжній \"Рятувальний ковчег\" також має бути на підень звідси, ми можемо спробувати дійти туди, а якщо не вийде, то повернутись до того містачка"
    rom "Напевно це такий кащий варіант, але враховуючи те що у мене немає ноги, а ви явно не зможете дотягти мене самотужки, я би запропонував передивитись варінт із тим щоб не йти до ковчега, а залишитись у містечку неподалік"
    olek "..."
    "Взагалі, я не вз'яв до уваги те що у Романа відсутня нога, тому і запропонував варіант з ковчегом, але якщо подумати логічно, то я дійсно сам не дотягну його, а якщо він буде стрибати на одній нозі це точно вдарить по швидкості, тож вирішено.."
    olek "Напевно ви таки праві, ведіть до того містечка"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ми йшли весь час поки не стемніло, а на ніч ми зупинились аби переночувати та з новими силами продовжити рух, спішити ж нам все одно нема куди.. "
    "Весь цей час Роман тримався досить впевнено навіть без милиць та інколи навіть підганяв мене"
    "На разі ми вже йшли десь півгодини"
    "До того місечка лишилось буквально кілька кілометрів, а поки ми не дійшли я спробував завести розмову"
    olek "Романе, я вражений вашою витривалістю. Ви справжній боєць"
    rom "Дякую, Олексію. Я навчився приймати обставини такими, які вони є, і пристосовуватись до них"
    rom "До того ж в молодості я і справді був бійцем, справжнім військовим"
    rom "Я був сапером і купу років прослужив на благо країни, але в один день я припустився помилки, а як відомо сапери помиляються лише двічі: вперше коли йдуть на сапера, а вдруге - в останнє"
    rom "Мені ще пощастило, я лишився живим, хоч і без ноги, але кому на службі потрібен каліка? В мій час нормальних протезів ще не було, тож мене просто викинули.."
    rom "..."
    rom "Вибачет, Олексію, щось я завівся"
    olek "Все нормально, я вас розумію.."
    olek "Ви точно заслуговуєте на повагу за свою сильну волю"
    rom "Та годі тобі, я просто живу як вже виходить, будь хто зробив би так само"
    olek "Ну не скажіть, ви он ідете вперед не звжаючи на жодні обставини, а багато хто просто здається, спивається чи ще щось гірше.."
    "За розмовою пройшло чимало часу і ми вже були на місці"
    "Містечко виглядало досить акуратним, в чомусь навіть мініатюрним"
    "На вуличках майже не було зеленого газу, і воно впринципі виглядало дуже безпечним"
    "Наче нічого не сталось, а місто просто спить"
    "Ми з Романом зупинились і подивились один на одного, відчуваючи втому після тривалої подорожі" 
    "Тепер ми стояли посеред містечка, готові розпочати новий етап нашого шляху в очікуванні порятунку від військових"
    "І це очікування зігрівало наші серця надією на майбутнє, в якому всі наші міста будуть виглядати так само мирно, коли все це закінчиться"
    scene end22
    pause
    if persistent.end22 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end22 = True
    return





# Рішення бігти (Заражений + Без супутниці + Без бензину) - Кінцівка 23
label Run_no_girl_no_refuel_kill_neighbor:
    olek "Я вважаю, що повертатись туди немає сенсу, тож нам треба бігти звідси, хоч кудись"
    olek "Єдине, що я взагалі не знаю куди.."
    rom "Я знаю одне невеличке містечко неподалік звідси, там має бути мало мутантів і багато ресурсів, оскільки місто було новим і його ще не встигли заселити"
    olek "А це варіант, і де те місто?"
    rom "На південь звідси"
    olek "..."
    olek "В принципі це хороший план, так ми зможемо залишитись у тому містечку про яке ви сказали поки військові не почнуть зачищати територіїї"
    olek "Проте, я тут згадав, що справжній \"Рятувальний ковчег\" також має бути на підень звідси, ми можемо спробувати дійти туди, а якщо не вийде, то повернутись до того містачка"
    rom "Напевно це такий кащий варіант, але враховуючи те що у мене немає ноги, а ви явно не зможете дотягти мене самотужки, я би запропонував передивитись варінт із тим щоб не йти до ковчега, а залишитись у містечку неподалік"
    olek "..."
    "Взагалі, я не вз'яв до уваги те що у Романа відсутня нога, тому і запропонував варіант з ковчегом, але якщо подумати логічно, то я дійсно сам не дотягну його, а якщо він буде стрибати на одній нозі це точно вдарить по швидкості, тож вирішено.."
    olek "Напевно ви таки праві, ведіть до того містечка"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ми йшли весь час поки не стемніло, а на ніч ми зупинились аби переночувати та з новими силами продовжити рух, спішити ж нам все одно нема куди.. "
    "Весь цей час Роман тримався досить впевнено навіть без милиць та інколи навіть підганяв мене"
    "На разі ми вже йшли десь півгодини"
    "До того місечка лишилось буквально кілька кілометрів, а поки ми не дійшли я спробував завести розмову"
    olek "Романе, я вражений вашою витривалістю. Ви справжній боєць"
    rom "Дякую, Олексію. Я навчився приймати обставини такими, які вони є, і пристосовуватись до них"
    rom "До того ж в молодості я і справді був бійцем, справжнім військовим"
    rom "Я був сапером і купу років прослужив на благо країни, але в один день я припустився помилки, а як відомо сапери помиляються лише двічі: вперше коли йдуть на сапера, а вдруге - в останнє"
    rom "Мені ще пощастило, я лишився живим, хоч і без ноги, але кому на службі потрібен каліка? В мій час нормальних протезів ще не було, тож мене просто викинули.."
    rom "..."
    rom "Вибачет, Олексію, щось я завівся"
    olek "Все нормально, я вас розумію.."
    olek "Ви точно заслуговуєте на повагу за свою сильну волю"
    rom "Та годі тобі, я просто живу як вже виходить, будь хто зробив би так само"
    olek "Ну не скажіть, ви он ідете вперед не звжаючи на жодні обставини, а багато хто просто здається, спивається чи ще щось гірше.."
    "За розмовою пройшло чимало часу і ми вже були на місці"
    "Містечко виглядало досить акуратним, в чомусь навіть мініатюрним"
    "На вуличках майже не було зеленого газу, і воно впринципі виглядало дуже безпечним"
    "Наче нічого не сталось, а місто просто спить"
    "Ми з Романом зупинились і подивились один на одного, відчуваючи втому після тривалої подорожі" 
    "Через втому я впав на землю підіймаючи кулак до сонця"
    olek "Ми таки зробили це.. Ми впорались"
    "Сказав я з полегшенням вдихаючи на повні груди"
    "З повітрям у легені потрапив і зелений газ"
    olek "Кхе-кхе"
    "Кашель ніби роздирав моє горло"
    rom "Пане, з вами все добре?"
    olek "Щось я не певен.."
    rom "Ви ж не можете бути зараженим, чи не так?"
    olek "Можливо, я вдихнув занадто багато ще в кімнаті у свого сусіда, який був одним з перших гуманоїдів кого я зустрів"
    rom "Ні, тільки не ви.. Скажіть, що це не правда, пане"
    olek "Я не певен, але щоб не ризикувати, я раджу тобі тікати від мене"
    rom "Але ж як я можу вас покинути? Ви ж врятували мені і.."
    olek "Романе, тікай, якщо я не стану гуманоїдом я тебе знайду"
    rom "Але ж.."
    olek "Будь ласка зроби як я прошу, щоб мені було легше"
    rom "..."
    rom "Добре, пане, я вас ніколи не забуду"
    olek "Угу, я теж вас не забуду, Романе"
    "Сказав я з награною посмішкою"
    "Роман попрямував у напрямку центра міста"
    "От і добре, що я не зможу нашкодити йому"
    "Стах принизував моє тіло, пульс пришвидшився, а диханням почастішало"
    "Легені почали перегоняти газ по всьому тілу і я відчував, як все почало мінятись"
    "Разум почав мутнішати, а тіло перестало слухатись, я більше не котролюю його, але відчуваю"
    "Я чую хрускіт моїх кісток та як вони розривають мою плоть, проростаючи у зворотньому напрямку"
    "Схоже це кінець.."
    "Все ж правду казали люди: Коли останні рештки свідомості зникають і все стає темним, останній промінчик сонця потрапляючий на сітківку стає тим самим світлом в кінці тонелю, світлом до якого можна дістатись лише переживши усе життя знову, буквально втиснувши весь свій досвід в долю секунди, яку непомітить ніхто"
    scene end23
    pause
    if persistent.end23 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end23 = True
    return





# Рішення повернутись та битись (Без супутниці + Без бензину) - Кінцівка 24
label Fight_no_girl_no_refuel:
    olek "На мою думку сенсу бігти немає, тим паче, що нам ніяк не встигнути на справжній \"Рятувальний ковчег\", тож я вважаю, що нам потрібно ораганізуватись з тими хто ще не встиг вибігти і спробувати захопити цей псевдо-ковчег"
    rom "В цьому є якийсь сенс, але вам не здається, що це занадто ризиковано? В сенсі, що нас занадто мало для повноцінного захоплення ковчега"
    rom "Я можу запропонувати добігти до маленького мітечка на північ звідси, там має бути мало гуманоїдів, тож ми зможемо спокійно пересидіти там до приходу військових"
    rom "Але вирішувати все одно вам.. Ви мене врятуваали, тож я піду за вами, яке б не було ваше рішення, пане"
    olek "Я все ж вважаю, що боротися буде найбільш оптимальним варіантом, до того ж, якщо ми будемо бігти на нас в будь який момент можуть напасти гуманоїди, а ти що скажеш, Міла?"
    mil "Я думаю, що ти правий, тим паче, що зараз команда псевдо-ковчега розгублена через поламку апаратури і це дає нам перевагу, до того ж, навіть якщо на нас не нападатимуть гуманоїди, ми все одно не стигнемо добігти до справжнього ковчега"
    rom "Ну якщо ви обидвоє так думаєте, то можна зробити і так"
    olek "Тож нам треба пробратись у середину та знайти тих хто ще не встиг вийти з псевдо-ковчега"
    rom "Тоді, полетіли!"
    "Імпровізований спец. загін почав своє просування до головного входу"
    "Величезна брама, що мала би зачинятись автоматично, була привідкрита між нею та стінкою була маленька шпаринка у яку пройти можна було лише боком"
    "Ось ми і в середині, тепер треба знайти людей"
    "Найлогічнішим рішенням було би пошукати їх у відсіку з каютами, тож тиди ми і направились"
    "На сходах сиділи ті самі чоловіки, яких ми зустріли коли тільки прибули сюди, вони ніби живуть на тих сходах"
    "Вони сиділи у суцільній темряві, тільки маленький ліхтарик підсвічував їх силуети"
    olek "Вибачте, панове, на борту є ще хтось окрім вас?"
    "Прошепотів я"
    noname "Ні, всі втекли.."
    "Чоловік на сходах відповідав з такю ж гучністю, що і вчора, ніби він не хотів приховати свою присуність"
    olek "А чого тоді ви тут?"
    noname "Так, а що нам ще втрачати? Все що у нас було все уже і так забрали обставини.."
    olek "А як же життя, свобода? У вас все ще є все для того щоб збудувати нове життя, тільки треба перемогти цих канібалів з псевдо-ковчега, вставайте!"
    "Не стримався я переходячи на крик"
    noname "Ти молодий та інфантильний, схоже справжнього жаху ти не пережив, тож ти ніяк не зрозумієш нас.."
    "От трясця, старі впертюхи, і що ж мені робити з ними..?"
    rom "Дозвольте я спробую, пане"
    "Тихо сказав мені Роман"
    rom "Вибачте, панове, можливо ми ніколи не зрозуміємо того, що ви пережили. Але ось що я хочу сказати вам: якщо ви здастесь зараз, який сенс було все це переживати? Нащо ви боролися за життя тоді, якщо не хочете боротися за нього прямо зараз?"
    rom "Разом, панове, ми зможемо перемогти наших ворогів. Ми можемо дочекатись справжніх військових перемог, і тоді настане час, коли ми зможемо зажити повноцінним життям"
    rom "Подивіться на себе: ви, здорові фізично, здатні до багато більшого. Якщо так людина без ноги, як я, може встати та йти на зустріч майбутньому, то чому ж ви, панове, не можете встати та йти? Не дозволяйте своєму минулому обмежувати вас"
    noname "..."
    "Чоловіки на сходах так само сиділи"
    rom "Я розумію, що все що ви прожили залишить на ваших серцях невиправний шрам, але якщо ви зараз не встанете, вони скоро перестануть битися.."
    noname "..."
    "Схоже вони нам не допоможуть"
    olek "Добре, Романе, ми спробували, але вони не хочуть боротись за життя, ходімо"
    "Роман ще кілька секунд стояв дивлячись на чоловіків, що сиділи на сходах, але з рештою розвернувася"
    rom "Так, пане"
    "Ми почали відходити в іншу частину псевдо-ковчега розмірковуючи над подальшими діями"
    "Схоже вдвох битись у нас не вийде, то тікати було більш правильним рішенням?"
    "Ні, тікати вже немає куди, тож.."
    "Мої роздуми перервав шурхіт з їдальні"
    kok "То ви ще тут.. Дивіться, хлопці, їжа сама прийшла до кухаря"
    "Команда-псевдо-ковчега засміялась"
    olek "Тепер ти будеш корчити з себе капітана?"
    kok "Я? Ні що ти.. Я просто попрошу своїх помічників принести нам інгридієнтів"
    kok "До речі ви їх частина.."
    "Шляху назад більше немає, ми просто не встигнемо нічого зробити, тож лишається лише битись"
    kok "Розберіться з ними швиденько, а в нагороду я дам вам добавки!"
    noname "Так, пане!"
    "Команда псевдо-ковчега наближалася швидко, зберігаючи формування"
    "Люди з обох сторін були напружені та готові до протистояння"
    olek "Тепер у нас вже немає шляху назад. Переможемо їх!!!"
    rom "Так!"
    "Команда псевдо-ковчега була озброєна ножами"
    "Моє серце билося так швидко, що мої руки тряслися, але відчуття адреналіну переважало, підштовхуючи мене вперед"
    "Без роздумів я кинувся на одного зі злочинців першим, маючи надію здивувати його і завдати удару"
    "Але, на жаль, він виявився швидкішим і дотягнувся до мене своїм ножем"
    "У останній мить я виконав кидок убік, уникнувши удару, але рана від ножа почала виливати кров на мою одяг"
    "Звернувшись до своїх останніх сил, я стрибнув на спину одному з нападників і впіймав його в душогубку"
    "Він кричав і спробував звільнитись, але я стиснув його ще сильніше"
    "Його відчайні стукивання та повзання по землі стали останніми його проявами життя"
    "Взятий на больовий, його безжиттєве тіло впало на землю"
    "Проте це була моя єдина перемога в цій битві"
    "Інші вороги почали оточувати мене, заходячи ззаду, намагаючись знайти слабке місце"
    "Я продовжував прикриватись живим щитом, використовуючи тіло мертвого канібала, щоб утримати їх хоча б на кілька секунд"
    "Але мої сили розтікалися кров'ю, що вже ляпала під ногами, поки рани від ножів болісно нагадували про своє існування"
    "Здавалося, що мій кінець наближався"
    "Вороги все ближче підкрадалися, а я не мав сили боротися далі"
    "Роман намагаючись виграти мені трохи часу також почав зближатись з ворогом на своїй одній нозі"
    "Його очі блищали від рішучості, але я відчував, що його сили також на межі"
    "Вороги наближалися все швидше, а Роман не зміг тримати їх усіх на відстані"
    "Через кілька митейних миттєвостей, один з них проник між нашими оборонними лініями і замахнувся ножем на Романа"
    "Він встиг зробити лише один відчайдушний рух, щоб зупинити удар, але втратив рівновагу та впав"
    "Канібал, що напав на нього наближався, Роман намагався відбиватись ногою, але цього виявилось замало"
    "Ніж ковзнув між ребер Романа залишивши там порожнину, яку вже не залатаєш"
    olek "Романе!!!"
    olek "Ви, курви, заплатите за це"
    noname "Я так не думаю"
    "Сказав канібал у мене за спиною"
    "Він швидко засунув ніж мені в спину та провернув його кілька разів"
    "З криком болю, я впав на коліна, відчуваючи, як сили покидають моє тіло"     
    "Моя рука поглинула кров, що бризкала з мого поранення, але я не збирався здаватись" 
    "З останніми залишками волі, я зібрав усю силу, що залишилась, і повернувся до канібала"
    olek "Ви... заплатите... за все!" 
    "Мій голос звучав хрипко і наповнений ненавистю"
    "Мої руки стислися на горлі канібала, а очі мої засіяли від злості і визначності" 
    "Він кашлянув кров'ю, намагаючись звільнитись, але я не відпускав його" 
    "Мої останні краплі життєвої сили перетворились на рішучість, яка жила в моїх очах"
    noname "Це твій кінець, падло!"
    "Проскреготів канібал"
    olek "Якщо я і помру, то заберу тебе з собою!"
    "Промовив я з потугою, посилюючи свій хватку"
    "Зі всякою силою, яку я зміг зібрати, я стиснув його ще сильніше" 
    "Він марився і боровся, але мої руки були непохитними"
    "Його останні подихи вимирали, а мої рани зливалися з його кров'ю"
    "В решті-решт, його безжиттєве тіло розслабилося, і я випустив його" 
    "Він впав на землю, я ж зміг протириматись трохи більше, але не на багато більше"
    "За кілька секунд моє тіло також впало, а моя свідомість зникла, залишивши мене поглинутим темрявою"
    scene end24
    pause
    if persistent.end24 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end24 = True
    return





# Рішення повернутись та битись (Заражений + Без супутниці + Без бензину) - Кінцівка 25
label Fight_no_girl_no_refuel_kill_neighbor:
    olek "На мою думку сенсу бігти немає, тим паче, що нам ніяк не встигнути на справжній \"Рятувальний ковчег\", тож я вважаю, що нам потрібно ораганізуватись з тими хто ще не встиг вибігти і спробувати захопити цей псевдо-ковчег"
    rom "В цьому є якийсь сенс, але вам не здається, що це занадто ризиковано? В сенсі, що нас занадто мало для повноцінного захоплення ковчега"
    rom "Я можу запропонувати добігти до маленького мітечка на північ звідси, там має бути мало гуманоїдів, тож ми зможемо спокійно пересидіти там до приходу військових"
    rom "Але вирішувати все одно вам.. Ви мене врятуваали, тож я піду за вами, яке б не було ваше рішення, пане"
    olek "Я все ж вважаю, що боротися буде найбільш оптимальним варіантом, до того ж, якщо ми будемо бігти на нас в будь який момент можуть напасти гуманоїди, а ти що скажеш, Міла?"
    mil "Я думаю, що ти правий, тим паче, що зараз команда псевдо-ковчега розгублена через поламку апаратури і це дає нам перевагу, до того ж, навіть якщо на нас не нападатимуть гуманоїди, ми все одно не стигнемо добігти до справжнього ковчега"
    rom "Ну якщо ви обидвоє так думаєте, то можна зробити і так"
    olek "Тож нам треба пробратись у середину та знайти тих хто ще не встиг вийти з псевдо-ковчега"
    rom "Тоді, полетіли!"
    "Імпровізований спец. загін почав своє просування до головного входу"
    "Величезна брама, що мала би зачинятись автоматично, була привідкрита між нею та стінкою була маленька шпаринка у яку пройти можна було лише боком"
    "Ось ми і в середині, тепер треба знайти людей"
    "Найлогічнішим рішенням було би пошукати їх у відсіку з каютами, тож тиди ми і направились"
    "На сходах сиділи ті самі чоловіки, яких ми зустріли коли тільки прибули сюди, вони ніби живуть на тих сходах"
    "Вони сиділи у суцільній темряві, тільки маленький ліхтарик підсвічував їх силуети"
    olek "Вибачте, панове, на борту є ще хтось окрім вас?"
    "Прошепотів я"
    noname "Ні, всі втекли.."
    "Чоловік на сходах відповідав з такю ж гучністю, що і вчора, ніби він не хотів приховати свою присуність"
    olek "А чого тоді ви тут?"
    noname "Так, а що нам ще втрачати? Все що у нас було все уже і так забрали обставини.."
    olek "А як же життя, свобода? У вас все ще є все для того щоб збудувати нове життя, тільки треба перемогти цих канібалів з псевдо-ковчега, вставайте!"
    "Не стримався я переходячи на крик"
    noname "Ти молодий та інфантильний, схоже справжнього жаху ти не пережив, тож ти ніяк не зрозумієш нас.."
    "От трясця, старі впертюхи, і що ж мені робити з ними..?"
    rom "Дозвольте я спробую, пане"
    "Тихо сказав мені Роман"
    rom "Вибачте, панове, можливо ми ніколи не зрозуміємо того, що ви пережили. Але ось що я хочу сказати вам: якщо ви здастесь зараз, який сенс було все це переживати? Нащо ви боролися за життя тоді, якщо не хочете боротися за нього прямо зараз?"
    rom "Разом, панове, ми зможемо перемогти наших ворогів. Ми можемо дочекатись справжніх військових перемог, і тоді настане час, коли ми зможемо зажити повноцінним життям"
    rom "Подивіться на себе: ви, здорові фізично, здатні до багато більшого. Якщо так людина без ноги, як я, може встати та йти на зустріч майбутньому, то чому ж ви, панове, не можете встати та йти? Не дозволяйте своєму минулому обмежувати вас"
    noname "..."
    "Чоловіки на сходах так само сиділи"
    rom "Я розумію, що все що ви прожили залишить на ваших серцях невиправний шрам, але якщо ви зараз не встанете, вони скоро перестануть битися.."
    noname "..."
    "Схоже вони нам не допоможуть"
    olek "Добре, Романе, ми спробували, але вони не хочуть боротись за життя, ходімо"
    "Роман ще кілька секунд стояв дивлячись на чоловіків, що сиділи на сходах, але з рештою розвернувася"
    rom "Так, пане"
    "Ми почали відходити в іншу частину псевдо-ковчега розмірковуючи над подальшими діями"
    "Схоже вдвох битись у нас не вийде, то тікати було більш правильним рішенням?"
    "Ні, тікати вже немає куди, тож.."
    "Мої роздуми перервав шурхіт з їдальні"
    kok "То ви ще тут.. Дивіться, хлопці, їжа сама прийшла до кухаря"
    "Команда-псевдо-ковчега засміялась"
    olek "Тепер ти будеш корчити з себе капітана?"
    kok "Я? Ні що ти.. Я просто попрошу своїх помічників принести нам інгридієнтів"
    kok "До речі ви їх частина.."
    "Шляху назад більше немає, ми просто не встигнемо нічого зробити, тож лишається лише битись"
    kok "Розберіться з ними швиденько, а в нагороду я дам вам добавки!"
    noname "Так, пане!"
    "Команда псевдо-ковчега наближалася швидко, зберігаючи формування"
    "Люди з обох сторін були напружені та готові до протистояння"
    olek "Тепер у нас вже немає шляху назад. Переможемо їх!!!"
    rom "Так!"
    "Команда псевдо-ковчега була озброєна ножами"
    "Моє серце билося так швидко, що мої руки тряслися, але відчуття адреналіну переважало, підштовхуючи мене вперед"
    "Без роздумів я кинувся на одного зі злочинців першим, маючи надію здивувати його і завдати удару"
    "Але, на жаль, він виявився швидкішим і дотягнувся до мене своїм ножем"
    "У останній мить я виконав кидок убік, уникнувши удару, але рана від ножа почала виливати кров на мою одяг"
    "Звернувшись до своїх останніх сил, я стрибнув на спину одному з нападників і впіймав його в душогубку"
    "Він кричав і спробував звільнитись, але я стиснув його ще сильніше"
    "Його відчайні стукивання та повзання по землі стали останніми його проявами життя"
    "Взятий на больовий, його безжиттєве тіло впало на землю"
    "Проте це була моя єдина перемога в цій битві"
    "Інші вороги почали оточувати мене, заходячи ззаду, намагаючись знайти слабке місце"
    "Я продовжував прикриватись живим щитом, використовуючи тіло мертвого канібала, щоб утримати їх хоча б на кілька секунд"
    "Але мої сили розтікалися кров'ю, що вже ляпала під ногами, поки рани від ножів болісно нагадували про своє існування"
    "Здавалося, що мій кінець наближався"
    "Вороги все ближче підкрадалися, а я не мав сили боротися далі"
    "Роман намагаючись виграти мені трохи часу також почав зближатись з ворогом на своїй одній нозі"
    "Його очі блищали від рішучості, але я відчував, що його сили також на межі"
    "Вороги наближалися все швидше, а Роман не зміг тримати їх усіх на відстані"
    "Через кілька митейних миттєвостей, один з них проник між нашими оборонними лініями і замахнувся ножем на Романа"
    "Він встиг зробити лише один відчайдушний рух, щоб зупинити удар, але втратив рівновагу та впав"
    "Канібал, що напав на нього наближався, Роман намагався відбиватись ногою, але цього виявилось замало"
    "Ніж ковзнув між ребер Романа залишивши там порожнину, яку вже не залатаєш"
    "Я набрав повні легені повітря та закричав"
    olek "Романе!!!"
    olek "Ви, курви, заплатите за це"
    olek "Кхе-кхе.."
    "Схоже, через те що я набрав повні легені повітря газ проник у них"
    "І всі м'язи мого тіла почали здригатися, змінюючи свою форму і структуру"
    "Мої руки і ноги почали втрачати свою відому форму, перетворюючись на щось нове, щось абсолютно чужорідне моєму сприйняттю свого тіла"
    "Пальці зливалися і змінювалися, набуваючи пропорцій та структури п'ястуків"
    "Схоже, перетворення майже скінчилось.."
    kok "Тепер це їсти не можна"
    "Він дістав пістолет з під фартука та стрільнув у мене"
    "Шкіра ще не встигла стати гуманоїдною, тож куля досить добре прошила її"
    $ olek = Character("Олексій", color="#009900")
    olek "Ааааа!"
    "Біль пронизав моє тіло, але перетворення вже не зупинити"
    "Кістки почали ламатись та рости у зворотньому напрямку, а свідомість почалу мутнішати"
    "Десь в далені я ще чув якісь крики від кока"
    kok "Якого біа?! Добийте його!"
    "За мить з того ж напрямку пролунало ще три постріли"
    "Одина з кулей попала мені в голову, друга в плече, а третя в грудну клітину"
    "Газ із моїх легеней почав розпливатись псевдо-ковчегом"
    "До цього моменту в голові був лише мій голос, що стихав що миті, але тепер я почав чути наближення якихось інших голосів, більш грубих та кровожерливих"
    "Невже саме так і почувається мозок гуманоїда коли він підєднується до телепатичної мережі?"
    "Зі стогоном, я почав занурюватись у безодню нового для мене світу сприйняття, де усе спільне, навіть думки"
    "Як же ж не приємно.."
    scene end25
    pause
    if persistent.end25 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end25 = True
    return





# Рішення не рятувати полоненого (Без супутниці + Без бензину)
label Not_help_captive_no_girl_no_refuel:
    "І все ж ми не можемо його врятувати"
    "Він буде лише заважати, та й провізії ніяк не вистачить на нас двох"
    "Опустивши голову, я попрямував до виходу"
    olek "Пробач"
    "Шепотів я"
    olek "Пробач, але нам тоді не вижити"
    "Короткий коридор, що вів до виходу здавався безкінечним"
    "Кожен крок відчувався, як крок від людяності, але це було раціональне рішення, рішення яке вело до виживання"
    "Я нарешті вийшов на двір"
    "Це взагалі не давало мені ніяких гарантій безпеки, але хоча б я не зможу побачити очі того полоненого"
    "..."
    "Добре, тепер мені треба дістатись до машини"
    "Я почав просуватись в здовж літака так щоб мене не помітили"
    "Кожен крок був дуже напруженим"
    "Я намагався видавати як омога менше звуків, аби мене не помітили"
    "Так як псевдо-ковчег залишився без світла жодні охолоджувачі, системи подавання кисню і таке інше не працювали, то всі звуки з середини були багатократно підсилені через відлуння, і чутні на зовні"
    "Тож кожен шурхіт в середині зупиняв на секунду кожного з нашої трійці"
    "Врешті решт я дістались до свого пошарпаного автомобіля"
    "Я заліз в середину вставивши ключ в запалювання"
    "Проворот.. {w} Невдача"
    "Іще раз проворот.. {w} І знову невдача"
    "От трясця!"
    "Чому саме зараз ти не заводишся?"
    "..."
    "Поглянувши на панель я помітив, що бензину більше нема"
    "Як завжди у найпідходящий момент"
    "Тоді все це було даремно і мене з'їдять канібали?"
    "Ні, я цього точно не хочу"
    "Тоді думай, думай.."
    "..."
    "Взагалі зараз мені в голову приходять лише два варіанти: або бігти, або спробувати захопити цей муляж ковчега"
    "І що ж мені обрати?"
    "..."
    menu:
        "Бігти пішки":
            if is_kill_neighbor == False:
                jump Run_no_girl_no_refuel_not_help
            else:
                jump Run_no_girl_no_refuel_not_help_kill_neighbor
        "Повернутись і битись":
            if is_kill_neighbor == False:
                jump Fight_no_girl_no_refuel_not_help
            else:
                jump Fight_no_girl_no_refuel_not_help_kill_neighbor
    return
# Рішення бігти пішки (Без супутниці + Без бензину + Без полоненого) - Кінцівка 26
label Run_no_girl_no_refuel_not_help:
    "Ні, все ж варіант лише одни"
    "Якщо я сам піду проти всієї команди ковчега, навіть з перевагою того що весь псевдо-ковчега знаходиться у суцільній темряві, я все одно не зможу перемогти"
    "Залишається лише бігти, але куди?"
    "Я не знаю про найближчі міста, тож суватись у них прото так - це просто наразити себе на небезпеку"
    "Тоді, назад?"
    "Ні, я не зможу повернутись назад просто так.. Тож цей варіант не підходить.."
    "Думай, думай.."
    "Куди я ще можу податись?"
    "..."
    "Може до минулих координат \"Рятувального ковчега\"?"
    "Можливо він все ж таки знаходться там, і всі хто туди прийшли просто не підозрюють про те що тут коїться.."
    "Вирішено, я відправляюсь туди!"
    window hide
    scene day_7 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "Ніч пройшла спокійно, я йшов майже усю ніч не зупиняючись"
    "Десь під ранок я помітив групу гуманоїдів, що рухалась у напрямку справжнього \"Рятувального ковчега\", але мені повезло, вони мене не помітили"
    "На разі вже майже день, точніше одинадцята година, вже пройшло хвилин тридцять, як я вийшов на трасу в надії, що хтось ще їде на машині і зможе мене підібрати, проте нікого не було навіть на горизонті"
    "Робити кроки дедалі важче, але мені треба дійти"
    "Якщо йти ще є куди.."
    "Так, стоп! Мені потрібно відкинути ці думки та просто рухатись вперед, я точно зможу дійти, і ковчег ще буде там чекати на мене"
    "Мої думки перебило ревіння мотору"
    "Невже, я таки зможу дітатись до ковчега вчасно?"
    "Невже все це було не даремно.."
    "Я озирнувя та побачив байки, що наближались до мене, в них їхали люди в чомусь між піджаком та військовою формою, яточно їх нізким не зплутаю"
    "Це екіпаж клятого псевдо-ковчега"
    "Я розвернувся, аби побігти в хащі лісу, де у мене може бути трохи більше шансів на виживання, але із-за кущів, судячи з усього, на звук моторів вибігла зграйка гуманоїдів"
    "Я не можу здатись зараз..!"
    "Мені потрібен план.."
    "Мені потрібно десь сховатись"
    "Але куди..? Куди ж?"
    "..."
    "Часу думати нема, тоді туди"
    "Я побіг на переріз між гуманоїдами та командою псевдо-ковчега у напрямку лісу"
    "Але зробивши один крок я відчув, як ноги підкошуються"
    "Мені зараз це нідо чого, борися!"
    "Я намагався зробити ще один крок, але ноги мене вже зовсім не тримають"
    "Я просто впав на землю, але не полишив спроб на боротьбу"
    "Я почав повзти на руках, але мої рухи були немічні та важкі"
    "Серце билось так швидко, що я навіть не міг зосередитись на своїх діях"
    "Гуманоїди та екіпаж псевдо-ковчега наближалися все більше і більше, а я вже не мав жодних сил їм протистояти"
    olek "Ось схоже і кінець"
    "Сказав я з гіркою посмішкою перевернувшись на спину"
    "Вже не важливо було від кого я загину – від гуманоїдів чи канібалів, тепер мені вже однаковісінько"
    "І все ж я зробив усе, що міг"
    "Це були веселі дев'ятнадцять років.."
    scene end26
    pause
    if persistent.end26 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end26 = True
    return





# Рішення бігти пішки (Заражений + Без супутниці + Без бензину + Без полоненого) - Кінцівка 27
label Run_no_girl_no_refuel_not_help_kill_neighbor:
    "Г.г. біжать у напрямку минулих координат ковчега"
    "День 7"
    "Він чує як канібали з псевдо ковчега на мотоциклах наздоганяють його ззаду, зпереду сунуть гуманоїди"
    "Він падає абсолютно безсилий в очікувані неминучого кінця, який може прийти з будь якого боку, але канібали побачивши велику групу гуманоїдів розвертаються та прямують назад, а г.г. починає кашляти зеленим газом і перетворюється на гуманоїда, зайнявши своє місце у їх зграї"
    scene end27
    pause
    if persistent.end27 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end27 = True
    return





# Рішення повернутись та битись (Без супутниці + Без бензину + Без полоненого) - Кінцівка 28
label Fight_no_girl_no_refuel_not_help:
    "Все ж бігти нема куди, тож залишається битись"
    "Битись з чималою командою псевдо-ковчега самотужки"
    "Хоча, там, в середині, можливо ще залишились люди з якими я міг би обєднатись"
    "Тоді для початку потрібно провести маленьку розвідку, а потім вже вступати в бій"
    "Все врішивши я почав своє просування до головного входу"
    "Величезна брама, що мала би зачинятись автоматично, була привідкрита між нею та стінкою була маленька шпаринка у яку пройти можна було лише боком"
    "За кілька секунд протискування себе крізь ті двері я нарешті опинився в середині, лишається лише знайти когось ще для боротьби"
    "Найлогічнішим рішенням було би шукати людей у відсіку з каютами, тож тиди я і направився"
    "На сходах сиділи ті самі чоловіки, яких я зустрів коли тільки прибули сюди, вони ніби живуть на тих сходах"
    "Вони сиділи у суцільній темряві, тільки маленький ліхтарик підсвічував їх силуети"
    olek "Вибачте, панове, на борту є ще хтось окрім вас?"
    "Прошепотів я"
    noname "Ні, всі втекли.."
    "Чоловік на сходах відповідав з такю ж гучністю, що і вчора, ніби він не хотів приховати свою присуність"
    olek "А чого тоді ви тут?"
    noname "Так, а що нам ще втрачати? Все що у нас було все уже і так забрали обставини.."
    olek "А як же життя, свобода? У вас все ще є все для того щоб збудувати нове життя, тільки треба перемогти цих канібалів з псевдо-ковчега, вставайте!"
    "Не стримався я переходячи на крик"
    noname "Ти молодий та інфантильний, схоже справжнього жаху ти не пережив, тож ти ніяк не зрозумієш нас.."
    "От трясця, старі впертюхи.."
    "Таких не переконаєш.. тож доведеться придумувати план в яому я б зміг перемогти сам"
    "В голові почали роїтись варіанти з можливих та неможливих бойовиків, хорорів та ще чогось, що я точно не можу характеризувати, але всі вони втрачали актуальність, як тільки я згадував, що це не фільм і я далеко не такий тренований, як ті персонажі"
    "Тож роздуми продовжувались, але в голову не лізло нічого особливо реалістичного"
    "Мої роздуми перервав шурхіт з їдальні"
    kok "То ти ще тут.. Дивіться, хлопці, їжа сама прийшла до кухаря"
    "Команда псевдо-ковчега засміялась"
    olek "Тепер ти будеш корчити з себе капітана?"
    kok "Я? Ні що ти.. Я просто попрошу своїх помічників принести нам інгридієнтів"
    kok "До речі ви їх частина.."
    "Шляху назад більше немає, я просто не встигну нічого зробити, тож лишається лише битись"
    kok "Розберіться з ним швиденько, а в нагороду я дам вам добавки!"
    noname "Так, пане!"
    "Команда псевдо-ковчега наближалася швидко, зберігаючи формування"
    "Люди з обох сторін були напружені та готові до протистояння"
    "Тепер шляху назад немає. Лишається лише перемогти їх.."
    "Команда псевдо-ковчега була озброєна ножами і вже прямувала до мене"
    "Що секунди команда псевдо-ковчега наблизилася все ближче і ближче, їхні зброї і готовність до бою були очевидними, я ж знаходився перед ними, беззахисний і не в змозі зробити навіть найменший крок, щоб захистити себе"
    "Єдина думка, яка свердлила мій мозок у цю мить це - якби ж я був тут не сам..."
    "Але саме мої рішення залишили мене тут самого, вони були абсолюто раціональні тоді, але на довгому відрізку, якби я вчинив інакше, мені б не довелось боротись одному"
    "Проте зараз вже пізно жаліти про минуле, я маю зосередитись на теперішньому"
    "Рухаючись уперед, я стиснув кулаки і глибоко вдихнув"
    "Відчував, як натхнення та воля до життя повертаються до мене"
    "Хоча навколо мене немає нікого, я знаю, що всі люди помирають на одинці, отже навіть якщо врятував всіх кого тільки міг, нічого не змінилося б.."
    "Але саме це розуміння не дає мені здаватись" 
    "Я вирішив боротися до кінця, навіть якщо моя доля вже заздалегідь вирішена"
    "Може, саме в цьому відчайдушному акті волі я знайду сенс своєї існування, який досі шукав" 
    "І хоча тепер важко вірити, що мої рішення можуть щось змінити, я зберігаю в собі надію на чудо"
    "Серце почало вириватись з грудей ніби очікуючи удару, але руки стислись в кулаки, аби дати відсіч ворогам"
    "На мить часу все сповільнилося" 
    "Я бачив, як вони підносять свої ножі, готуючись до удару"
    "Їх рухи були координаційними та точними, як удари хореографії смерті"
    "Я дивом встиг ухилитись від першого удару, що був націлений у моє тіло та спробував прорватись до кока, аби взяти його в заручники"
    "Мій рух у напрямку команди псевдо-ковчега був зухвалим і непередбачуваним"
    "Вони на мить навіть відступили від несподіванки, але все ж швидко зібрались"
    "Не дивлячись на їх згуртованість мій маршр-кидок схоже вдався, оскільки я зміг оббігти їх команду з боку"
    "Кок вже йшов у бік їдальні і не дивився на те що коїться за спиною, тож я скориставшись цим атакував його зі спини"
    kok "Якого біса?!"
    olek "Ти програв, падло, тепер ти виведеш мене і накажеш своїм посіпакам йти звідси"
    kok "..."
    kok "Ви чули його, забирайтесь звідси!"
    noname "Але ж, пане.."
    kok "Тобі потрібно ще раз повторити?!"
    noname "Ні, пане"
    noname "Забираймось звідси, хлопці"
    "Канібали почали забиратися з псевдо-ковчега, а я залишився на ньому з коком, якого все ще тримав в заручниках"
    kok "Ти хочеш ще чогось?"
    olek "Хочу, щоб ви всі відповіли за свої вчинки"
    kok "Ну-ну, удачі, у нас же тут апокаліпсис, якщо ти не забув.. Нікому до цього всього і діла не буде.."
    "Кок почав якось дивно вовтузитись"
    olek "А ну не сіпайся!"
    kok "Просто нога зачисалась, невже не можна навіть ногу почесати? І хто тут ще ворог людства?"
    "З насмішкою сказав кок"
    olek "Замовкни, я ще думаю, що саме з тобою зробити.."
    kok "Схоже ти вже нічого не зробиш, солоденький!"
    olek "Що?"
    "В цей момент мою плоть щось розірвав"
    "Я трохи ослабив хватку і кок одразуж вислизнув показуючи ніж"
    "Його карман був розірваний, тож напевно коли він вовтузився він таки розірвав свій карман, після чого дістав звідти ніж"
    olek "Чорт побери! Ти ж мене хотів накласти на цей ніж!"
    kok "Ха! Ти думав, що я буду беззахисним? Я завжди готовий до будь-яких ситуацій!"
    olek "Це не закінчиться так просто. Я знайду тебе і поверну свою справедливість!"
    "Зляканий кок швидко вибіг з псевдо-ковчга залишивши мене стікати кров'ю у темряві"
    "Кров капала на підлогу в суцільній тиші відбиваючись луною від усіх стін"
    "Я відчував як життєва сила полишає мене разом із кров'ю, але я все ще не здався"
    "Я не покину своєї мети, а ти ніколи не сховаєшся від своїх вчинків"
    "Втім, як і я.."
    "Я міг врятувати і того полоненого, і ту дівчину з магазину біля зброярні, але я злякався.."
    "Злякався померти допомагаючи людям, яких ніколи не знав, а тепер я помираю на самоті в суцільній тиші"
    "Напевно так мені і треба.."
    scene end28
    pause
    if persistent.end28 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end28 = True
    return





# Рішення повернутись та битись (Заражений + Без супутниці + Без бензину + Без полоненого) - Кінцівка 29
label Fight_no_girl_no_refuel_not_help_kill_neighbor:
    "Все ж бігти нема куди, тож залишається битись"
    "Битись з чималою командою псевдо-ковчега самотужки"
    "Хоча, там, в середині, можливо ще залишились люди з якими я міг би обєднатись"
    "Тоді для початку потрібно провести маленьку розвідку, а потім вже вступати в бій"
    "Все врішивши я почав своє просування до головного входу"
    "Величезна брама, що мала би зачинятись автоматично, була привідкрита між нею та стінкою була маленька шпаринка у яку пройти можна було лише боком"
    "За кілька секунд протискування себе крізь ті двері я нарешті опинився в середині, лишається лише знайти когось ще для боротьби"
    "Найлогічнішим рішенням було би шукати людей у відсіку з каютами, тож тиди я і направився"
    "На сходах сиділи ті самі чоловіки, яких я зустрів коли тільки прибули сюди, вони ніби живуть на тих сходах"
    "Вони сиділи у суцільній темряві, тільки маленький ліхтарик підсвічував їх силуети"
    olek "Вибачте, панове, на борту є ще хтось окрім вас?"
    "Прошепотів я"
    noname "Ні, всі втекли.."
    "Чоловік на сходах відповідав з такю ж гучністю, що і вчора, ніби він не хотів приховати свою присуність"
    olek "А чого тоді ви тут?"
    noname "Так, а що нам ще втрачати? Все що у нас було все уже і так забрали обставини.."
    olek "А як же життя, свобода? У вас все ще є все для того щоб збудувати нове життя, тільки треба перемогти цих канібалів з псевдо-ковчега, вставайте!"
    "Не стримався я переходячи на крик"
    noname "Ти молодий та інфантильний, схоже справжнього жаху ти не пережив, тож ти ніяк не зрозумієш нас.."
    "От трясця, старі впертюхи.."
    "Таких не переконаєш.. тож доведеться придумувати план в яому я б зміг перемогти сам"
    "В голові почали роїтись варіанти з можливих та неможливих бойовиків, хорорів та ще чогось, що я точно не можу характеризувати, але всі вони втрачали актуальність, як тільки я згадував, що це не фільм і я далеко не такий тренований, як ті персонажі"
    "Тож роздуми продовжувались, але в голову не лізло нічого особливо реалістичного"
    "Мої роздуми перервав шурхіт з їдальні"
    kok "То ти ще тут.. Дивіться, хлопці, їжа сама прийшла до кухаря"
    "Команда псевдо-ковчега засміялась"
    olek "Тепер ти будеш корчити з себе капітана?"
    kok "Я? Ні що ти.. Я просто попрошу своїх помічників принести нам інгридієнтів"
    kok "До речі ви їх частина.."
    "Шляху назад більше немає, я просто не встигну нічого зробити, тож лишається лише битись"
    kok "Розберіться з ним швиденько, а в нагороду я дам вам добавки!"
    noname "Так, пане!"
    "Команда псевдо-ковчега наближалася швидко, зберігаючи формування"
    "Люди з обох сторін були напружені та готові до протистояння"
    "Тепер шляху назад немає. Лишається лише перемогти їх.."
    "Команда псевдо-ковчега була озброєна ножами і вже прямувала до мене"
    "Що секунди команда псевдо-ковчега наблизилася все ближче і ближче, їхні зброї і готовність до бою були очевидними, я ж знаходився перед ними, беззахисний і не в змозі зробити навіть найменший крок, щоб захистити себе"
    "Єдина думка, яка свердлила мій мозок у цю мить це - якби ж я був тут не сам..."
    "Але саме мої рішення залишили мене тут самого, вони були абсолюто раціональні тоді, але на довгому відрізку, якби я вчинив інакше, мені б не довелось боротись одному"
    "Проте зараз вже пізно жаліти про минуле, я маю зосередитись на теперішньому"
    "Рухаючись уперед, я стиснув кулаки і глибоко вдихнув"
    "Відчував, як натхнення та воля до життя повертаються до мене"
    "Хоча навколо мене немає нікого, я знаю, що всі люди помирають на одинці, отже навіть якщо врятував всіх кого тільки міг, нічого не змінилося б.."
    "Але саме це розуміння не дає мені здаватись" 
    "Я вирішив боротися до кінця, навіть якщо моя доля вже заздалегідь вирішена"
    "Може, саме в цьому відчайдушному акті волі я знайду сенс своєї існування, який досі шукав" 
    "І хоча тепер важко вірити, що мої рішення можуть щось змінити, я зберігаю в собі надію на чудо"
    "Серце почало вириватись з грудей ніби очікуючи удару, але руки стислись в кулаки, аби дати відсіч ворогам"
    "На мить часу все сповільнилося та я зробив глибокий вдих"
    "Він прогнав кисень по миїм легеням, але з киснем до легеней потрапив і зелений газ"
    "Я відчув, як він шкрябнув стінки мого горла та потрапив до легеней"
    olek "Кхе-кхе"
    "Кашель проравався крізь мій рот"
    "Канібали з псевдо-ковчега, схоже вирішили скористатись тим, що я закашлявся, та почали наближатися швидше готуючи ножі до атаки"
    "Я це бачив, але біль пронизав усе моє тіло"
    "Кістки хрустіли проростаючи у зворотньому напрямку, свідомість почала притуплюватись, а все що відбувалось навколо стало віддалятись"
    "Схоже процес перетворення вже почався і його не зупинити"
    "Серце б'ється все слабше, а дихання стає все важчим"
    "Тіла канібалів наближаються до мене, їхні обличчя перетворюються на іскристу маску"
    "Всі почуття перемішуються та переливаються, я вже точно не знаю, що саме мною рухає, почуття страху, відповідальності.."
    "Ні, це лють"
    "Чиста, первісна лють, яка пожерає усі інші емоції"
    "Мені просто треба вбити усіх мої ворогів"
    "Мені просто треба вбити, щоб заспокоїтись"
    "Я підняв свої руки, що вже здавалися не моїми, і зіткнувся зі своїми ворогами лицем до лиця"
    "Останній відплив свідомості викликав звірячий голос у моїй голові, підтверджуючи безжальну суть моїх дій"
    "Нічого більше не має значення, крім знищення, яке завершить мої муки і заглушить крики усередині"
    "Канібали відчули мою безжальну вирішучість і теж стали зближуватись зі зловісними посмішками на обличчях"
    "Удар за ударом, кров за кров, я вперто рухався вперед, забуттям знімаючи верству гуманності, аби врешті завершити цей макабричний танець на крилах самознищення"
    scene end29
    pause
    if persistent.end29 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end29 = True
    return




# Кінетична візуальна новела - Секретна кінцівка 30
label Secret_end:
    # Звук будильника
    scene awakening_1
    ""
    scene awakening_2
    "..."
    scene awakening_3
    "Це знову був той сон.."
    scene awakening_4
    "Давно ж він мені не снився.."
    scene military_room
    "Напевно останній раз був рік тому"
    "В день коли на місто впав метеорит і змінив усе"
    "Спогади почали спливати у моїй голові, а шкірою пробіг нестерпний холодок"
    "Ніби, для закріплення ефекту мені в очі впав подряпаний щоденник" 
    "Щоенник, який лежав на поличці ніби чекаючи щоб я його взяв повернувшись до минулого, яке я би волів забути"
    "Я робив записи у нього у ті дні, коли все це починалось, коли ще було відчуття, що все це може швидко скінчитись та повернутись до звичайного життя"
    "Дивлячись на цей подряпаний щоденник, я відчував, як він тягне мене до себе"
    "Спогади у моїй голові, ще не збілки, тому я не хотів собі нагадувати те що тоді відбувалось, але рука мимоволі сама тяглася до маленького блокнотика відкриваючи перші сторінки"
    scene military_diary
    "На форзаці було написано: \"Від люблячих батьків, для найкращого сина\""
    "Це був останній подарунок на день сина, який я отримав від них. Тепер я навіть не знаю, чи живі вони, чи щось сталося. Жодної вісточки..."
    "Я почав читати"
    nvl clear
    diary """
    
    ~ День 1 ~ 20.11 ~

    Сьогодні на місто впав метеорит, який приніс з собою, якийсь зелений газ з космосу

    Якщо я правильно зрозумів, то він, газ, може перетворювати людей на якихось гуманоїдів

    Отже йти до людей не дуже хороша ідея, особливо, якщо люди озброєні, оскільки вони також можуть мутувати

    Також з моїх спостережень: цей газ підкосив чимало людей, а інших вже викосили гуманоїди...

    __________________________________________________________________________________

    Основне, що я зміг зрозуміти за перший день:

    1) Гуманоїди набагато сильніші за людей, їх кістки проросли у зворотньому напрямку, а їх мотиви взагалі не зрозумілі

    2) Правління вже відрядило величезний гвинтокрил, який називають \"Рятувалиний ковчег\" він має бути ністільки великим, що зможе евакуювати цілу область (проте я на нього все одно не піду з вище вказаних причин)

    3) Газ блокує будь який зв'язок, а апаратура в яку потрапляє газ перестає працювати

    Виходячи з вище сказаного мені просто потрбно протриматись у місті кілька днів, поки влада не пришле військових на зачистку території (а це має статись напевно після відльоту ковчега), доти ж мені просто треба триматись

    """
    nvl hide
    
    "На всю наступну сторінку було написано"
    
    nvl clear
    diary """
    
    Борись.
    
    Борись.. 
    
    Борись..!
    
    """
    nvl hide

    "Записи продовжились вже з сьомого дня"

    nvl clear
    diary """
    
    ~ День 7 ~ 27.11 ~

    Останні дні були просто скажені, хоча після падіння метеориту вони всі такі..

    Газ з того метеорита перетворив Київ на зону жаху і безпека стала моїм головним пріоритетом
    
    Перші дні я у постійному пошуку провізії, а ще здибав собі пістолет, весь інший тиждень я постійно пересувався з одного місця на інше, шукаючи безпечних укриттів у занедбаних будівлях. Але здається, що ніде не було повністю безпечно

    Найскладніше було залишити свою квартиру, де я проживав. Там я відчувався як відсторонений, але зомбі атакували майже постійно, і я був змушений шукати нового притулку

    В решті решт  мені вдалося знайти цілий будинок на околиці міста, який виглядає мало пошкодженим 
    
    Здається, що його власники вже покинули його до падіння метеориту, але я весь час відчував себе якимось винним, що задерся у чужий дім, в той же час я розумію, що у цій ситуації немає місця на сумніви
    
    Я став дуже пильним, я би навіть сказав, що ця пильність знаходиться на межі параної 
    
    Я смикаюсь через будь який найменший звук думаючи, що гуманоїди пробрались у моє укриття, але в основному це виявляється щось не значне, типу вітерець подув і хвіртка скрипнула, а я вже цілюсь вишукуючи гуманоїда на порозі

    Втім на моє здивування сьогодні все було досить тихо

    За цілий день я не побачив жодного гуманоїда, проте сьогодні я бачив, як над містом летить таки той гвинтокрил, який ще ковчегом назвали

    Він дійсно величений, це видно навіть незважаючи на його віддаленість від землі

    Якщо я побачив його над містом, отже за розрахунками військові мають вже скоро прийти на зачистку міста

    """
    nvl hide

    "Наступна нотатка датувалась двадцять восьмим листопада"

    nvl clear
    diary """
    
    ~ День 8 ~ 28.11 ~

    Цей день став найжахливішим досвідом за все моє виживання з моменту падіння метеорита 
    
    Військові почали бомбити місто, і я опинився у полоні вогню і руйнувань

    Вранці я почув гучний , а згодом і вибухи 
    
    Я піднявшись на дах будинку, я був шокований картиною, що розгортається переді мною 
    
    Військові літаки бомбили місто, спустошуючи будівлі і вулиці 
    
    Здавалося, що ніщо не залишиться стояти

    Моя перша реакція була сховатися, тож я занурився в підвал будинку, сподіваючись, що стіни зможуть захистити мене від смертоносних фрагментів та уламків 
    
    Вибухи трясли землю, але я мусив утримувати свою паніку під контролем, але у мене не вдавалось це робити доки голову сверлило єдине запитання: \"Нащо?\"

    За весь час поки я був під обстрілами я все перебирав варіанти і єдиним хоч якось логічним поясненням стало те що верхівка влади вирішила, що в місті нікого не мало би лишитись, всі мали би евокуюватись на ковчезі

    Але це все одно не могло виправдати їх..

    Після декількох годин бомбардування вибухи затихли

    """
    nvl hide

    "Наступна сторінка була майже не заповнена, буквально кілька речень"

    nvl clear
    diary """
    
    ~ День 12 ~ 04.12 ~

    Увесь цей час, усі ці чотири дні бомбардування повторювались, як мінімум раз на день, але я все ж намагався приводити собі якісь аргументи за те щоб залишитись у місті, але сьогодні, коли бомбардування затихли на декілька годин я виходив на розвідку

    Побачвши все залишки міста я зрозумів, що настав час зізнатися собі, що моє місто тепер знаходиться у руїнах, а отже залишатись у ньому просто немає сенсу

    Завтра я виїзжаю з міста до найближчого поселення, яке буде достатньо маленьким аби постійно не зустрічатись із гуманоїдами

    """
    nvl hide

    "Наступна нотатка виявилась останньою"

    nvl clear
    diary """
    
    ~ День 13 ~ 05.12 ~

    Сьогодні був один з найскладніших днів в моєму житті після цієї апокаліптичної катастрофи. Я вирішив перетнути річку і знайти нове притулок, але те, що я побачив, залишило мене безмовним.

    Наближаючись до найближчого мосту через річку, я відразу помітив, що міст був повністю зруйнований. Лише розірвані шматки сталі залишилися, свідчачи про те, що тут колись було переправою. Річка здавалася непрохідною перепоною, але я не міг сидіти на місці.

    Знімаючи лишню одежу, щоб не стати важким тягарем, вирішив перепливати річку. Вода була холодною і потужною, але я протистояв їй з усією силою, якою мав.

    Потрапивши на протилежний берег, я майже втратив надію. Тут відкривався міжнародний барикадний пост, або, скоріше, те, що від нього залишилося. Люди обкрадали та вбивали одне одного просто небацьким чином. Беззаперечно, люди стали небезпечнішими за гуманоїдів.

    Тривало мить, щоб зрозуміти, що маю справу зі збрехливими, безжалісними супротивниками. Я не можу довіряти навіть тим, що здаються найбільшими союзниками. Вони стали живими пастками, а потенційна загроза зіткнення з ними лише збільшується.

    Мій внутрішній голос каже мені, що найкраще, що я можу зробити - уникати будь-яких контактів з людьми. Залишаючись на своєму шляху, я віддаю перевагу самотності. Можливо, з таким підходом я збережу своє життя.

    """
    nvl hide
    scene military_room
    show maks_normal
    "Моє читання перервав побратим Максим, який зайшов до казарми"
    maks "Шо ти, Олекса, готовий відправитись на відвойовування Києва?"
    olek "Ти навіть не уявляєш на скільки"
    maks "І що тобі взагалі не лячно повертатись у зруйноване місто?"
    olek "Звісно страшно, я ж в ньому виріс, і не хочеться дивитись на всі ці зруйновані будинки та згадувати, як ти гасав цими вуличками з друзями, але чимало людей поклали своє життя, щоб ми змогли повернути, хоча б цю північ країни"
    maks "Твоя правда"
    maks "Ну, добре, збирайся. Збір через десять хвилин, перевір чи все ти з собою взяв і виходь до злітної смуги, я буду чекати тебе там"
    olek "Добре, Максе, побачимось за десять хвилин"
    "Він вийшов з казарми та попрямував злітної смоги"
    "Я також довго не чекав"
    "Швидко зібрав усі речі та попрямував до злітної смуги"
    "Маким, як і казав уже чекав мене там"
    maks "О ти вже тут? І десяти хвилин не пройшло"
    olek "Ну так старався..!"
    "З посмішкою сказав я"
    maks "Слухай, я хотів тобі сказати якщо у мене не буде потім можливості.."
    olek "Давай без всяких пересмертних промов, добре?"
    maks "Та я не.."
    maks "..."
    maks "І все ж я хочу тобі сказати, що я ради, що ти приєднався до війська рік тому.."
    olek "Я також радий, що приєданвся, Максиме"
    scene end30
    pause
    if persistent.end30 == False:
        $ renpy.notify("Кінцівку здобуто")
        $ persistent.end30 = True
    return




# Рішення вбивати зараженого сусіда, і викрадення ключів від його машини
label Kill_neighbor:
    $ vas = Character("Васильович", color="#009900")
    "Тікати - це, безумовно, найглупіший варіант, тож залишається лише вбити його."
    "Але просто так нічого не вийде, треба придумати, як."
    "Як?.."
    "..."
    "Так, я повинен змусити його покалічити самого себе, але для цього мені потрібно..."
    "Я не встиг придумати план, а Васильович вже на мене кинувся."
    "Отже, мені потрібно діяти швидше, ніж думати."
    "З ледь помітним ухиленням я уникнув кидка Васильовича."
    "Але через це ухилення я потрапив у вітальню, де вже лежало розбите скло від серванту."
    "Швидко я схопив найбільший шматок скла."
    "Добре, тепер спробую пробити його голову цим склом."
    "Васильович, а точніше, те, що раніше було Васильовичем, повільно наближався до мене, майже розуміючи мою нездатність зробити йому хоч щось."
    "Це точно зіграє на мою руку."
    "Коли Васильович наблизився на відстань витягнутої руки, я вирішив, що настав мій шанс."
    "Швидким ударом я націлив скло на його голову."
    "І ось вона, перемога..."
    "Але здається, що ні."
    "Скло просто розбилося об його шкіру, не залишивши жодних слідів, ні подряпин, ані нічого."
    "Тож це безнадійно?"
    "Чи я не можу його вбити?"
    "Чи є лише один вихід - тікати?"
    "Здається, удар по голові розгубив Васильовича, і він почав кричати, готуючись до атаки."
    vas "Гаррррр!"
    "Тоді мені треба тікати..."
    "Але це теж не буде просто, мені потрібно здобути трохи переваги, щоб встигнути вибігти з квартири."
    "Отже, зробимо так..."
    "Я різко відхилився вправо."
    "Васильович також відхилився, але не кинувся за мною, проклятий."
    "Добре, можливо, він просто не побіжить."
    "Я швидко побіг до дверей."
    "Васильович зрозумів мій план і кинувся перерізати мою дорогу."
    "Він з усього розгону влетів у величезну шафу та зламав ніжки."
    "Шафа почала падати."
    "Внаслідок удару головою Васильович не розумів, що відбувається, і шафа придавила його."
    "Я ж, завдяки ухиленню від кидка Васильовича, трохи відірвався й мене не зачепило."
    "Проте двері заблоковані шафою, а з-під неї виходить той проклятий зелений газ."
    "Що робити?"
    "Вибратися через вікно з другого поверху в місто, наповнене такими ж мутантами, як Васильвоич - точно не варіант."
    "Тож мені треба розблокувати двері."
    "Затримавши дихання, я підійшов до краю упавшої шафи і схопився за її край."
    "Раз, два, взяли!"
    "Я тягнув край шафи, як зміг, проте вона все не рухалась."
    "На останньому подиху повітря я змушений був вдихнути."
    "Імпровізований протигаз з мокрого рукава кофти повинен був полегшити вплив газу, але я не був певен, наскільки ефективно."
    "Але немає часу думати про це, мені треба вибратися звідси, або повторити долю Васильовича й стати гуманоїдом."
    olek "Піддавайся, проклята курва!"
    "Закричав я в надії, що крики нададуть мені сили, як у багатьох аніме, які я раніше бачив."
    # Звук скрипу
    "Здається, це реально спрацювало, шафа поступилась, відкриваючи мені щілину."
    "Забравши ключі від машини, які, як завжди, лежали на маленькій шафці біля виходу, нарешті я вийшов з кімнати Васильовича і почав підніматися на свій поверх."
    "Невже я врятований"
    "Але це лише перша сутичка, якщо зараз все місто в цій нечисті, то мені треба буде з'ясувати, як я можу їх перемогти"
    "А найголовніше, мені треба з'ясувати як я можу більш безпечно покинути місто"
    "..."
    "Ну, їхати на евакуацію з військовими - це точно не варіант"
    "Адже, за умови, що люди перетворюються на гуманоїдів, йти до озброєних, добре натренованих людей – це самовіддача. Тому потрібен інший план"
    "..."
    "Найкращим варіантом, напевно, буде виїжджати самому, максимум вдвох, щоб було легше контролювати свій стан і, у разі чого, швидко втекти"
    "Добре, машина в мене вже є, отже залишилися лише провізія та точний план виїзду"
    "Тому мені все ж потрібно скласти план та зібрати провізії"
    "План можна скласти трохи пініше, а от без провізії я довго не протягну в будь якому випадку, тож треба буде знову виходити в місто"
    "Але зпершу треба зайти додому та взяти рюкзак аби було куди складати провізію"
    "Я піднявся до своєї квартири"
    "Вона виглядала так само, як і коли я йшов"
    "Це мене обрадувало"
    "Хоч щось в цьому світі не міняються"
    "Доречі про незмінне, потрібно набрати батькам"
    "Взявши телефон до рук я виявив, що зв'язку не має"
    "Трясця"
    "Сподіваюсь з ними все добре"
    "..."
    "Я підійшов до ліжка біля якого лежав рюкзак, та сів аби дістати з нього все що там було"
    "У цей момент я відчув надлюдську втому"
    "Такої я не відчував ніколи, навіть коли цілими днями займався спортом"
    olek "Так.." 
    olek "Блокнот.."
    olek "Пенал..."
    "Схоже я не користувався ним з тих пір як закінчив коледж..."
    olek "Далі..."
    olek "Зо-ши-ти..."
    "Я дуже втомився і повіки застелили очі, так я схоже не зможу встати зараз..."
    "Напевно краще напевно сходити за провізією ввечері..."
    "..."
    # Чорний екран
    window hide
    scene clock_four with fade
    pause(1.0)
    scene bg clock_six with fade
    pause(1.0)
    window show
    scene bg bg with fade
    "Схоже я проспав весь день"
    "Отже час вже висуватись на розвідку та збір провізії"
    "Добре. Я готовий"
    "Почав я свою розвідку з того, що перевірив будинок на наявність інших людей чи гуманоїдів"
    "Нікого не виявлено"
    "З одного боку це чудово так навіть безпечніше"
    "А з іншого боку я залишився сам на сам з цим містом повним гуманоїдів та інших небезпек"
    "Ну нічого..."
    "Наступним кроком плану мав би бути вихід у магазин, але зараз мені в голову прийшла така думка, що непогано було б перенести пожежну драбину собі під вікно"
    "Так я і зробив"
    "Впринципі переніс драбини собі під вікно був не такою важкою процедурою, бо вона знаходилась під вікном у мого сусіда"
    "Можливо простіше було б переміститись у його квартиру, але якось своє, воно і рідніше, і якось більш захищено відчувається"
    "Тож з драбиною було покінчено, можна і в магазин сходити"
    "Зайти у великий магазин було б добре з боку різноманіття та якості провізії, але з боку безпеки це було б максимально безглуздо"
    "Тому мені треба знайти якийсь кіоск, максимально віддалений від можливих скупчень людей"
    "В принципі найближчим таким кіоском був той що знаходився біля парку"
    "Надиво на вулицях досить тихо"
    "По дорозі до кіоску я незустрів нікого, ні гуманоїдів, ні людей"
    "Проте пересуватись я вирішив маленькими перебіжками, аби і самому не потрапитись нікому на очі"
    "Дійшов я до кіоска досить спокійно"
    "На моє здивування він був майже не зачеплений людьми і продуктів в ньому було повно, наскільки це було можливо для звичайного кіоска"
    "За декілька хвилин я вже заповнив рюкзак різними видами харчів. Від різноманітних консерв до локшини швидкого приготування і різного виду енергетичних батончиків"
    "Отже тепер, коли з провізією завершено, потрібно зайнятись розвідкою. Тому додому я піду так само маленькими перебіжками, але іншим маршрутом"
    "Через прилеглі до парку території, фактично я просто обійду район з іншого боку"
    "Я біг та ховався за будь який виступ, за яким я би міг заховатись"
    "Всю дорогу мене не полишало відчуття тривоги, та якогось не розуміння, бо ні людей, ні гуманоїдів я так і не зустрів"
    "Це видавалось мені диввним, бо скоріш за все люди ставали гуманоїдами через той зелений газ, що розходився від метеорита"
    "Газ вже заполонив, не певен що все місто, але весь район точно"
    "Він стоїть наче туман, отже люди які живуть на верхніх поверхах, якщо вони звісно не вжили якихось заходів, що є мало ймовірним через те що приліт відбувся о четвертій і ніхто цього впринципі не чекав, також стали гуманоїдами"
    "Виходячи з цього назріває логічне питання: де всі?"
    "Не те щоб я дуже хотів знову зустрітись із гуманоїдом, але якось насторожувало успідомлення що вони десь є, а я їх не бачу"
    "Аж раптом із-за кута дому за який я сховався вийшов гуманоїд"
    "Тьфу блін... Накркав!"
    "Він був більший за тих двох яких я зустрічав до цього"
    "Йшов він дуже повільно, так ніби знав що він тут головний"
    "Я швидко відбіг за найближче укриття, яке було позаду сподіваючись, що цей амбал мене не помітив"
    "А він схоже і не помітив, наче був сконцентрований на чомусь іншому"
    "Він просто йшов вперед, до центру парка"
    "Всупереч здоровому глузду я вирішив, що маю прослідкувати за ним та спробувати зрозуміти"
    "Такими ж маленькими перебіжками як і раніше я почав слідувати за ним"
    "Це переслідування завело мене у центр парку"
    "Навколо найвищої, центральної статуї зюрмилась велечезна куча гуманоїдів" 
    "Всі вони були не схожі один на одного, але вони всі переслідували одну ціль - забратись на центральну статую"
    "Вона була найвща у парку, тож не дивно що чоловік намагався залізти саме на неї"
    "Він намагався дертися все вище та вище, але постійно зісковзував"
    "Я заховався за найдальшою статуєю та почав спостерігати"
    "Чоловік був не надто молодий, проте й не старий, як би сказав якийсь старомодний персонаж фільму: \"У самому розквіті сил\""
    "Врешті решт він таки заліз на найвищий виступ статуї та гордо закричав"
    chel "Ага, з'їли?! Я тепер на вершині і ви сюди не залізете"
    chel"Мені лише треба протриматись тут тиждень та військові з \"Рятувального ковчега\" врятують мене!"
    "Гуманоїди наче нічого непочувши продовжували юрмитись навколо статуї"
    "Деякі з них намагались залізти на неї, але схоже інтелект у гуманоїдів був доволі слабкий, і вони падали вже на другому виступі"
    "Проспостерігавши за цим я дійшов до висновку, що чоловік на статуї тиждень там точно не протримається і я вирішив, що маю спробувати йому допомогти"
    "Я відбіг на декілька метрів у сторону виходу з парку та крикнув"
    olek "Агов! Сюди недолюди!"
    "Але схоже це не сильно допомогло чоловікові, бо саме в це момент ззаду його хапнув за ногу гуманоїд та потягнув його вниз"
    "Більшість гуманоїдів накинулись на легку здобич у виді впавшого чоловіка, але деякі таки зреагували на мене"
    "Я намагався бігти настільки ж швидко, як і від Васильовича, але з, 15 кілограмами на спині, принаймні так здавалось, робити це було дуже тяжко"
    "Я щей вирішив моневрувати аби заплутати гуманоїдів, але нічого не допомагало"
    "Я праворуч, вони за мною"
    "Я ліворуч, вони за мною"
    "Врешті реш я побачив свій дім"
    "Збиратись по драбині погане рішення, просто бігти в підїзд теж не найкраще, вони ж просто виб'ють двері і все, тож що робити..?"
    "Думай... Думай..."
    "Ідея!"
    "Я швидко дременув у вузенький провулок праворуч"
    "Великій кількості гуманоїдів яквно не вистачить місця у ньому, тож це їх трохи зповільнить"
    "Тепер треба зробити гак навколо дому, аби сплутати сліди, поки вони будуть проходити той провулок"
    "Все... врятований..."
    "Провізія зібрана, лишився лише план"
    "Я піднявся у свою квартиру, забарекадував двері та кинув рюкзак на ліжко після чого сів за робочий стіл"
    "Мені треба розробити план дій та виїзду з міста, проте для початку треба з'ясувати щось про \"Рятувальний ковчег\""
    "Я щось про нього чув раніше, але ніколи особливо не вдався в подробиці, тож саме час дізнатись більше"
    "..."
    olek "Ага, ось же!"
    olek "\“Рятувальний ковчег\” — це державна ініціатива, на випадок якоїсь катастрофи, в результаті якого треба буде евакуювати велику кількість людей. Вона складається з 5 — 15 надвмістких гвинтокрилів, в залежності від 	величини міста, на які будуть поміщені всі цивільні громадяни, та гості міста"
    "Отже мені теба саме туди, але де він має бути? Чоловік на статуї казав що він прилетить за тиждень, але куди..?"
    olek "Ось воно, зрозумів!"
    "\"Рятувальний ковчег\" має прибути у населений пункт на заході країни, схоже цей газ поширився не лише у нас, а щей далеко на схід, можливо його рознесли заражені, а може й вітер"
    "В будь-якому випадку мені треба буде їхати..."
    "Але як?"
    "Я розрукував карту на папері та почав креслити оптимальний шлях виїзду з міста..."
    window hide
    scene day_2 with fade
    pause(1.5)
    scene bg bg with fade
    window show
    "За роздумами пройшла ціла ніч і вирішив, що мій маршрут має бути таким: попеше запрвка, подруге зброярня, та виїзд з міста після перегрупування"
    "Так напевно це найоптимальніший план"
    "Як тільки я встиг подумати це у мої двері почали ломитись гуманоїди"
    "Я швидко схопив рюкзак, заховав катру з маршрутом та відкрив вікно"
    "Мене вже чекала заздалегіть підготовленна пожежна драбина"
    "Я почав спускатись по ній, ключі від машини брязкали у кишені, а двері ... під натиском зграї гуманоїдів"
    "Не сказати, що я чекав, що доведеться покидати рідну квартиру так рано, але я був майже на сто відсотків впевнений у тому, що в будь якому випадку доведеться це зробити"
    "Я, можна сказати, злетів по тій драбині і побіг в сторону імпровізованої парковки у дворі"
    "Машина Васильовича була досить стара, але він за нею добре доглядав, тож автомобіль був у досить хорошому стані"
    "Я відкрив машину та зі швидкістю блискавки вмостився на водійське місце"
    "Машина завелась просто миттєво, а я не зміг так же миттєво почати їхати"
    "Все ж відсутність практики протягом двох років давала про себе знати, але я мав почати їхати, якщо хотів жити"
    "Стартувати вдалося лише з пробуксовкою, проте все ж вдалось"
    "Я покинув свій двір у напрямку околиць"
    "Першим місцем за планом була заправка, тож туди я й прямував"
    "Їхав я ненадто впевнено, в знаки давались роки без практики, проте навіть так я помітив, як змінилося місто буквально за день після падіння метеориту"
    "Воно було фактично мертве, ніби задихнулось тим зеленим газом"
    "Людей на вулицях ніби ніколи й не було"
    "Всі машини покинуті, а вікна будинків розбиті"
    "Колись тут вирувало життя, а зараз лише спогади окрашують ці бетонні коробки та дороги між ними"
    "Можливо, якби я їхав довше вглядаючись у ці спустошені вулички я би міг збожеволіти, але на щастя я вже підїзжав до заправки"
    "На моє здивування тут нікого не має"
    "Хоча бензину схоже теж не багато"
    "Так-сяк я набрав майже повний бак та рушив до другої точки в плані - зброярні"
    "По дорозі я бачив пару маленьких груп гуманоїдів, проте я думаю вони мене не помітили"
    "Я підїхав до зброярні"
    "Її вікна були розбиті, а зброя що залишилась булу розкудана ніби до мене тут вже хтось був, але ось хто це був - не ясно"
    "Чи то люди, чи то гуманоїди, втім зараз їх тут немає, то й добре"
    "Чесно кажучи у зброї я не розбираюсь, тому не знаю що й вибрати, хоча досвід в 1000 наіграних годин у різноманітні шутери мені мали б, напевно, допомогти, проте вони мене тільки заплутували"
    "Все ж таки я знайшов якийсь пістолет, який більш-менш викликав довіру, та патрони, які були так-сяк схожі на ті що були в його магазині"
    "Тепер вже час виходити, їхати не перегруповку в новий сховок та на виїзд з міста"
    "Тільки я почав відходити від прилавка, як із-за кута будинку вийшла маленька зграя гуманоїдів"
    "Я одразу ж сховався за вітрину в надії, що вони не зайдуть сюди"
    "..."
    "Почувся звук розбившогося скла"
    "Невже вони все ж йдуть сюди?!"
    "Я зняв пістолет з запобіжника та приготувався стріляти"
    "Кроки чомусь стали більш тихими"
    "Вони знають, що я тут і вирішили підкрадатись?!"
    "Я вирішив, що просто чекати на свою смерть я не збираюсь, тож висунувся трохи із-за вітрини та побачив, як гуманоїди заходять в магазин навпроти"
    "Тож я полегшено зітхнувши почав підкрадатись до свого автомобіля так, щоб мене не помітили"
    "Аж раптом з магазину навпроти прозвучав гучний крик"
    $ mil = Character("???", color="#FFFFFF")
    mil "Забирайтесь від мене бісові діти!!!"
    "Я озернувся та побачив у тому магазині дівчину, яка вперлась в прилавок спиною, а зпереду до неї вже йшло троє гуманоїдів"
    "Що ж робити..."
    $ time = 7
    $ timer_range = 7
    $ timer_jump = 'Not_help_girl'
    show screen countdown
    menu:
        "Врятувати дівчину":
            hide screen countdown
            jump Help_girl
        "Не рятувати дівчину":
            hide screen countdown
            jump Not_help_girl
    return